Repository: firaolterefe447-cyber/-arbor-market
Catalog: locale/*/LC_MESSAGES/django.po
Languages: am

source: English
am: እንግሊዝኛ

source: Amharic
am: አማርኛ

source: Afaan Oromoo
am: አፋን ኦሮሞ

source: Somali
am: ሶማሊኛ

source: Tigrinya
am: ትግርኛ

source: {editor}: Editing failed
am: {editor}: ማረም አልተሳካም

source: {editor}: Editing failed: {e}
am: {editor}: ማረም አልተሳካም: {e}

source: Options
am: አማራጮች

source: Got unexpected extra argument ({args})
am: ያልተጠበቀ ተጨማሪ ክርክር ({args}) ተገኝቷል

source: DeprecationWarning: The command {name!r} is deprecated.{extra_message}
am: የማይመከር ማስጠንቀቂያ: ትዕዛዝ {name!r} ከአገልግሎት ውጪ ነው።{extra_message}

source: Aborted!
am: ተቋርጧል!

source: Commands
am: ትዕዛዞች

source: Missing command.
am: ትዕዛዝ ጠፍቷል።

source: No such command {name!r}.
am: እንደዚህ ያለ ትዕዛዝ {name!r} የለም።

source: Value must be an iterable.
am: እሴቱ ተደጋጋሚ መሆን አለበት።

source: Takes {nargs} values but 1 was given.
am: {nargs} እሴቶችን ይወስዳል ነገር ግን 1 ተሰጥቷል።

source: DeprecationWarning: The {param_type} {name!r} is deprecated.{extra_message}
am: የማይመከር ማስጠንቀቂያ: {param_type} {name!r} ከአገልግሎት ውጪ ነው።{extra_message}

source: env var: {var}
am: የአካባቢ ተለዋዋጭ: {var}

source: default: {default}
am: ነባሪ: {default}

source: (dynamic)
am: (ተለዋዋጭ)

source: %(prog)s, version %(version)s
am: %(prog)s፣ ስሪት %(version)s

source: Show the version and exit.
am: ስሪቱን አሳይ እና ውጣ።

source: Show this message and exit.
am: ይህንን መልእክት አሳይ እና ውጣ።

source: Error: {message}
am: ስህተት: {message}

source: Try '{command} {option}' for help.
am: ለእርዳታ '{command} {option}' ይሞክሩ።

source: Invalid value: {message}
am: ትክክል ያልሆነ እሴት: {message}

source: Invalid value for {param_hint}: {message}
am: ለትክክል ያልሆነ እሴት {param_hint}: {message}

source: Missing argument
am: ክርክር ጠፍቷል

source: Missing option
am: አማራጭ ጠፍቷል

source: Missing parameter
am: መለኪያ ጠፍቷል

source: Missing {param_type}
am: {param_type} ጠፍቷል

source: Missing parameter: {param_name}
am: መለኪያ ጠፍቷል: {param_name}

source: No such option: {name}
am: እንደዚህ ያለ አማራጭ የለም: {name}

source: Did you mean {possibility}?
am: {possibility} ማለታችሁ ነው?

source: unknown error
am: ያልታወቀ ስህተት

source: Could not open file {filename!r}: {message}
am: ፋይል መክፈት አልተቻለም {filename!r}: {message}

source: Usage:
am: አጠቃቀም:

source: Argument {name!r} takes {nargs} values.
am: ክርክር {name!r} {nargs} እሴቶችን ይወስዳል።

source: Option {name!r} does not take a value.
am: አማራጭ {name!r} እሴት አይወስድም።

source: Option {name!r} requires an argument.
am: አማራጭ {name!r} ክርክር ይጠይቃል።

source: Shell completion is not supported for Bash versions older than 4.4.
am: ሼል ማጠናቀቂያ ከ 4.4 በላይ ለሆኑ የባሽ ስሪቶች አይደገፍም።

source: Couldn't detect Bash version, shell completion is not supported.
am: የባሽ ሥሪት መለየት አልተቻለም፣ ሼል ማጠናቀቂያ አይደገፍም።

source: Repeat for confirmation
am: ለማረጋገጥ ይድገሙ

source: Error: The value you entered was invalid.
am: ስህተት: ያስገቡት እሴት ትክክል አይደለም።

source: Error: {e.message}
am: ስህተት: {e.message}

source: Error: The two entered values do not match.
am: ስህተት: ሁለቱ የገቡት እሴቶች አይዛመዱም።

source: Error: invalid input
am: ስህተት: ትክክል ያልሆነ ግብአት

source: Press any key to continue...
am: ለመቀጠል ማንኛውንም ቁልፍ ይጫኑ...

source: Choose from: {choices}
am: ከሚከተሉት ውስጥ ይምረጡ: {choices}

source: {value!r} is not {choice}.
am: {value!r} {choice} አይደለም።

source: {value!r} does not match the format {format}.
am: {value!r} ከቅርጸት {format} ጋር አይዛመድም።

source: {value!r} is not a valid {number_type}.
am: {value!r} ትክክለኛ {number_type} አይደለም።

source: {value} is not in the range {range}.
am: {value} በክልል {range} ውስጥ አይደለም።

source: {value!r} is not a valid boolean. Recognized values: {states}
am: {value!r} ትክክለኛ ቡሊያን አይደለም። እውቅና የተሰጣቸው እሴቶች: {states}

source: {value!r} is not a valid UUID.
am: {value!r} ትክክለኛ ዩዩአይዲ (UUID) አይደለም።

source: file
am: ፋይል

source: directory
am: ማውጫ

source: path
am: መንገድ

source: {name} {filename!r} does not exist.
am: {name} {filename!r} የለም።

source: {name} {filename!r} is a file.
am: {name} {filename!r} ፋይል ነው።

source: {name} {filename!r} is a directory.
am: {name} {filename!r} ማውጫ ነው።

source: {name} {filename!r} is not readable.
am: {name} {filename!r} ሊነበብ አይችልም።

source: {name} {filename!r} is not writable.
am: {name} {filename!r} ሊጻፍ አይችልም።

source: {name} {filename!r} is not executable.
am: {name} {filename!r} ማስፈጸም አይቻልም።

source: {len_type} values are required, but {len_value} was given.
am: {len_type} እሴቶች ያስፈልጋሉ፣ ነገር ግን {len_value} ተሰጥቷል።

source: Messages
am: መልዕክቶች

source: Site Maps
am: የጣቢያ ካርታዎች

source: Static Files
am: የማይንቀሳቀሱ ፋይሎች

source: Syndication
am: ሲንዲኬሽን

source: That page number is not an integer
am: ያ የገጽ ቁጥር ኢንቲጀር አይደለም

source: That page number is less than 1
am: ያ የገጽ ቁጥር ከ 1 ያነሰ ነው

source: That page contains no results
am: ያ ገጽ ምንም ውጤት አልያዘም

source: Enter a valid value.
am: ትክክለኛ እሴት ያስገቡ።

source: Enter a valid domain name.
am: ትክክለኛ የጎራ ስም ያስገቡ።

source: Enter a valid URL.
am: ትክክለኛ ዩአርኤል (URL) ያስገቡ።

source: Enter a valid integer.
am: ትክክለኛ ኢንቲጀር ያስገቡ።

source: Enter a valid email address.
am: ትክክለኛ የኢሜይል አድራሻ ያስገቡ።

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
am: ፊደሎች፣ ቁጥሮች፣ ከስር መስመሮች ወይም ሰረዞች ያቀፈ ትክክለኛ “slug” ያስገቡ።

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
am: ዩኒኮድ ፊደሎች፣ ቁጥሮች፣ ከስር መስመሮች ወይም ሰረዞች ያቀፈ ትክክለኛ “slug” ያስገቡ።

source: Enter a valid %(protocol)s address.
am: ትክክለኛ %(protocol)s አድራሻ ያስገቡ።

source: IPv4
am: አይፒቪ4 (IPv4)

source: IPv6
am: አይፒቪ6 (IPv6)

source: IPv4 or IPv6
am: አይፒቪ4 ወይም አይፒቪ6

source: Enter only digits separated by commas.
am: በነጠላ ሰረዝ የተለዩ ቁጥሮችን ብቻ ያስገቡ።

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
am: ይህ እሴት %(limit_value)s መሆኑን ያረጋግጡ (እሴቱ %(show_value)s ነው።)

source: Ensure this value is less than or equal to %(limit_value)s.
am: ይህ እሴት ከ %(limit_value)s ያነሰ ወይም እኩል መሆኑን ያረጋግጡ።

source: Ensure this value is greater than or equal to %(limit_value)s.
am: ይህ እሴት ከ %(limit_value)s የበለጠ ወይም እኩል መሆኑን ያረጋግጡ።

source: Ensure this value is a multiple of step size %(limit_value)s.
am: ይህ እሴት የ %(limit_value)s የእርምጃ መጠን ብዜት መሆኑን ያረጋግጡ።

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
am: ይህ እሴት የ %(limit_value)s የእርምጃ መጠን ብዜት መሆኑን ያረጋግጡ፣ ከ %(offset)s ጀምሮ፣ ለምሳሌ %(offset)s፣ %(valid_value1)s፣ %(valid_value2)s፣ እና የመሳሰሉት።

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
am: ይህ እሴት ቢያንስ %(limit_value)d ፊደል እንዳለው ያረጋግጡ (እሴቱ %(show_value)d አለው)።

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
am: ይህ እሴት ቢበዛ %(limit_value)d ፊደል እንዳለው ያረጋግጡ (እሴቱ %(show_value)d አለው)።

source: Enter a number.
am: ቁጥር ያስገቡ።

source: Ensure that there are no more than %(max)s digit in total.
am: በአጠቃላይ ከ %(max)s በላይ አሃዝ አለመኖሩን ያረጋግጡ።

source: Ensure that there are no more than %(max)s decimal place.
am: ከ %(max)s በላይ የአስርዮሽ ቦታ አለመኖሩን ያረጋግጡ።

source: Ensure that there are no more than %(max)s digit before the decimal point.
am: ከ %(max)s በላይ አሃዝ ከአስርዮሽ ነጥብ በፊት አለመኖሩን ያረጋግጡ።

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
am: የፋይል ቅጥያ “%(extension)s” አይፈቀድም። የተፈቀዱ ቅጥያዎች: %(allowed_extensions)s ናቸው።

source: Null characters are not allowed.
am: ባዶ ፊደላት አይፈቀዱም።

source: and
am: እና

source: %(model_name)s with this %(field_labels)s already exists.
am: ይህ %(field_labels)s ያለው %(model_name)s አስቀድሞ አለ።

source: Constraint “%(name)s” is violated.
am: ገደብ “%(name)s” ተጥሷል።

source: Value %(value)r is not a valid choice.
am: እሴት %(value)r ትክክለኛ ምርጫ አይደለም።

source: This field cannot be null.
am: ይህ መስክ ባዶ ሊሆን አይችልም።

source: This field cannot be blank.
am: ይህ መስክ ባዶ ሊሆን አይችልም።

source: %(model_name)s with this %(field_label)s already exists.
am: ይህ %(field_label)s ያለው %(model_name)s አስቀድሞ አለ።

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
am: %(field_label)s ለ %(date_field_label)s %(lookup_type)s ልዩ መሆን አለበት።

source: Field of type: %(field_type)s
am: የመስክ ዓይነት: %(field_type)s

source: “%(value)s” value must be either True or False.
am: “%(value)s” እሴት እውነት (True) ወይም ሐሰት (False) መሆን አለበት።

source: “%(value)s” value must be either True, False, or None.
am: “%(value)s” እሴት እውነት (True)፣ ሐሰት (False) ወይም ባዶ (None) መሆን አለበት።

source: Boolean (Either True or False)
am: ቡሊያን (እውነት ወይም ሐሰት)

source: String (up to %(max_length)s)
am: ሕብረቁምፊ (እስከ %(max_length)s)

source: String (unlimited)
am: ሕብረቁምፊ (ያልተገደበ)

source: Comma-separated integers
am: በነጠላ ሰረዝ የተለዩ ኢንቲጀሮች

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
am: “%(value)s” እሴት ትክክል ያልሆነ የቀን ቅርጸት አለው። በ YYYY-MM-DD ቅርጸት መሆን አለበት።

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
am: “%(value)s” እሴት ትክክለኛ ቅርጸት (YYYY-MM-DD) አለው ግን ትክክል ያልሆነ ቀን ነው።

source: Date (without time)
am: ቀን (ያለ ሰዓት)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
am: “%(value)s” እሴት ትክክል ያልሆነ ቅርጸት አለው። በ YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] ቅርጸት መሆን አለበት።

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
am: “%(value)s” እሴት ትክክለኛ ቅርጸት (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) አለው ግን ትክክል ያልሆነ ቀን/ሰዓት ነው።

source: Date (with time)
am: ቀን (ከሰዓት ጋር)

source: “%(value)s” value must be a decimal number.
am: “%(value)s” እሴት የአስርዮሽ ቁጥር መሆን አለበት።

source: Decimal number
am: የአስርዮሽ ቁጥር

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
am: “%(value)s” እሴት ትክክል ያልሆነ ቅርጸት አለው። በ [DD] [[HH:]MM:]ss[.uuuuuu] ቅርጸት መሆን አለበት።

source: Duration
am: የቆይታ ጊዜ

source: Email address
am: የኢሜይል አድራሻ

source: File path
am: የፋይል መንገድ

source: “%(value)s” value must be a float.
am: “%(value)s” እሴት ተንሳፋፊ (float) መሆን አለበት።

source: Floating point number
am: ተንሳፋፊ ነጥብ ቁጥር

source: “%(value)s” value must be an integer.
am: “%(value)s” እሴት ኢንቲጀር መሆን አለበት።

source: Integer
am: ኢንቲጀር

source: Big (8 byte) integer
am: ትልቅ (8 ባይት) ኢንቲጀር

source: Small integer
am: ትንሽ ኢንቲጀር

source: IPv4 address
am: አይፒቪ4 አድራሻ

source: IP address
am: አይፒ አድራሻ

source: “%(value)s” value must be either None, True or False.
am: “%(value)s” እሴት ባዶ (None)፣ እውነት (True) ወይም ሐሰት (False) መሆን አለበት።

source: Boolean (Either True, False or None)
am: ቡሊያን (እውነት፣ ሐሰት ወይም ባዶ)

source: Positive big integer
am: አዎንታዊ ትልቅ ኢንቲጀር

source: Positive integer
am: አዎንታዊ ኢንቲጀር

source: Positive small integer
am: አዎንታዊ ትንሽ ኢንቲጀር

source: Slug (up to %(max_length)s)
am: ስላግ (እስከ %(max_length)s)

source: Text
am: ጽሑፍ

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
am: “%(value)s” እሴት ትክክል ያልሆነ ቅርጸት አለው። በ HH:MM[:ss[.uuuuuu]] ቅርጸት መሆን አለበት።

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
am: “%(value)s” እሴት ትክክለኛ ቅርጸት (HH:MM[:ss[.uuuuuu]]) አለው ግን ትክክል ያልሆነ ሰዓት ነው።

source: Time
am: ሰዓት

source: URL
am: ዩአርኤል

source: Raw binary data
am: ጥሬ ሁለትዮሽ ውሂብ

source: “%(value)s” is not a valid UUID.
am: “%(value)s” ትክክለኛ ዩዩአይዲ አይደለም።

source: Universally unique identifier
am: በአለም አቀፍ ደረጃ ልዩ መለያ

source: File
am: ፋይል

source: Image
am: ምስል

source: A JSON object
am: የ JSON ነገር

source: Value must be valid JSON.
am: እሴት ትክክለኛ JSON መሆን አለበት።

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
am: %(field)s %(value)r ያለው %(model)s ምሳሌ ትክክለኛ ምርጫ አይደለም።

source: Foreign Key (type determined by related field)
am: የውጭ ቁልፍ (ዓይነት በተዛማጅ መስክ የሚወሰን)

source: One-to-one relationship
am: አንድ-ለ-አንድ ግንኙነት

source: %(from)s-%(to)s relationship
am: %(from)s-%(to)s ግንኙነት

source: %(from)s-%(to)s relationships
am: %(from)s-%(to)s ግንኙነቶች

source: Many-to-many relationship
am: ብዙ-ለ-ብዙ ግንኙነት

source: This field is required.
am: ይህ መስክ ያስፈልጋል።

source: Enter a whole number.
am: ሙሉ ቁጥር ያስገቡ።

source: Enter a valid date.
am: ትክክለኛ ቀን ያስገቡ።

source: Enter a valid time.
am: ትክክለኛ ሰዓት ያስገቡ።

source: Enter a valid date/time.
am: ትክክለኛ ቀን/ሰዓት ያስገቡ።

source: Enter a valid duration.
am: ትክክለኛ ቆይታ ያስገቡ።

source: The number of days must be between {min_days} and {max_days}.
am: የቀናት ብዛት ከ {min_days} እና {max_days} መካከል መሆን አለበት።

source: No file was submitted. Check the encoding type on the form.
am: ምንም ፋይል አልቀረበም። በቅጹ ላይ ያለውን የምስጠራ አይነት ያረጋግጡ።

source: No file was submitted.
am: ምንም ፋይል አልቀረበም።

source: The submitted file is empty.
am: የቀረበው ፋይል ባዶ ነው።

source: Ensure this filename has at most %(max)d character (it has %(length)d).
am: ይህ የፋይል ስም ቢበዛ %(max)d ፊደል እንዳለው ያረጋግጡ (እሴቱ %(length)d አለው)።

source: Please either submit a file or check the clear checkbox, not both.
am: እባክዎ ፋይል ያስገቡ ወይም የማጽዳት አመልካች ሳጥኑን ይምረጡ፣ ሁለቱንም አይደለም።

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
am: ትክክለኛ ምስል ስቀል። የሰቀሉት ፋይል ምስል አልነበረም ወይም የተበላሸ ምስል ነበር።

source: Select a valid choice. %(value)s is not one of the available choices.
am: ትክክለኛ ምርጫ ይምረጡ። %(value)s ከሚገኙት ምርጫዎች አንዱ አይደለም።

source: Enter a list of values.
am: የእሴቶችን ዝርዝር ያስገቡ።

source: Enter a complete value.
am: ሙሉ እሴት ያስገቡ።

source: Enter a valid UUID.
am: ትክክለኛ ዩዩአይዲ ያስገቡ።

source: Enter a valid JSON.
am: ትክክለኛ JSON ያስገቡ።

source: (Hidden field %(name)s) %(error)s
am: (የተደበቀ መስክ %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
am: የማኔጅመንት ፎርም (ManagementForm) መረጃ ጠፍቷል ወይም ተበላሽቷል። የጠፉ መስኮች: %(field_names)s። ችግሩ ከቀጠለ የሳንካ ሪፖርት ማቅረብ ሊያስፈልግዎ ይችላል።

source: Please submit at most %(num)d form.
am: እባክዎ ቢበዛ %(num)d ቅጽ ያስገቡ።

source: Please submit at least %(num)d form.
am: እባክዎ ቢያንስ %(num)d ቅጽ ያስገቡ።

source: Order
am: ትዕዛዝ

source: Delete
am: ሰርዝ

source: Please correct the duplicate data for %(field)s.
am: እባክዎ ለ %(field)s የተባዛውን ውሂብ ያስተካክሉ።

source: Please correct the duplicate data for %(field)s, which must be unique.
am: እባክዎ ለ %(field)s የተባዛውን ውሂብ ያስተካክሉ፣ ልዩ መሆን አለበት።

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
am: እባክዎ ለ %(field_name)s የተባዛውን ውሂብ ያስተካክሉ፣ በ %(date_field)s ውስጥ ለ %(lookup)s ልዩ መሆን አለበት።

source: Please correct the duplicate values below.
am: እባክዎ ከታች ያሉትን የተባዙ እሴቶችን ያስተካክሉ።

source: The inline value did not match the parent instance.
am: የውስጠ-መስመር እሴት ከወላጅ ምሳሌው ጋር አልተዛመደም።

source: Select a valid choice. That choice is not one of the available choices.
am: ትክክለኛ ምርጫ ይምረጡ። ያ ምርጫ ከሚገኙት ምርጫዎች አንዱ አይደለም።

source: “%(pk)s” is not a valid value.
am: “%(pk)s” ትክክለኛ እሴት አይደለም።

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
am: %(datetime)s በሰዓት ክልል %(current_timezone)s ውስጥ ሊተረጎም አልቻለም; ግልጽ ላይሆን ይችላል ወይም ላይኖር ይችላል።

source: Clear
am: አጽዳ

source: Currently
am: በአሁኑ ጊዜ

source: Change
am: ቀይር

source: Unknown
am: ያልታወቀ

source: Yes
am: አዎ

source: No
am: አይ

source: yes,no,maybe
am: አዎ፣አይ፣ምናልባት

source: %(size)d byte
am: %(size)d ባይት

source: %s KB
am: %s ኪባ

source: %s MB
am: %s ሜባ

source: %s GB
am: %s ጊባ

source: %s TB
am: %s ቲባ

source: %s PB
am: %s ፐባ

source: p.m.
am: ከ.ም.

source: a.m.
am: ጧት

source: PM
am: ከ.ም.

source: AM
am: ጧት

source: midnight
am: እኩለ ሌሊት

source: noon
am: እኩለ ቀን

source: Monday
am: ሰኞ

source: Tuesday
am: ማክሰኞ

source: Wednesday
am: ረቡዕ

source: Thursday
am: ሐሙስ

source: Friday
am: ዓርብ

source: Saturday
am: ቅዳሜ

source: Sunday
am: እሑድ

source: Mon
am: ሰኞ

source: Tue
am: ማክ

source: Wed
am: ረቡ

source: Thu
am: ሐሙ

source: Fri
am: ዓርብ

source: Sat
am: ቅዳ

source: Sun
am: እሑድ

source: January
am: ጥር

source: February
am: የካቲት

source: March
am: መጋቢት

source: April
am: ሚያዝያ

source: May
am: ግንቦት

source: June
am: ሰኔ

source: July
am: ሐምሌ

source: August
am: ነሐሴ

source: September
am: መስከረም

source: October
am: ጥቅምት

source: November
am: ኅዳር

source: December
am: ታህሳስ

source: jan
am: ጥር

source: feb
am: የካ

source: mar
am: መጋ

source: apr
am: ሚያ

source: may
am: ግን

source: jun
am: ሰኔ

source: jul
am: ሐም

source: aug
am: ነሐ

source: sep
am: መስ

source: oct
am: ጥቅ

source: nov
am: ኅዳ

source: dec
am: ታህ

# abbrev. month
source: Jan.
am: ጥር

# abbrev. month
source: Feb.
am: የካ

# abbrev. month
source: March
am: መጋ

# abbrev. month
source: April
am: ሚያ

# abbrev. month
source: May
am: ግን

# abbrev. month
source: June
am: ሰኔ

# abbrev. month
source: July
am: ሐም

# abbrev. month
source: Aug.
am: ነሐ

# abbrev. month
source: Sept.
am: መስ

# abbrev. month
source: Oct.
am: ጥቅ

# abbrev. month
source: Nov.
am: ኅዳ

# abbrev. month
source: Dec.
am: ታህ

# alt. month
source: January
am: ጥር

# alt. month
source: February
am: የካቲት

# alt. month
source: March
am: መጋቢት

# alt. month
source: April
am: ሚያዝያ

# alt. month
source: May
am: ግንቦት

# alt. month
source: June
am: ሰኔ

# alt. month
source: July
am: ሐምሌ

# alt. month
source: August
am: ነሐሴ

# alt. month
source: September
am: መስከረም

# alt. month
source: October
am: ጥቅምት

# alt. month
source: November
am: ኅዳር

# alt. month
source: December
am: ታህሳስ

source: This is not a valid IPv6 address.
am: ይህ ትክክለኛ የአይፒቪ6 አድራሻ አይደለም።

source: or
am: ወይም

source: %(num)d year
am: %(num)d ዓመት

source: %(num)d month
am: %(num)d ወር

source: %(num)d week
am: %(num)d ሳምንት

source: %(num)d day
am: %(num)d ቀን

source: %(num)d hour
am: %(num)d ሰዓት

source: %(num)d minute
am: %(num)d ደቂቃ

source: Forbidden
am: የተከለከለ

source: CSRF verification failed. Request aborted.
am: CSRF ማረጋገጫ አልተሳካም። ጥያቄው ተሰርዟል።

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
am: ይህንን መልዕክት እያዩ ያሉት ይህ የ HTTPS ጣቢያ በድር አሳሽዎ የ'Referer header' እንዲላክ ስለሚፈልግ ነው፣ ነገር ግን ምንም አልተላከም። አሳሽዎ በሶስተኛ ወገኖች እንዳይጠለፍ ለመከላከል ይህ ራስጌ ለደህንነት ምክንያቶች ያስፈልጋል።

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
am: አሳሽዎን የ'Referer' ራስጌዎችን እንዳያጠፋ ካዋቀሩት፣ እባክዎ እንደገና ያንቁት፣ ቢያንስ ለዚህ ጣቢያ፣ ወይም ለ HTTPS ግንኙነቶች፣ ወይም 'same-origin' ጥያቄዎች።

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
am: የ <meta name="referrer" content="no-referrer"> መለያን እየተጠቀሙ ከሆነ ወይም “Referrer-Policy: no-referrer” ራስጌን እያካተቱ ከሆነ እባክዎ ያስወግዱት። የ CSRF ጥበቃ ጥብቅ የማጣቀሻ ምርመራ ለማድረግ የ'Referer' ራስጌን ይፈልጋል። ግላዊነትን በተመለከተ የሚያሳስብዎት ከሆነ፣ ለሶስተኛ ወገን ጣቢያዎች አገናኞች እንደ <a rel="noreferrer" …> ያሉ አማራጮችን ይጠቀሙ።

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
am: ይህንን መልዕክት እያዩ ያሉት ይህ ጣቢያ ቅጾችን ሲያስገቡ የ CSRF ኩኪ ስለሚፈልግ ነው። አሳሽዎ በሶስተኛ ወገኖች እንዳይጠለፍ ለመከላከል ይህ ኩኪ ለደህንነት ምክንያቶች ያስፈልጋል።

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
am: አሳሽዎን ኩኪዎችን እንዳያጠፋ ካዋቀሩት፣ እባክዎ እንደገና ያንቁት፣ ቢያንስ ለዚህ ጣቢያ፣ ወይም ለ 'same-origin' ጥያቄዎች።

source: More information is available with DEBUG=True.
am: ተጨማሪ መረጃ በ DEBUG=True ይገኛል።

source: No year specified
am: ዓመት አልተገለጸም

source: Date out of range
am: ቀን ከክልል ውጭ ነው

source: No month specified
am: ወር አልተገለጸም

source: No day specified
am: ቀን አልተገለጸም

source: No week specified
am: ሳምንት አልተገለጸም

source: No %(verbose_name_plural)s available
am: ምንም %(verbose_name_plural)s አይገኝም

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
am: የወደፊት %(verbose_name_plural)s አይገኙም ምክንያቱም %(class_name)s.allow_future ሐሰት ነው።

source: Invalid date string “%(datestr)s” given format “%(format)s”
am: ትክክል ያልሆነ የቀን ሕብረቁምፊ “%(datestr)s” ከተሰጠው ቅርጸት “%(format)s”

source: No %(verbose_name)s found matching the query
am: ጥያቄውን የሚዛመድ ምንም %(verbose_name)s አልተገኘም

source: Page is not “last”, nor can it be converted to an int.
am: ገጹ “last” አይደለም፣ ወይም ወደ ኢንቲጀር ሊቀየር አይችልም።

source: Invalid page (%(page_number)s): %(message)s
am: ትክክል ያልሆነ ገጽ (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
am: ባዶ ዝርዝር እና “%(class_name)s.allow_empty” ሐሰት ነው።

source: Directory indexes are not allowed here.
am: የማውጫ ኢንዴክሶች እዚህ አይፈቀዱም።

source: “%(path)s” does not exist
am: “%(path)s” የለም

source: Index of %(directory)s
am: የ %(directory)s ማውጫ

source: The install worked successfully! Congratulations!
am: መጫኑ በተሳካ ሁኔታ ሰርቷል! እንኳን ደስ አለዎት!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
am: ለ Django %(version)s <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">የመልቀቂያ ማስታወሻዎችን</a> ይመልከቱ

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
am: ይህንን ገጽ እያዩ ያሉት <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> በቅንጅቶች ፋይልዎ ውስጥ ስለሆነ እና ምንም ዩአርኤሎችን ስላላዋቀሩ ነው።

source: Django Documentation
am: የ Django ሰነድ

source: Topics, references, &amp; how-to’s
am: ርዕሶች፣ ማጣቀሻዎች እና እንዴት እንደሚደረጉ

source: Tutorial: A Polling App
am: መማሪያ: የሕዝብ አስተያየት መስጫ መተግበሪያ

source: Get started with Django
am: በ Django ይጀምሩ

source: Django Community
am: የ Django ማህበረሰብ

source: Connect, get help, or contribute
am: ይገናኙ፣ እርዳታ ያግኙ ወይም አስተዋፅዖ ያድርጉ

source: title
am: ርዕስ

source: password
am: የይለፍ ቃል

source: title a
am: ርዕስ ሀ

source: title b
am: ርዕስ ለ

source: title c
am: ርዕስ ሐ

source: title d
am: ርዕስ መ

source: visits
am: ጉብኝቶች

source: Sorry, translation is not available.
am: ይቅርታ፣ ትርጉም አይገኝም።

source: None
am: ምንም

source: Product Name
am: የምርት ስም

source: Upload Harvest | Arbor
am: ምርት ስቀል | አርቦር

source: Upload Harvest
am: ምርት ስቀል

source: Take a Photo
am: ፎቶ አንሳ

source: Tap to select image
am: ምስል ለመምረጥ ይንኩ

source: Optional
am: አማራጭ

source: If you don't know the English name, leave it blank. Admin will fix it.
am: የእንግሊዝኛውን ስም ካላወቁት፣ ባዶ ይተዉት። አስተዳዳሪው ያስተካክለዋል።

source: Price (ETB)
am: ዋጋ (ብር)

source: /kg
am: /ኪግ

source: Quantity
am: ብዛት

source: kg
am: ኪግ

source: Farm Location
am: የእርሻ ቦታ

source: List on Market
am: በገበያ ላይ ይዘርዝሩ

source: Add Inventory - Arbor
am: የዕቃ ዝርዝር ጨምር - አርቦር

source: Add Inventory
am: የዕቃ ዝርዝር ጨምር

source: Cancel
am: ሰርዝ

source: Stock Qty
am: የዕቃ ብዛት

source: Photo (Optional)
am: ፎቶ (አማራጭ)

source: Add to Store
am: ወደ መደብር ጨምር

source: Complete Payment
am: ክፍያ ጨርስ

source: Complete Transfer
am: ዝውውር ጨርስ

source: Please send
am: እባክዎ ይላኩ

source: ETB
am: ብር

source: Transfer to Seller:
am: ለሻጭ ያስተላልፉ:

source: Bank:
am: ባንክ:

source: CBE (Commercial Bank)
am: ሲቢኢ (የኢትዮጵያ ንግድ ባንክ)

source: Account Name:
am: የመለያ ስም:

source: Copy
am: ቅዳ

source: Upload Screenshot / Receipt
am: የማያ ገጽ ፎቶ / ደረሰኝ ስቀል

source: I have sent the money
am: ገንዘቡን ልኬያለሁ

source: Fresh Market - Arbor
am: ትኩስ ገበያ - አርቦር

source: Arbor Market
am: አርቦር ገበያ

source: Welcome,
am: እንኳን ደህና መጡ,

source: Logout
am: ውጣ

source: Fresh Organic Food
am: ትኩስ ኦርጋኒክ ምግብ

source: Direct from Ethiopia's Best Farmers
am: በቀጥታ ከኢትዮጵያ ምርጥ ገበሬዎች

source: Now
am: አሁን

source: Available Harvests
am: የሚገኙ ምርቶች

source: kg Stock
am: ኪግ ዕቃ

source: Buy Now
am: አሁን ይግዙ

source: No crops listed yet. Farmers are planting! 🌱
am: እስካሁን ምንም ሰብሎች አልተዘረዘሩም። ገበሬዎች እየተከሉ ነው! 🌱

source: Checkout - Arbor
am: ክፍያ ይፈፅሙ - አርቦር

source: Arbor
am: አርቦር

source: Checkout
am: ክፍያ ይፈፅሙ
