Repository: firaolterefe447-cyber/-arbor-market
Catalog: locale/*/LC_MESSAGES/django.po
Languages: am

source: Review Order
am: ትዕዛዝ ይገምግሙ

source: Sold by
am: የተሸጠው በ

source: Unit Price
am: የክፍል ዋጋ

source: Order Details
am: የትዕዛዝ ዝርዝሮች

source: MAX
am: ከፍተኛ

source: Select Payment Method
am: የክፍያ ዘዴ ይምረጡ

source: Cash on Delivery
am: ገንዘብ ሲረከቡ ይክፈሉ

source: Telebirr / M-Pesa
am: ቴሌብር / ኤም-ፔሳ

source: Mobile Banking
am: የሞባይል ባንክ

source: Total to Pay
am: ጠቅላላ የሚከፈል

source: Confirm Order
am: ትዕዛዝ ያረጋግጡ

source: Confirm Purchase
am: ግዢ ያረጋግጡ

source: Review details before payment
am: ከመክፈልዎ በፊት ዝርዝሮችን ይገምግሙ

source: Product
am: ምርት

source: Quantity Needed
am: የሚያስፈልገው ብዛት

source: Choose Payment Method
am: የክፍያ ዘዴ ይምረጡ

source: Mobile Money
am: የሞባይል ገንዘብ

source: Pay Cash on Delivery
am: ገንዘብ ሲረከቡ ይክፈሉ

source: Start Group Buy - Arbor
am: የቡድን ግዢ ጀምር - አርቦር

source: Launch Group
am: ቡድን አስጀምር

source: Start New Group
am: አዲስ ቡድን ጀምር

source: Urban Group:
am: የከተማ ቡድን:

source: Fresh Food
am: ትኩስ ምግብ

source: Farmer Co-op:
am: የገበሬዎች ህብረት:

source: Farm Inputs
am: የእርሻ ግብዓቶች

source: Group Name
am: የቡድን ስም

source: Drop-off Location (For Buyers)
am: የማውረጃ ቦታ (ለገዢዎች)

source: Collection Warehouse (For Farmers)
am: የመሰብሰቢያ መጋዘን (ለገበሬዎች)

source: Where will the truck unload the food?
am: ጭነቱ ምግቡን የት ያወርዳል?

source: Where will the truck drop the fertilizer?
am: ጭነቱ ማዳበሪያውን የት ያወርዳል?

source: Target Goal
am: የዒላማ ግብ

source: Units
am: ክፍሎች

source: Target Price
am: የዒላማ ዋጋ

source: Deadline Date
am: የመጨረሻ ቀን

source: Cancel & Return Home
am: ሰርዝ እና ወደ መነሻ ተመለስ

source: Arbor Marketplace. Connecting communities.
am: አርቦር ገበያ። ማህበረሰቦችን ማገናኘት።

source: Farmer Dashboard - Arbor
am: የገበሬዎች ዳሽቦርድ - አርቦር

source: Market
am: ገበያ

source: My Farm Command
am: የእኔ እርሻ ትዕዛዝ

source: Payment Verification Needed
am: የክፍያ ማረጋገጫ ያስፈልጋል

source: Buyers have sent money via Mobile Banking. Please check receipts.
am: ገዢዎች በሞባይል ባንክ ገንዘብ ልከዋል። እባክዎ ደረሰኞችን ያረጋግጡ።

source: View Receipt
am: ደረሰኝ ይመልከቱ

source: Confirm Receipt
am: ደረሰኝ ያረጋግጡ

source: Report Issue
am: ችግር ሪፖርት ያድርጉ

source: Your Harvest
am: የእርስዎ ምርት

source: Manage your active listings and stock.
am: ንቁ ዝርዝሮችዎን እና ዕቃዎችዎን ያስተዳድሩ።

source: List New Crop
am: አዲስ ሰብል ይዘርዝሩ

source: Active Inventory
am: ንቁ ዕቃ ዝርዝር

source: ETB/kg
am: ብር/ኪግ

source: Stock:
am: ዕቃ:

source: Sold Out
am: ተሽጦ አልቋል

source: Active
am: ንቁ

source: Edit
am: አርትዕ

source: Are you sure you want to delete this crop? This cannot be undone.
am: ይህንን ሰብል መሰረዝ እርግጠኛ ነዎት? ይህ ሊቀለበስ አይችልም።

source: Your fields are empty.
am: እርሻዎ ባዶ ነው።

source: List a crop to start selling!
am: መሸጥ ለመጀመር ሰብል ይዘርዝሩ!

source: Start Listing
am: መዘርዘር ይጀምሩ

source: Need Supplies?
am: አቅርቦቶች ይፈልጋሉ?

source: Buy Fertilizers, Seeds, and Tools from verified suppliers.
am: ማዳበሪያዎችን፣ ዘሮችን እና መሳሪያዎችን ከተረጋገጡ አቅራቢዎች ይግዙ።

source: Open Material Store
am: የቁሳቁስ መደብር ይክፈቱ

source: Market Trends
am: የገበያ አዝማሚያዎች

source: No market data available.
am: ምንም የገበያ መረጃ የለም።

source: Fleet Manifest - Arbor
am: የተሽከርካሪ ማኒፌስት - አርቦር

source: Arbor Fleet
am: አርቦር ተሽከርካሪዎች

source: Official Logistics
am: ይፋዊ ሎጂስቲክስ

source: Driver ID:
am: የሾፌር መታወቂያ:

source: Daily Route
am: ዕለታዊ መስመር

source: Assignments
am: ምደባዎች

source: Order #
am: የትዕዛዝ ቁጥር #

source: KG
am: ኪግ

source: Pickup From
am: ከሚነሳበት ቦታ

source: Deliver To
am: ወደሚደርስበት ቦታ

source: Confirm Pickup
am: መነሳቱን ያረጋግጡ

source: Enter Buyer Code
am: የገዢውን ኮድ ያስገቡ

source: Verify
am: ያረጋግጡ

source: Completed
am: ተጠናቋል

source: All Clear
am: ሁሉም ንፁህ ነው

source: Your manifest is empty.
am: የእርስዎ ማኒፌስት ባዶ ነው።

source: Logistics Dashboard - Arbor
am: የሎጂስቲክስ ዳሽቦርድ - አርቦር

source: Dispatch
am: ማጓጓዣ

source: SCORE
am: ውጤት

source: Your Manifest
am: የእርስዎ ማኒፌስት

source: View Details
am: ዝርዝሮችን ይመልከቱ

source: No active manifest.
am: ንቁ ማኒፌስት የለም።

source: Total
am: ጠቅላላ

source: My Jobs
am: የእኔ ስራዎች

source: Post Trip
am: ጉዞ ይለጥፉ

source: Order Feed
am: የትዕዛዝ ምግብ

source: Assigned to you
am: ለእርስዎ የተመደበ

source: Open
am: ክፈት

source: Done
am: ተከናውኗል

source: Taken
am: ተይዟል

source: From
am: ከ

source: To
am: ወደ

source: No orders found.
am: ምንም ትዕዛዞች አልተገኙም።

source: Wait for new requests.
am: አዲስ ጥያቄዎችን ይጠብቁ።

source: Application Received - Arbor
am: ማመልከቻ ደርሷል - አርቦር

source: Application Pending
am: ማመልከቻ በመጠባበቅ ላይ

source: We have received your application.
am: ማመልከቻዎን ተቀብለናል።

source: Please wait for Admin approval.
am: እባክዎ የአስተዳዳሪ ማጽደቅ ይጠብቁ።

source: Status:
am: ሁኔታ:

source: In Review...
am: በግምገማ ላይ...

source: An admin must verify your account before you can access the Delivery Dashboard.
am: የማድረስ ዳሽቦርድን ከመድረስዎ በፊት አስተዳዳሪ መለያዎን ማረጋገጥ አለበት።

source: Check Status (Login)
am: ሁኔታ ይመልከቱ (ግባ)

source: Back to Home Page
am: ወደ መነሻ ገጽ ተመለስ

source: Edit Product
am: ምርት ያርትዑ

source: Crop Name
am: የሰብል ስም

source: Stock (kg)
am: ዕቃ (በኪግ)

source: Update Photo
am: ፎቶ ያዘምኑ

source: Save Changes
am: ለውጦችን አስቀምጥ

source: Edit Order #
am: ትዕዛዝ ቁጥር # ያርትዑ

source: Edit Order
am: ትዕዛዝ ያርትዑ

source: Current Total:
am: አሁን ያለው ጠቅላላ:

source: New Quantity
am: አዲስ ብዛት

source: Update Order
am: ትዕዛዝ ያዘምኑ

source: 's Farm - Arbor
am: የ' እርሻ - አርቦር

source: Back to Market
am: ወደ ገበያ ተመለስ

source: Farm Profile
am: የእርሻ መገለጫ

source: Active Listings
am: ንቁ ዝርዝሮች

source: Full Harvest List
am: የሙሉ ምርት ዝርዝር

source: kg left
am: ኪግ ቀርቷል

source: In Stock
am: በዕቃ አለ

source: This farmer has no other active listings.
am: ይህ ገበሬ ሌላ ንቁ ዝርዝር የለውም።

source: Community Hub - Arbor
am: የማህበረሰብ ማዕከል - አርቦር

source: My Farm
am: የእኔ እርሻ

source: Command Center
am: የትዕዛዝ ማዕከል

source: Community Hub
am: የማህበረሰብ ማዕከል

source: Sell
am: ይሽጡ

source: Dashboard
am: ዳሽቦርድ

source: Groups
am: ቡድኖች

source: Orders
am: ትዕዛዞች

source: Profile
am: መገለጫ

source: Sign Out
am: ውጣ

source: Group Buying Center
am: የቡድን ግዢ ማዕከል

source: Join forces with neighbors. Buy together. Save together.
am: ከጎረቤቶች ጋር ጥምረት ይፍጠሩ። አንድ ላይ ይግዙ። አንድ ላይ ይቆጥቡ።

source: Groups You Manage
am: የሚያስተዳድሯቸው ቡድኖች

source: Delivery:
am: ማድረስ:

source: Member List
am: የአባላት ዝርዝር

source: Name
am: ስም

source: Phone
am: ስልክ

source: Action
am: እርምጃ

source: Kick this member?
am: ይህን አባል ያባርሩ?

source: Kick
am: አባርር

source: Locked
am: ተቆልፏል

source: No members yet.
am: እስካሁን ምንም አባላት የሉም።

source: Total Order:
am: ጠቅላላ ትዕዛዝ:

source: Goal
am: ግቡ

source: Finalize order?
am: ትዕዛዙን ያጠናቅቁ?

source: Place Final Order
am: የመጨረሻ ትዕዛዝ ያስቀምጡ

source: Waiting for members...
am: አባላት በመጠበቅ ላይ...

source: Order Placed
am: ትዕዛዝ ተቀምጧል

source: Available Groups to Join
am: ለመቀላቀል የሚገኙ ቡድኖች

source: Input Co-op
am: የግቤት ህብረት

source: Urban Group
am: የከተማ ቡድን

source: Leader:
am: መሪ:

source: Pickup Location
am: የመውሰጃ ቦታ

source: committed
am: የተወሰነ

source: Target:
am: ዒላማ:

source: Group Price
am: የቡድን ዋጋ

source: Join
am: ይቀላቀሉ

source: No active groups found.
am: ምንም ንቁ ቡድኖች አልተገኙም።

source: Be the first to start a community group!
am: የመጀመሪያው የማህበረሰብ ቡድን ጀምሮ ይሁኑ!

source: Official Payment Partners
am: ይፋዊ የክፍያ አጋሮች

source: Secure transactions via Ethiopia's trusted financial institutions.
am: በኢትዮጵያ ታማኝ የፋይናንስ ተቋማት በኩል ደህንነቱ የተጠበቀ ግብይቶች።

source: Arbor Marketplace. All Rights Reserved.
am: አርቦር ገበያ። ሁሉም መብቶች የተጠበቁ ናቸው።

source: Arbor - The Grand Market | Farm Direct
am: አርቦር - ታላቁ ገበያ | ቀጥታ ከእርሻ

source: Ethiopia's premier farm-to-table marketplace. Buy fresh, sell direct, and grow together.
am: የኢትዮጵያ ቀዳሚ ከእርሻ ወደ ገበታ የሚወስድ ገበያ። ትኩስ ይግዙ፣ በቀጥታ ይሽጡ እና አብረው ያድጉ።

source: Cultivating...
am: እያመረተ ነው...

source: Type to pop up products...
am: ምርቶች እንዲመጡ ለመፃፍ ይሞክሩ...

source: Supplier Dashboard
am: የአቅራቢ ዳሽቦርድ

source: Delivery Dashboard
am: የማድረስ ዳሽቦርድ

source: Cart
am: ጋሪ

source: Login
am: ግባ

source: Join Now
am: አሁን ይቀላቀሉ

source: Search...
am: ይፈልጉ...

source: Live Market • Addis Ababa
am: ቀጥታ ገበያ • አዲስ አበባ

source: The Heart of
am: የ

source: Ethiopia's Harvest
am: የኢትዮጵያ ምርት ልብ

source: Direct from the soil to your table. We connect you with local farmers for the freshest produce at fair, transparent prices.
am: በቀጥታ ከአፈር ወደ ገበታዎ። ትኩስ ምርቶችን በፍትሃዊ እና ግልጽ ዋጋ ለማግኘት ከአካባቢው ገበሬዎች ጋር እናገናኝዎታለን።

source: List Harvest
am: ምርት ይዘርዝሩ

source: Buy Inputs
am: ግብዓቶች ይግዙ

source: List Material
am: ቁሳቁስ ይዘርዝሩ

source: View Input Market
am: የግቤት ገበያ ይመልከቱ

source: View Routes
am: መንገዶችን ይመልከቱ

source: Active Orders
am: ንቁ ትዕዛዞች

source: Start Shopping
am: ገበያ ይጀምሩ

source: Join Group Buy
am: የቡድን ግዢ ይቀላቀሉ

source: Filtering by:
am: በሚከተለው ማጣራት:

source: Browse by Category
am: በምድብ ያስሱ

source: All
am: ሁሉም

source: Fresh Harvest
am: ትኩስ ምርት

source: Buy
am: ይግዙ

source: Group
am: ቡድን

source: Marketplace Empty
am: ገበያው ባዶ ነው

source: Check back soon!
am: በቅርቡ ተመልሰው ይመልከቱ!

source: Load More Harvests
am: ተጨማሪ ምርቶችን ይጫኑ

source: Farm to Table in 3 Steps
am: ከእርሻ ወደ ገበታ በ 3 ደረጃዎች

source: Simple, Transparent, and Fast.
am: ቀላል፣ ግልጽ እና ፈጣን።

source: Choose Fresh
am: ትኩስ ይምረጡ

source: Browse hundreds of daily listings directly from verified Ethiopian farmers.
am: በየቀኑ በመቶዎች የሚቆጠሩ ዝርዝሮችን ከተረጋገጡ የኢትዮጵያ ገበሬዎች በቀጥታ ያስሱ።

source: Group & Save
am: ቡድን ይፍጠሩ እና ይቆጥቡ

source: Buy individually or join a Group Buy to unlock wholesale prices with neighbors.
am: በግል ይግዙ ወይም ከጎረቤቶች ጋር የጅምላ ዋጋዎችን ለመክፈት የቡድን ግዢ ይቀላቀሉ።

source: Fast Delivery
am: ፈጣን ማድረስ

source: We collect from the farm and deliver to your doorstep within 24 hours.
am: ከእርሻው ተረክበን በ24 ሰዓታት ውስጥ ወደ ደጃፍዎ እናደርሳለን።

source: Join the Harvest
am: ምርቱን ይቀላቀሉ

source: Get weekly market price updates, seasonal alerts, and exclusive group-buying deals delivered to your inbox.
am: ሳምንታዊ የገበያ ዋጋ ዝመናዎችን፣ ወቅታዊ ማስጠንቀቂያዎችን እና ልዩ የቡድን ግዢ ቅናሾችን በኢሜልዎ ያግኙ።

source: your@email.com
am: የእርስዎ@email.com

source: Subscribe
am: ሰብስክራይብ ያድርጉ

source: Grand Market
am: ታላቁ ገበያ

source: Empowering Ethiopia's farmers through digital sovereignty.
am: የኢትዮጵያን ገበሬዎች በዲጂታል ሉዓላዊነት ማጎልበት።

source: Marketplace
am: ገበያ

source: All Products
am: ሁሉም ምርቶች

source: Fresh Vegetables
am: ትኩስ አትክልቶች

source: Support
am: ድጋፍ

source: Help Center
am: የእገዛ ማዕከል

source: Track Order
am: ትዕዛዝ ይከታተሉ

source: Legal
am: ህጋዊ

source: Privacy Policy
am: የግላዊነት ፖሊሲ

source: Terms of Service
am: የአገልግሎት ውሎች

source: All rights reserved.
am: ሁሉም መብቶች የተጠበቁ ናቸው።

source: Arbor - Input Supplies | Farm Materials
am: አርቦር - የግቤት አቅርቦቶች | የእርሻ ቁሳቁሶች

source: Loading Supplies...
am: አቅርቦቶች እየተጫኑ ነው...

source: Search fertilizers, seeds, tools...
am: ማዳበሪያዎችን፣ ዘሮችን፣ መሳሪያዎችን ይፈልጉ...

source: Search inputs...
am: ግብዓቶችን ይፈልጉ...

source: Certified Inputs
am: የተረጋገጡ ግብዓቶች

source: Fuel Your
am: የእርሻዎን

source: Farm's Growth
am: እድገት ያፋጥኑ

source: Premium seeds, fertilizers, and machinery from verified suppliers. Delivered directly to your cooperative.
am: ፕሪሚየም ዘሮች፣ ማዳበሪያዎች እና ማሽነሪዎች ከተረጋገጡ አቅራቢዎች። በቀጥታ ወደ ህብረት ሥራ ማህበርዎ ይደርሳሉ።

source: List New Material
am: አዲስ ቁሳቁስ ይዘርዝሩ

source: Available Supplies
am: ያሉ አቅርቦቶች

source: Supplier
am: አቅራቢ

source: General
am: አጠቃላይ

source: /unit
am: /ክፍል

source: left
am: ቀርቷል

source: Restocking
am: ዕቃ በመሙላት ላይ

source: No Supplies Found
am: ምንም አቅርቦቶች አልተገኙም።

source: Try searching for a different item.
am: የተለየ እቃ ለመፈለግ ይሞክሩ።

source: Empowering Ethiopia's farmers through digital sovereignty. Direct farm-to-table connections, fair prices, and community-driven commerce.
am: የኢትዮጵያን ገበሬዎች በዲጂታል ሉዓላዊነት ማጎልበት። ቀጥታ ከእርሻ ወደ ገበታ የሚወስዱ ግንኙነቶች፣ ፍትሃዊ ዋጋዎች እና በማህበረሰብ የሚመራ ንግድ።

source: Fruits & Berries
am: ፍራፍሬዎች እና ቤሪዎች

source: Bulk Grains
am: የጅምላ እህሎች

source: Become a Farmer
am: ገበሬ ይሁኑ

source: Made with 💚 for Ethiopia.
am: ለኢትዮጵያ በ💚 የተሰራ።

source: Join Group - Arbor
am: ቡድን ይቀላቀሉ - አርቦር

source: ETB / unit
am: ብር / ክፍል

source: units
am: ክፍሎች

source: collected so far
am: እስካሁን የተሰበሰበ

source: How much do you want?
am: ምን ያህል ይፈልጋሉ?

source: Commit to Buy
am: ለመግዛት ቃል ይግቡ

source: My Favorite Farmers - Arbor
am: የእኔ ተወዳጅ ገበሬዎች - አርቦር

source: Trusted Growers
am: ታማኝ አብቃዮች

source: Likes
am: መውደዶች

source: Your Trusted Growers
am: የእርስዎ ታማኝ አብቃዮች

source: Support the hands that feed you.
am: እርስዎን የሚመግቡ እጆችን ይደግፉ።

source: Currently Growing
am: አሁን እየበቀለ ነው

source: No crops listed currently.
am: በአሁኑ ጊዜ ምንም ሰብሎች አልተዘረዘሩም።

source: Unfollow
am: አትከተል

source: View Shop
am: ሱቅ ይመልከቱ

source: Empty Shop
am: ባዶ ሱቅ

source: No favorites yet
am: እስካሁን ምንም ተወዳጆች የሉም

source: Follow farmers to see their latest harvest here.
am: የቅርብ ጊዜ ምርታቸውን እዚህ ለማየት ገበሬዎችን ይከተሉ።

source: Browse the Market
am: ገበያውን ያስሱ

source: Login | Arbor
am: ግባ | አርቦር

source: Welcome Back
am: እንኳን ደህና መጡ

source: Enter your credentials to access your account.
am: መለያዎን ለመድረስ መረጃዎን ያስገቡ።

source: Phone Number
am: ስልክ ቁጥር

source: 4-Digit PIN
am: 4-አሃዝ ፒን

source: Sign In
am: ይግቡ

source: Don't have an account?
am: መለያ የለዎትም?

source: Create New Account
am: አዲስ መለያ ይፍጠሩ

source: Arbor Marketplace
am: አርቦር ገበያ

source: Manage My Groups
am: የእኔን ቡድኖች ያስተዳድሩ

source: Home
am: መነሻ

source: My Managed Groups
am: የእኔ የሚተዳደሩ ቡድኖች

source: Deliver to:
am: ለማድረስ:

source: Current Status
am: አሁን ያለው ሁኔታ

source: Member Name
am: የአባል ስም

source: Committed Qty
am: የተወሰነ ብዛት

source: Kick this member out?
am: ይህን አባል ያባርሩ?

source: Remove
am: ያስወግዱ

source: No members have joined yet.
am: እስካሁን ምንም አባላት አልተቀላቀሉም።

source: Total Quantity:
am: ጠቅላላ ብዛት:

source: This will finalize the group and send the order to delivery. Proceed?
am: ይህ ቡድኑን ያጠናቅቃል እና ትዕዛዙን ለማድረስ ይልካል። ይቀጥሉ?

source: Sent to Delivery
am: ለመላክ ተልኳል

source: You haven't created any groups yet.
am: እስካሁን ምንም ቡድኖች አልፈጠሩም።

source: My Orders | Arbor Market
am: የእኔ ትዕዛዞች | አርቦር ገበያ

source: My Orders
am: የእኔ ትዕዛዞች

source: Group Buy
am: የቡድን ግዢ

source: Order History
am: የትዕዛዝ ታሪክ

source: Track your farm-fresh deliveries in real-time.
am: የእርሻ-ትኩስ ማድረሻዎችዎን በእውነተኛ ጊዜ ይከታተሉ።

source: %(count)s Active Order
am: %(count)s ንቁ ትዕዛዝ

source: Pending
am: በሂደት ላይ

source: Assigned
am: ተመድቧል

source: On Way
am: በመንገድ ላይ

source: Delivered
am: ደርሷል

source: Total Cost
am: ጠቅላላ ወጪ

source: Placed On
am: የትዕዛዝ ቀን

source: Delivery To
am: የሚደርስበት ቦታ

source: Driver
am: ሹፌር

source: Secure Delivery PIN
am: የማድረሻ ሚስጥራዊ ኮድ (ፒን)

source: Give this code to %(name)s
am: ይህን ኮድ ለ%(name)s ይስጡ

source: Cancel this order?
am: ይህን ትዕዛዝ መሰረዝ ይፈልጋሉ?

source: No active orders
am: ንቁ ትዕዛዞች የሉም

source: Fresh produce is waiting. Start exploring the market to fill your basket.
am: ትኩስ ምርቶች እየጠበቁ ነው. ቅርጫትዎን ለመሙላት ገበያውን ማሰስ ይጀምሩ።

source: Trusted Payments
am: ታማኝ ክፍያዎች

source: Secured by Ethiopia's financial network.
am: በኢትዮጵያ ፋይናንስ አውታረ መረብ የተጠበቀ።

source: Manifest #%(id)s - Arbor
am: ማኒፌስት ቁጥር #%(id)s - አርቦር

source: Manifest #%(id)s
am: ማኒፌስት ቁጥር #%(id)s

source: Ordered On
am: በትዕዛዝ ቀን

source: Status
am: ሁኔታ

source: CASH HANDLING INSTRUCTIONS
am: የገንዘብ አያያዝ መመሪያዎች

source: Step 1: Collect from Buyer
am: ደረጃ 1፡ ከገዢው ይሰብስቡ

source: Total Order Value
am: ጠቅላላ የትዕዛዝ ዋጋ

source: Step 2: Pay to Seller
am: ደረጃ 2፡ ለሻጩ ይክፈሉ

source: Hand this cash to Farmer
am: ይህን ገንዘብ ለገበሬው ይስጡ

source: Step 3: Platform Fee
am: ደረጃ 3፡ የአገልግሎት ክፍያ

source: Keep for Arbor Office
am: ለአርቦር ቢሮ ያስቀምጡ

source: ⚠️ IMPORTANT: Do not give the full amount to the seller. Only give the 'Pay to Seller' amount.
am: ⚠️ አስፈላጊ፡ ሙሉውን ገንዘብ ለሻጩ አይስጡ። 'ለሻጩ ይክፈሉ' የሚለውን መጠን ብቻ ይስጡ።

source: Cargo Details
am: የእቃ ዝርዝሮች

source: Item:
am: እቃ:

source: Quantity:
am: ብዛት:

source: unit(s)
am: ክፍል(ሎች)

source: Value:
am: ዋጋ:

source: Payout Details
am: የክፍያ ዝርዝሮች

source: Total Paid:
am: ጠቅላላ የተከፈለ:

source: Platform Fee (5%%):
am: የአገልግሎት ክፍያ (5%%):

source: Your Earnings:
am: የእርስዎ ገቢ:

source: Payment & Notes
am: ክፍያ እና ማስታወሻዎች

source: Method:
am: ዘዴ:

source: Note:
am: ማስታወሻ:

source: Handle with care.
am: በጥንቃቄ ይያዙ።

source: Origin (Seller)
am: መነሻ (ሻጭ)

source: Transport
am: ትራንስፖርት

source: Enter Buyer PIN
am: የገዢውን ፒን ያስገቡ

source: Verify & Complete
am: ያረጋግጡ እና ያጠናቅቁ

source: Ask Buyer for 4-digit code
am: ገዢውን ለ 4-አሃዝ ኮድ ይጠይቁ

source: Job Complete
am: ሥራው ተጠናቀቀ

source: No Driver
am: ሹፌር የለም

source: Waiting for assignment...
am: ምደባ በመጠባበቅ ላይ...

source: Assign to Me
am: ለእኔ መድቡልኝ

source: Auto-fill my details
am: ዝርዝሮቼን በራስ-ሰር ይሙሉ

source: Destination (Buyer)
am: መድረሻ (ገዢ)

source: Post a Trip - Arbor CDN
am: ጉዞ ይለጥፉ - አርቦር ሲዲኤን

source: Post a Trip
am: ጉዞ ይለጥፉ

source: Tell us where you are going to get matched.
am: ተዛማጅነት ያለው ትዕዛዝ ለማግኘት ወዴት እንደሚሄዱ ይንገሩን።

source: Origin
am: መነሻ

source: Destination
am: መድረሻ

source: Available Capacity (KG)
am: ያለ አቅም (በኪሎ ግራም)

source: Departure Date/Time
am: የመነሻ ቀን/ሰዓት

source: Publish Trip
am: ጉዞ ይፋ ያድርጉ

source: Unit
am: ክፍል

source: Grown by
am: በዘራው/ባመረተው

source: Visit Farm
am: እርሻውን ይጎብኙ

source: You might also like
am: እነዚህንም ሊወዷቸው ይችላሉ

source: My Profile - Arbor
am: የእኔ መገለጫ - አርቦር

source: My Profile Settings
am: የእኔ መገለጫ ቅንብሮች

source: Profile Picture
am: የመገለጫ ምስል

source: No Location Set
am: ቦታ አልተቀመጠም

source: Banking Info:
am: የባንክ መረጃ:

source: ⚠️ No bank details added.
am: ⚠️ የባንክ ዝርዝሮች አልተጨመሩም።

source: Edit Details
am: ዝርዝሮችን ያርትዑ

source: Personal Information
am: የግል መረጃ

source: First Name
am: ስም

source: Last Name
am: የአባት ስም

source: Location / Address
am: አድራሻ

source: Change Photo
am: ፎቶ ቀይር

source: Banking Details
am: የባንክ ዝርዝሮች

source: Buyers will see this to transfer money to you via Mobile Banking.
am: ገዢዎች በሞባይል ባንኪንግ ገንዘብ ለማስተላለፍ ይህንን ያያሉ።

source: Bank Name
am: የባንክ ስም

source: Account Number
am: የሂሳብ ቁጥር

source: Save Changes 💾
am: ለውጦችን አስቀምጥ 💾

source: Join as Farmer | Arbor
am: እንደ ገበሬ ይመዝገቡ | አርቦር

source: Back to
am: ወደ

source: Roles
am: ሚናዎች

source: Farmer Registration
am: የገበሬ ምዝገባ

source: Join the network. Sell your harvest.
am: አውታረ መረቡን ይቀላቀሉ። ምርትዎን ይሽጡ።

source: Abebe
am: አበበ

source: Kebede
am: ከበደ

source: e.g. Bishoftu
am: ለምሳሌ: ቢሾፍቱ

source: PIN
am: ሚስጥራዊ ኮድ (ፒን)

source: Confirm
am: ያረጋግጡ

source: Register Farm
am: እርሻ ያስመዝግቡ

source: Already have an account?
am: መለያ አለዎት?

source: Login Here
am: እዚህ ይግቡ

source: Secure & Verified
am: ደህንነቱ የተጠበቀ እና የተረጋገጠ

source: Join as Buyer | Arbor
am: እንደ ገዢ ይመዝገቡ | አርቦር

source: Buyer Registration
am: የገዢ ምዝገባ

source: Access farm-fresh prices directly.
am: እርሻ-ትኩስ ዋጋዎችን በቀጥታ ያግኙ።

source: PIN (4 Digits)
am: ሚስጥራዊ ኮድ (ፒን) (4 አሃዝ)

source: Confirm PIN
am: ፒን ያረጋግጡ

source: Fair Prices • Farm Direct
am: ፍትሃዊ ዋጋዎች • ቀጥታ ከእርሻ

source: Join Logistics | Arbor
am: የሎጂስቲክስ አገልግሎት ይቀላቀሉ | አርቦር

source: Language
am: ቋንቋ

source: Delivery Partner
am: የማድረስ አጋር

source: Join the Crowd-Delivery Network.
am: የብዙሃን-ማድረስ አውታረ መረብን ይቀላቀሉ።

source: Personal Details
am: የግል መረጃ

source: Surname
am: የአያት ስም

source: Create PIN
am: ፒን ይፍጠሩ

source: Vehicle Information
am: የተሽከርካሪ መረጃ

source: Vehicle Model
am: የተሽከርካሪ ሞዴል

source: Type your vehicle (e.g. Isuzu FSR)
am: የተሽከርካሪዎን አይነት ይፃፉ (ለምሳሌ ኢሱዙ FSR)

source: Please type the specific name of your vehicle.
am: እባክዎን የተሽከርካሪዎን የተለየ ስም ይፃፉ።

source: Capacity (KG)
am: አቅም (በኪሎ ግራም)

source: Legal Verification
am: ህጋዊ ማረጋገጫ

source: Driving License Number
am: የመንጃ ፍቃድ ቁጥር

source: License #
am: ፍቃድ ቁጥር #

source: National ID
am: ብሔራዊ መታወቂያ

source: Clear photo of ID Front
am: የመታወቂያ ፊት ግልጽ ፎቶ

source: Driving License
am: የመንጃ ፍቃድ

source: Clear photo of License
am: የፍቃዱ ግልጽ ፎቶ

source: Submit Application
am: ማመልከቻ ያስገቡ

source: Join as Supplier | Arbor
am: እንደ አቅራቢ ይመዝገቡ | አርቦር

source: Supplier Partner
am: የአቅራቢ አጋር

source: Connect with thousands of farmers.
am: በሺዎች ከሚቆጠሩ ገበሬዎች ጋር ይገናኙ።

source: Business / Shop Name
am: የንግድ / የሱቅ ስም

source: Business Phone
am: የንግድ ስልክ

source: Join Network
am: አውታረ መረቡን ይቀላቀሉ

source: Verified Business Network
am: የተረጋገጠ የንግድ አውታረ መረብ

source: Select Your Role | Arbor
am: ሚናዎን ይምረጡ | አርቦር

source: Have an account?
am: መለያ አለዎት?

source: Join the
am: የ

source: Digital Harvest
am: ዲጂታል ምርት

source: Connect directly with Ethiopia's agricultural ecosystem. Choose your path to start growing.
am: ከኢትዮጵያ የግብርና ሥነ-ምህዳር ጋር በቀጥታ ይገናኙ። ማደግ ለመጀመር ጎዳናዎን ይምረጡ።

source: Farmer
am: ገበሬ

source: List your crops, manage your harvest, and sell directly to buyers with zero middlemen.
am: ሰብሎችዎን ይዘርዝሩ፣ ምርትዎን ያስተዳድሩ እና ያለ ምንም ደላላ በቀጥታ ለገዢዎች ይሽጡ።

source: Join as Farmer
am: እንደ ገበሬ ይመዝገቡ

source: Buyer
am: ገዢ

source: Access fresh produce at fair prices. Buy individually or start a Group Buy with neighbors.
am: ትኩስ ምርቶችን በፍትሃዊ ዋጋ ያግኙ። በግል ይግዙ ወይም ከጎረቤቶች ጋር በቡድን መግዛት ይጀምሩ።

source: Join as Buyer
am: እንደ ገዢ ይመዝገቡ

source: Sell fertilizers, seeds, and equipment directly to thousands of Ethiopian farmers.
am: ማዳበሪያዎችን፣ ዘሮችን እና መሳሪያዎችን በቀጥታ ለሺዎች ለሚቆጠሩ ኢትዮጵያውያን ገበሬዎች ይሽጡ።

source: Join as Supplier
am: እንደ አቅራቢ ይመዝገቡ

source: Logistics
am: ሎጂስቲክስ

source: Manage fleets, accept delivery jobs, and bridge the gap between farm and table.
am: ተሽከርካሪዎችን ያስተዳድሩ፣ የማድረስ ስራዎችን ይቀበሉ እና በእርሻ እና በጠረጴዛ መካከል ያለውን ክፍተት ያገናኙ።

source: Join Logistics
am: የሎጂስቲክስ አገልግሎት ይቀላቀሉ

source: Terms
am: ውሎች

source: Privacy
am: ግላዊነት

source: Help
am: እገዛ

source: Supplier Command - Arbor
am: የአቅራቢ መቆጣጠሪያ - አርቦር

source: Main Market
am: ዋና ገበያ

source: My Warehouse
am: የእኔ መጋዘን

source: Manage your stock and prices.
am: ዕቃዎችዎን እና ዋጋዎችዎን ያስተዳድሩ።

source: Add Product
am: ምርት ያክሉ

source: Price / Unit
am: ዋጋ / ክፍል

source: Current Stock
am: አሁን ያለ ዕቃ

source: Out of Stock
am: ዕቃ አልቆዋል

source: Your warehouse is empty
am: መጋዘንዎ ባዶ ነው

source: Start adding fertilizers or seeds to sell.
am: ለመሸጥ ማዳበሪያዎችን ወይም ዘሮችን ማከል ይጀምሩ።

source: Add First Item
am: የመጀመሪያ እቃ ያክሉ

source: Market Intelligence
am: የገበያ መረጃ

source: Live Farmer Prices
am: የገበሬዎች ወቅታዊ ዋጋ

source: No market data available yet.
am: እስካሁን ምንም የገበያ መረጃ የለም።

source: Telebirr Payment
am: ቴሌብር ክፍያ

source: Telebirr Logo
am: የቴሌብር አርማ

source: Confirm Telebirr Payment
am: የቴሌብር ክፍያ ያረጋግጡ

source: Amount Due for Order #%(id)s:
am: ለትዕዛዝ ቁጥር #%(id)s የሚከፈል መጠን:

source: Enter Telebirr PIN
am: የቴሌብር ፒን ያስገቡ

source: Pay Now & Verify
am: አሁን ይክፈሉ እና ያረጋግጡ

source: Cancel Transaction
am: ግብይት ይቅር
