Repository: firaolterefe447-cyber/-arbor-market
Catalog: locale/ti/LC_MESSAGES/django.po
Languages: ti

source: Market Trends
ti: ኩነታት ዕዳጋ

source: No market data available.
ti: ናይ ዕዳጋ መረዳእታ የለን።

source: Arbor Fleet
ti: Arbor ተሽከርከርቲ

source: Official Logistics
ti: ኦፊሴላዊ ሎጅስቲክስ

source: Driver ID:
ti: መፍለዪ መራሒ መኪና:

source: Daily Route
ti: ዕለታዊ መስመር

source: Assignments
ti: ምደባታት

source: Order #
ti: ቁጽሪ ትእዛዝ #

source: KG
ti: ኪሎ

source: Pickup From
ti: መበገሲ

source: Deliver To
ti: መብጽሒ

source: Confirm Pickup
ti: ምልዓል ኣረጋግጽ

source: Enter Buyer Code
ti: ናይ ዓዳጊ ኮድ የእትው

source: Verify
ti: ኣረጋግጽ

source: Completed
ti: ተወዲኡ

source: All Clear
ti: ኩሉ ጽሩይ

source: Your manifest is empty.
ti: ማኒፌስትካ ባዶ እዩ።

source: SCORE
ti: ንጥፈት (SCORE)

source: Your Manifest
ti: ናትካ ማኒፌስት

source: View Details
ti: ዝርዝር ረኣይ

source: No active manifest.
ti: ንጡፍ ማኒፌስት የለን።

source: Total
ti: ድምር

source: My Jobs
ti: ስራሓተይ

source: Post Trip
ti: ጉዕዞ ምዝግብ

source: Order Feed
ti: ትእዛዛት

source: Assigned to you
ti: ንዓኻ ዝተመደበ

source: Open
ti: ክፉት

source: Done
ti: ተወዲኡ

source: Taken
ti: ተወሲዱ

source: From
ti: ካብ

source: To
ti: ናብ

source: No orders found.
ti: ትእዛዛት ኣይተረኽበን።

source: Wait for new requests.
ti: ሓደስቲ ጠለባት ተጸበ።

source: Application Received - Arbor
ti: ማመልከቻ ተቀቢልና - Arbor

source: Application Pending
ti: ማመልከቻ ይረአ ኣሎ

source: We have received your application.
ti: ማመልከቻኻ ተቀቢልና ኣለና።

source: Please wait for Admin approval.
ti: በጃኻ ናይ ኣድሚን ፍቓድ ተጸበ።

source: Status:
ti: ኩነታት:

source: In Review...
ti: ኣብ ገምጋም...

source: An admin must verify your account before you can access the Delivery Dashboard.
ti: ኣድሚን ኣካውንትካ ቅድሚ ምርግጋጹ ናብ ዲሊቨሪ ዳሽቦርድ ክትኣቱ ኣይትኽእልን።

source: Check Status (Login)
ti: ኩነታት ኣረጋግጽ (Login)

source: Back to Home Page
ti: ናብ ዋና ገጽ ተመለስ

source: Edit Product
ti: ፍርያት ኣርትዕ

source: Crop Name
ti: ሽም ፍርያት

source: Stock (kg)
ti: ክምችት (ኪሎ)

source: Update Photo
ti: ስእሊ ቀይር

source: Save Changes
ti: ለውጢ አስቀምጥ

source: Edit Order #
ti: ትእዛዝ ኣርትዕ #

source: Edit Order
ti: ትእዛዝ ኣርትዕ

source: Current Total:
ti: ናይ ሕጂ ድምር:

source: New Quantity
ti: ሓዲሽ ብዝሒ

source: Update Order
ti: ትእዛዝ ኣሻይሽ

source: 's Farm - Arbor
ti: 's ሕርሻ - Arbor

source: Back to Market
ti: ናብ ዕዳጋ ተመለስ

source: Farm Profile
ti: ናይ ሕርሻ ፕሮፋይል

source: Active Listings
ti: ንጡፋት ምዝገባታት

source: Full Harvest List
ti: ምሉእ ዝርዝር ፍርያት

source: kg left
ti: ኪሎ ተሪፉ

source: In Stock
ti: ኣብ መኽዘን ዘሎ

source: This farmer has no other active listings.
ti: እዚ ሓረስታይ ካልእ ንጡፍ ምዝገባ የብሉን።

source: My Farm
ti: ናተይ ሕርሻ

source: Command Center
ti: ዳሽቦርድ

source: Community Hub
ti: ማሕበረሰብ ማእከል

source: Sell
ti: ሽጥ

source: Dashboard
ti: ዳሽቦርድ

source: Groups
ti: ጉጅለታት

source: Orders
ti: ትእዛዛት

source: Profile
ti: ፕሮፋይል

source: Sign Out
ti: ውጻእ

source: Group Buying Center
ti: ናይ ሓባር ሸመታ ማእከል

source: Join forces with neighbors. Buy together. Save together.
ti: ምስ ጎረባብቲ ተሓባበር። ብሓባር ግዛእ። ብሓባር ቆጥብ።

source: Groups You Manage
ti: እተመሓድሮም ጉጅለታት

source: Delivery:
ti: መባጽሒ:

source: Member List
ti: ዝርዝር ኣባላት

source: Name
ti: ሽም

source: Phone
ti: ስልኪ

source: Action
ti: ስጉምቲ

source: Kick this member?
ti: ነዚ ኣባል ከተውጽኦ ትደሊ?

source: Kick
ti: ኣውጽእ

source: Locked
ti: ተዓጽዩ

source: No members yet.
ti: ክሳብ ሕጂ ኣባላት የለዉን።

source: Total Order:
ti: ድምር ትእዛዝ:

source: Goal
ti: ሸቶ

source: Finalize order?
ti: ትእዛዝ ትወድእ ኣለኻ?

source: Place Final Order
ti: መወዳእታ ትእዛዝ ፈጽም

source: Waiting for members...
ti: ኣባላት ይጽበ ኣሎ...

source: Order Placed
ti: ትእዛዝ ተፈጺሙ

source: Available Groups to Join
ti: ንምጽንባር ዘለዉ ጉጅለታት

source: Input Co-op
ti: ናይ እታወታት ማሕበር

source: Urban Group
ti: ናይ ከተማ ጉጅለ

source: Leader:
ti: መራሒ:

source: Pickup Location
ti: መቀበሊ ቦታ

source: committed
ti: ኣታዊ ዝተኣተወ

source: Target:
ti: ሸቶ:

source: Group Price
ti: ናይ ጉጅለ ዋጋ

source: Join
ti: ተሓወስ

source: No active groups found.
ti: ንጡፋት ጉጅለታት ኣይተረኽቡን።

source: Be the first to start a community group!
ti: ናይ ማሕበረሰብ ጉጅለ ንምጅማር ቀዳማይ ኩን!

source: Official Payment Partners
ti: ወግዓዊ መሻርኽቲ ክፍሊት

source: Secure transactions via Ethiopia's trusted financial institutions.
ti: ብናይ ኢትዮጵያ ዝተኣማመኑ ፋይናንስ ትካላት ዝተሓለወ ክፍሊት።

source: Arbor - The Grand Market | Farm Direct
ti: Arbor - ዓቢ ዕዳጋ | ቀጥታ ካብ ሕርሻ

source: Ethiopia's premier farm-to-table marketplace. Buy fresh, sell direct, and grow together.
ti: ናይ ኢትዮጵያ ቀዳማይ ካብ ሕርሻ ናብ መኣዲ ዕዳጋ። ፍርሽ ግዛእ፣ ቀጥታ ሽጥ፣ ብሓባር ዓቢ።

source: Cultivating...
ti: የዳልው ኣሎ...

source: Type to pop up products...
ti: ፍርያት ንምድላይ ጽሓፍ...

source: Supplier Dashboard
ti: ናይ ኣቕራቢ ዳሽቦርድ

source: Delivery Dashboard
ti: ናይ ዲሊቨሪ ዳሽቦርድ

source: Cart
ti: ካርኒ

source: Login
ti: እተው (Login)

source: Join Now
ti: ሕጂ ተሓወስ

source: Search...
ti: ድለ...

source: Live Market • Addis Ababa
ti: ቀጥታ ዕዳጋ • ኣዲስ ኣበባ

source: The Heart of
ti: ልቢ ናይ

source: Ethiopia's Harvest
ti: ናይ ኢትዮጵያ ፍርያት

source: Direct from the soil to your table. We connect you with local farmers for the freshest produce at fair, transparent prices.
ti: ቀጥታ ካብ መሬት ናብ መኣድኻ። ንሕና ምስ ከባቢ ሓረስታይ ብፍትሓዊ ዋጋን ፍርሽ ፍርያትን ነራኽበኩም።

source: List Harvest
ti: ፍርያት ምዝግብ

source: Buy Inputs
ti: እታወታት ግዛእ

source: List Material
ti: ኣቕርቦት ምዝግብ

source: View Input Market
ti: ዕዳጋ እታወታት ረኣይ

source: View Routes
ti: መስመራት ረኣይ

source: Active Orders
ti: ንጡፋት ትእዛዛት

source: Start Shopping
ti: ምሽማት ጀምር

source: Join Group Buy
ti: ናብ ሓባር ሸመታ ተሓወስ

source: Select Your Language / ቋንቋ ይምረጡ
ti: ቋንቋ ይምረጡ / Select Your Language

source: Filtering by:
ti: ምጽራይ ብ:

source: Browse by Category
ti: ብዓይነት ድለ

source: All
ti: ኩሉ

source: Fresh Harvest
ti: ፍርሽ ፍርያት

source: Buy
ti: ግዛእ

source: Group
ti: ጉጅለ

source: Marketplace Empty
ti: ዕዳጋ ባዶ እዩ

source: Check back soon!
ti: ድሕሪ ቁሩብ ተመለስ!

source: Load More Harvests
ti: ተወሳኺ ፍርያት ኣርእይ

source: Farm to Table in 3 Steps
ti: ካብ ሕርሻ ናብ መኣዲ ብ 3 ደረጃታት

source: Simple, Transparent, and Fast.
ti: ቀሊል፣ ግልጽን ቅልጡፍን።

source: Choose Fresh
ti: ፍርሽ ምረጽ

source: Browse hundreds of daily listings directly from verified Ethiopian farmers.
ti: ኣብ መዓልቲ ኣማኢት ዝኾኑ ምዝገባታት ቀጥታ ካብ ዝተረጋገጹ ኢትዮጵያውያን ሓረስታይ ረኣይ።

source: Group & Save
ti: ተጋጀልን ቆጥብን

source: Buy individually or join a Group Buy to unlock wholesale prices with neighbors.
ti: ብውልቂ ግዛእ ወይ ምስ ጎረባብትኻ ብምዃን ብናይ ጅምላ ዋጋ ንምግዛእ ጉጅለ ፍጠር።

source: Fast Delivery
ti: ቅልጡፍ መባጽሒ

source: We collect from the farm and deliver to your doorstep within 24 hours.
ti: ካብ ሕርሻ ኣኪብና ኣብ ውሽጢ 24 ሰዓት ናብ ገዛኻ ነብጽሕ።

source: Join the Harvest
ti: ናብቲ ፍርያት ተሓወስ

source: Get weekly market price updates, seasonal alerts, and exclusive group-buying deals delivered to your inbox.
ti: ሰሙናዊ ዋጋ ዕዳጋ፣ ወቕታዊ ሓበሬታታት፣ ከምኡውን ፍሉይ ናይ ጉጅለ ሸመታ ዕድላት ረከብ።

source: Subscribe
ti: ተመዝገብ

source: Grand Market
ti: ዓቢ ዕዳጋ

source: Empowering Ethiopia's farmers through digital sovereignty.
ti: ንሓረስታይ ኢትዮጵያ ብዲጂታል ነጻነት ምሕያል።

source: Marketplace
ti: ዕዳጋ

source: All Products
ti: ኩሉ ፍርያት

source: Fresh Vegetables
ti: ፍርሽ ኣሕምልቲ

source: Support
ti: ደገፍ

source: Help Center
ti: ማእከል ሓገዝ

source: Track Order
ti: ትእዛዝ ተኸታተል

source: Legal
ti: ሕጋዊ

source: Privacy Policy
ti: ፖሊሲ ግላዊነት

source: Terms of Service
ti: ውል ሓለዋ

source: Arbor - Input Supplies | Farm Materials
ti: Arbor - እታወታት | ናይ ሕርሻ መሳርሒታት

source: Loading Supplies...
ti: ኣቕርቦት ይጽዕን ኣሎ...

source: Search fertilizers, seeds, tools...
ti: መዳበሪያ፣ ዘርኢ፣ መሳርሒታት ድለ...

source: Search inputs...
ti: እታወታት ድለ...

source: Certified Inputs
ti: ዝተረጋገጹ እታወታት

source: Fuel Your
ti: ን ... አሐይል

source: Farm's Growth
ti: ዕብየት ሕርሻ

source: Premium seeds, fertilizers, and machinery from verified suppliers. Delivered directly to your cooperative.
ti: ምርጥ ዘርኢ፣ መዳበሪያን ማሽነሪታትን ካብ ዝተረጋገጹ ኣቕረብቲ። ቀጥታ ናብ ማሕበርኩም ይበጽሕ።

source: List New Material
ti: ሓዲሽ ኣቕርቦት ምዝግብ

source: Available Supplies
ti: ዘለዉ ኣቕርቦታት

source: Supplier
ti: ኣቕራቢ

source: General
ti: ሓፈሻዊ

source: /unit
ti: /አሃዱ

source: left
ti: ተሪፉ

source: No Supplies Found
ti: ኣቕርቦት ኣይተረኽበን

source: Try searching for a different item.
ti: ካልእ ዓይነት ንምድላይ ፈትን።

source: Empowering Ethiopia's farmers through digital sovereignty. Direct farm-to-table connections, fair prices, and community-driven commerce.
ti: ንሓረስታይ ኢትዮጵያ ብዲጂታል ነጻነት ምሕያል። ቀጥታ ካብ ሕርሻ ናብ መኣዲ ዝምድና፣ ፍትሓዊ ዋጋን ብማሕበረሰብ ዝምራሕ ንግድን።

source: Fruits & Berries
ti: ፍረታትን ቤሪስን

source: Bulk Grains
ti: ጥራይ እኽሊ ብጅምላ

source: Become a Farmer
ti: ሓረስታይ ኩን

source: Join Group - Arbor
ti: ጉጅለ ተሓወስ - Arbor

source: ETB / unit
ti: ብር / አሃዱ

source: units
ti: አሃዱታት

source: collected so far
ti: ክሳብ ሕጂ ዝተኣከበ

source: How much do you want?
ti: ክንደይ ትደሊ?

source: Commit to Buy
ti: ንምግዛእ ቃል እቶ

source: My Favorite Farmers - Arbor
ti: ዝፈትዎም ሓረስታይ - Arbor

source: Trusted Growers
ti: ዝተኣማመኑ ኣፍረይቲ

source: Likes
ti: ዝፈተኽዎም

source: Your Trusted Growers
ti: ናትካ ዝተኣማመኑ ኣፍረይቲ

source: Support the hands that feed you.
ti: ንዝምግቡኻ ኣእዳው ደግፍ።

source: Currently Growing
ti: ሕጂ ዘፍርይዎ ዘለዉ

source: No crops listed currently.
ti: ሕጂ ዝተዘርዘረ ፍርያት የለን።

source: View Shop
ti: ድኳን ረኣይ

source: Empty Shop
ti: ባዶ ድኳን

source: No favorites yet
ti: ክሳብ ሕጂ ዝፈተኽዎ የለን

source: Follow farmers to see their latest harvest here.
ti: ናይ ሓረስታይ ሓዲሽ ፍርያት ንምርኣይ ተኸታተሎም።

source: Browse the Market
ti: ዕዳጋ ዳህስስ

source: Login | Arbor
ti: እተው | Arbor

source: Welcome Back
ti: እንቋዕ ብደሓን ተመለስኩም

source: Enter your credentials to access your account.
ti: ናብ ኣካውንትካ ንምእታው ሓበሬታ የእትው።

source: Phone Number
ti: ቁጽሪ ስልኪ

source: 4-Digit PIN
ti: 4-ኣሃዝ ፒን

source: Sign In
ti: እተው

source: Don't have an account?
ti: ኣካውንት የብልካን?

source: Create New Account
ti: ሓዲሽ ኣካውንት ፍጠር

source: Manage My Groups
ti: ጉጅለታተይ ኣመሓድር

source: Home
ti: ዋና ገጽ

source: My Managed Groups
ti: ዘመሓድሮም ጉጅለታት

source: Deliver to:
ti: መብጽሒ:

source: Current Status
ti: ሕጂ ዘለዎ ኩነታት

source: Member Name
ti: ሽም ኣባል

source: Committed Qty
ti: ዝተኣተወ ብዝሒ

source: Kick this member out?
ti: ነዚ ኣባል ከተውጽኦ ትደሊ?

source: Remove
ti: ኣውጽእ

source: No members have joined yet.
ti: ክሳብ ሕጂ ዝተሓወሰ ኣባል የለን።

source: Total Quantity:
ti: ድምር ብዝሒ:

source: This will finalize the group and send the order to delivery. Proceed?
ti: እዚ ንጉጅለ ዛዚሙ ትእዛዝ ናብ ዲሊቨሪ ክሰድድ እዩ። ክቐጽል?

source: Sent to Delivery
ti: ናብ ዲሊቨሪ ተላኢኹ

source: You haven't created any groups yet.
ti: ክሳብ ሕጂ ዝፈጠርካዮ ጉጅለ የለን።

source: My Orders | Arbor Market
ti: ትእዛዛተይ | Arbor Market

source: My Orders
ti: ትእዛዛተይ

source: Group Buy
ti: ናይ ሓባር ሸመታ

source: Order History
ti: ታሪኽ ትእዛዝ

source: Track your farm-fresh deliveries in real-time.
ti: ናይ ሕርሻ ፍርያትካ ዲሊቨሪ ብቐጥታ ተኸታተል።

source: %(count)s Active Order
ti: %(count)s ንጡፍ ትእዛዝ

source: Assigned
ti: ተመዲቡ

source: On Way
ti: ኣብ መገዲ

source: Delivered
ti: በጺሑ

source: Total Cost
ti: ድምር ወጪ

source: Placed On
ti: ዝተኣዘዘሉ ዕለት

source: Delivery To
ti: መብጽሒ

source: Driver
ti: መራሒ መኪና

source: Secure Delivery PIN
ti: ናይ ዲሊቨሪ ፒን

source: Give this code to %(name)s
ti: እዚ ኮድ ን %(name)s ሃቦ

source: Cancel this order?
ti: እዚ ትእዛዝ ይሰረዝ?

source: No active orders
ti: ንጡፍ ትእዛዝ የለን

source: Fresh produce is waiting. Start exploring the market to fill your basket.
ti: ፍርሽ ፍርያት ይጽበ ኣሎ። ቅርጫትካ ንምምላእ ዕዳጋ ዳህስስ።

source: Trusted Payments
ti: ዝተኣማመን ክፍሊት

source: Secured by Ethiopia's financial network.
ti: ብናይ ኢትዮጵያ ፋይናንስ ነትወርክ ዝተሓለወ።

source: Ordered On
ti: ዝተኣዘዘሉ

source: Status
ti: ኩነታት

source: CASH HANDLING INSTRUCTIONS
ti: መምርሒ ኣተሓሕዛ ገንዘብ

source: Step 1: Collect from Buyer
ti: ደረጃ 1: ካብ ዓዳጊ ተቀበል

source: Total Order Value
ti: ድምር ዋጋ ትእዛዝ

source: Step 2: Pay to Seller
ti: ደረጃ 2: ንሸጣይ ክፈሊ

source: Hand this cash to Farmer
ti: እዚ ገንዘብ ንሓረስታይ ሃብ

source: Step 3: Platform Fee
ti: ደረጃ 3: ናይ ፕላትፎርም ክፍሊት

source: Keep for Arbor Office
ti: ን Arbor Office ዝተርፍ

source: ⚠️ IMPORTANT: Do not give the full amount to the seller. Only give the 'Pay to Seller' amount.
ti: ⚠️ ኣገዳሲ: እቲ ምሉእ ገንዘብ ንሸጣይ ኣይትሃብ። እቲ 'ንሸጣይ ዝኽፈል' ዝብል ጥራይ ሃብ።

source: Cargo Details
ti: ዝርዝር ጽዕነት

source: Item:
ti: ዓይነት:

source: Quantity:
ti: ብዝሒ:

source: unit(s)
ti: አሃዱ(ታት)

source: Value:
ti: ዋጋ:

source: Payout Details
ti: ዝርዝር ክፍሊት

source: Total Paid:
ti: ድምር ዝተኽፈለ:

source: Platform Fee (5%%):
ti: ናይ ፕላትፎርም ክፍሊት (5%%):

source: Your Earnings:
ti: ናትካ ኣታዊ:

source: Payment & Notes
ti: ክፍሊትን መዘከርታን

source: Method:
ti: አገባብ:

source: Note:
ti: መዘከርታ:

source: Handle with care.
ti: ብጥንቃቐ ሓዝ።

source: Origin (Seller)
ti: መበገሲ (ሸጣይ)

source: Transport
ti: መጓዓዝያ

source: Enter Buyer PIN
ti: ናይ ዓዳጊ ፒን የእትው

source: Verify & Complete
ti: ኣረጋግጽን ወድእን

source: Ask Buyer for 4-digit code
ti: ንዓዳጊ 4-አሃዝ ኮድ ሕተቶ

source: Job Complete
ti: ስራሕ ተወዲኡ

source: No Driver
ti: መራሒ መኪና የለን

source: Waiting for assignment...
ti: ምደባ ይጽበ ኣሎ...

source: Assign to Me
ti: ንዓይ መድብ

source: Auto-fill my details
ti: ዝርዝረይ ብባዕሉ ይምላእ

source: Destination (Buyer)
ti: መብጽሒ (ዓዳጊ)

source: Post a Trip
ti: ጉዕዞ ምዝግብ

source: Tell us where you are going to get matched.
ti: ኣበይ ከም እትኸይድ ንገረና እሞ ንራኽበካ።

source: Origin
ti: መበገሲ

source: Destination
ti: መብጽሒ

source: Available Capacity (KG)
ti: ዘሎ ቦታ (ኪሎ)

source: Departure Date/Time
ti: መገሻ ዕለት/ሰዓት

source: Publish Trip
ti: ጉዕዞ ኣውጽእ

source: Unit
ti: አሃዱ

source: Grown by
ti: ዘፍረዮ

source: Visit Farm
ti: ሕርሻ ዑደት ግበር

source: You might also like
ti: እዚውን ክትፈትዎ ትኽእል

source: My Profile Settings
ti: ናይ ፕሮፋይል ቅጥዕታት

source: Profile Picture
ti: ስእሊ ፕሮፋይል

source: No Location Set
ti: ቦታ ኣይተመዝገበን

source: Banking Info:
ti: ናይ ባንኪ ሓበሬታ:

source: ⚠️ No bank details added.
ti: ⚠️ ናይ ባንኪ ሓበሬታ ኣይተወሰኸን።

source: Edit Details
ti: ዝርዝር ኣርትዕ

source: Personal Information
ti: ግላዊ ሓበሬታ

source: First Name
ti: ሽም

source: Last Name
ti: ሽም ኣቦ

source: Location / Address
ti: ቦታ / ኣድራሻ

source: Change Photo
ti: ስእሊ ቀይር

source: Banking Details
ti: ናይ ባንኪ ዝርዝር

source: Buyers will see this to transfer money to you via Mobile Banking.
ti: ዓደግቲ ብሞባይል ባንኪንግ ገንዘብ ንምስዳድ እዚ ክርእዩ እዮም።

source: Bank Name
ti: ሽም ባንኪ

source: Account Number
ti: ቁጽሪ ሕሳብ

source: Save Changes 💾
ti: ለውጢ አስቀምጥ 💾

source: Join as Farmer | Arbor
ti: ከም ሓረስታይ ተሓወስ | Arbor

source: Back to
ti: ተመለስ ናብ

source: Roles
ti: ተራ

source: Farmer Registration
ti: ምዝገባ ሓረስታይ

source: Join the network. Sell your harvest.
ti: ናብቲ መርበብ ተሓወስ። ፍርያትካ ሽጥ።

source: Abebe
ti: ኣበበ

source: Kebede
ti: ከበደ

source: e.g. Bishoftu
ti: ንኣብነት ቢሾፍቱ

source: PIN
ti: ፒን

source: Confirm
ti: ኣረጋግጽ

source: Register Farm
ti: ሕርሻ መዝግብ

source: Already have an account?
ti: ኣካውንት ኣለካ?

source: Login Here
ti: ኣብዚ እተ

source: Secure & Verified
ti: ዝተሓለወን ዝተረጋገጸን

source: Join as Buyer | Arbor
ti: ከም ዓዳጊ ተሓወስ | Arbor

source: Buyer Registration
ti: ምዝገባ ዓዳጊ

source: Access farm-fresh prices directly.
ti: ናይ ሕርሻ ፍርሽ ዋጋታት ቀጥታ ርኸብ።

source: PIN (4 Digits)
ti: ፒን (4 ኣሃዝ)

source: Confirm PIN
ti: ፒን ኣረጋግጽ

source: Fair Prices • Farm Direct
ti: ፍትሓዊ ዋጋ • ቀጥታ ካብ ሕርሻ

source: Join Logistics | Arbor
ti: ሎጅስቲክስ ተሓወስ | Arbor

source: Language
ti: ቋንቋ

source: Delivery Partner
ti: ናይ ዲሊቨሪ መሻርኽቲ

source: Join the Crowd-Delivery Network.
ti: ናብ Crowd-Delivery Network ተሓወስ።

source: Personal Details
ti: ግላዊ ዝርዝር

source: Surname
ti: ሽም ኣቦሓጎ

source: Create PIN
ti: ፒን ፍጠር

source: Vehicle Information
ti: ሓበሬታ ተሽከርካሪት

source: Vehicle Model
ti: ሞዴል ተሽከርካሪት

source: Type your vehicle (e.g. Isuzu FSR)
ti: ዓይነት ተሽከርካሪት ጽሓፍ (ንኣብነት Isuzu FSR)

source: Please type the specific name of your vehicle.
ti: በጃኻ ፍሉይ ሽም ተሽከርካሪትካ ጽሓፍ።

source: Capacity (KG)
ti: ዓቅሚ (ኪሎ)

source: Legal Verification
ti: ሕጋዊ ምርግጋጽ

source: Driving License Number
ti: ቁጽሪ መንጃ ፍቓድ

source: License #
ti: መንጃ ፍቓድ #

source: National ID
ti: ብሄራዊ መታወቐያ

source: Clear photo of ID Front
ti: ንጹር ስእሊ ናይ መታወቐያ (ቅድሚት)

source: Driving License
ti: መንጃ ፍቓድ

source: Clear photo of License
ti: ንጹር ስእሊ ናይ መንጃ ፍቓድ

source: Submit Application
ti: ማመልከቻ ኣእትው

source: Join as Supplier | Arbor
ti: ከም ኣቕራቢ ተሓወስ | Arbor

source: Supplier Partner
ti: ኣቕራቢ መሻርኽቲ

source: Connect with thousands of farmers.
ti: ምስ ኣሽሓት ሓረስታይ ተራኸብ።

source: Business / Shop Name
ti: ሽም ንግዲ / ድኳን

source: Business Phone
ti: ናይ ስራሕ ስልኪ

source: Join Network
ti: ናብ መርበብ ተሓወስ

source: Verified Business Network
ti: ዝተረጋገጸ ናይ ንግዲ መርበብ

source: Select Your Role | Arbor
ti: ተራኻ ምረጽ | Arbor

source: Have an account?
ti: ኣካውንት ኣለካ?

source: Join the
ti: ናብ ... ተሓወስ

source: Digital Harvest
ti: ዲጂታል ፍርያት

source: Connect directly with Ethiopia's agricultural ecosystem. Choose your path to start growing.
ti: ቀጥታ ምስ ናይ ኢትዮጵያ ሕርሻ ኢኮሲስተም ተራኸብ። ንምዕባይ መገድኻ ምረጽ።

source: Farmer
ti: ሓረስታይ

source: List your crops, manage your harvest, and sell directly to buyers with zero middlemen.
ti: ፍርያትካ መዝግብ፣ ኣመሓድር፣ ከምኡውን ቀጥታ ንዓደግቲ ብዘይ ደላሎ ሽጥ።

source: Join as Farmer
ti: ከም ሓረስታይ ተሓወስ

source: Buyer
ti: ዓዳጊ

source: Access fresh produce at fair prices. Buy individually or start a Group Buy with neighbors.
ti: ፍርሽ ፍርያት ብፍትሓዊ ዋጋ ርኸብ። ብውልቂ ግዛእ ወይ ምስ ጎረባብቲ ጉጅለ ሸመታ ጀምር።

source: Join as Buyer
ti: ከም ዓዳጊ ተሓወስ

source: Sell fertilizers, seeds, and equipment directly to thousands of Ethiopian farmers.
ti: መዳበሪያ፣ ዘርኢ፣ ከምኡውን መሳርሒታት ቀጥታ ንኣሽሓት ኢትዮጵያውያን ሓረስታይ ሽጥ።

source: Join as Supplier
ti: ከም ኣቕራቢ ተሓወስ

source: Logistics
ti: ሎጅስቲክስ

source: Manage fleets, accept delivery jobs, and bridge the gap between farm and table.
ti: ተሽከርከርቲ ኣመሓድር፣ ስራሕ ዲሊቨሪ ተቀበል፣ ኣብ መንጎ ሕርሻን መኣድን ዘሎ ክፍተት ድፈን።

source: Join Logistics
ti: ሎጅስቲክስ ተሓወስ

source: Terms
ti: ውዕላት

source: Privacy
ti: ግላዊነት

source: Help
ti: ሓገዝ

source: Main Market
ti: ዋና ዕዳጋ

source: My Warehouse
ti: ናተይ መኽዘን

source: Manage your stock and prices.
ti: ስቶክን ዋጋታትን ኣመሓድር።

source: Add Product
ti: ፍርያት ወስኽ

source: Price / Unit
ti: ዋጋ / አሃዱ

source: Current Stock
ti: ዘሎ ስቶክ

source: Out of Stock
ti: ካብ ስቶክ ተወዲኡ

source: Your warehouse is empty
ti: መኽዘንካ ባዶ እዩ

source: Start adding fertilizers or seeds to sell.
ti: መዳበሪያ ወይ ዘርኢ ንምሻጥ ምውሳኽ ጀምር።

source: Add First Item
ti: ናይ መጀመርታ ኣቕሓ ወስኽ

source: Market Intelligence
ti: ናይ ዕዳጋ ሓበሬታ

source: Live Farmer Prices
ti: ቀጥታ ዋጋ ሓረስታይ

source: No market data available yet.
ti: ክሳብ ሕጂ ናይ ዕዳጋ መረዳእታ የለን።

source: Telebirr Payment
ti: ቴሌብር ክፍሊት

source: Confirm Telebirr Payment
ti: ቴሌብር ክፍሊት ኣረጋግጽ

source: Amount Due for Order #%(id)s:
ti: ዝኽፈል መጠን ንትእዛዝ #%(id)s:

source: Enter Telebirr PIN
ti: ቴሌብር ፒን የእትው

source: Pay Now & Verify
ti: ሕጂ ክፈሊን ኣረጋግጽን

source: Cancel Transaction
ti: ክፍሊት ሰርዝ
