Repository: firaolterefe447-cyber/-arbor-market
Catalog: locale/ti/LC_MESSAGES/django.po
Languages: ti

source: English
ti: እንግሊዝኛ

source: Amharic
ti: አምሓርኛ

source: Afaan Oromoo
ti: ኦሮምኛ

source: Somali
ti: ሶማሊኛ

source: Tigrinya
ti: ትግርኛ

source: {editor}: Editing failed
ti: {editor}: ምዕራይ ኣይተኻእለን

source: {editor}: Editing failed: {e}
ti: {editor}: ምዕራይ ኣይተኻእለን: {e}

source: Options
ti: ኣማራጺታት

source: Got unexpected extra argument ({args})
ti: ዘይተደልየ ተወሳኺ መረዳእታ ተረኺቡ ({args})

source: DeprecationWarning: The command {name!r} is deprecated.{extra_message}
ti: DeprecationWarning: እዚ ትእዛዝ {name!r} ግዜኡ ዝሓለፎ እዩ። {extra_message}

source: Aborted!
ti: ተቋሪጹ!

source: Commands
ti: ትእዛዛት

source: Missing command.
ti: ትእዛዝ ጎዲሉ ኣሎ።

source: No such command {name!r}.
ti: ከምዚ ዓይነት ትእዛዝ የለን {name!r}።

source: Value must be an iterable.
ti: እቲ ዋጋ ክቑጸር ዝኽእል ክኸውን ኣለዎ።

source: Takes {nargs} values but 1 was given.
ti: {nargs} ዋጋታት ይወስድ ግን 1 ተዋሂቡ።

source: DeprecationWarning: The {param_type} {name!r} is deprecated.{extra_message}
ti: DeprecationWarning: እዚ {param_type} {name!r} ግዜኡ ዝሓለፎ እዩ።{extra_message}

source: default: {default}
ti: ነባሪ: {default}

source: (dynamic)
ti: (ተለዋዋጢ)

source: %(prog)s, version %(version)s
ti: %(prog)s, ሕታም %(version)s

source: Show the version and exit.
ti: ሕታም (Version) ኣርእይ እሞ ውጻእ።

source: Show this message and exit.
ti: እዚ መልእኽቲ ኣርእይ እሞ ውጻእ።

source: Error: {message}
ti: ጌጋ: {message}

source: Try '{command} {option}' for help.
ti: ንሓገዝ '{command} {option}' ተጠቐም።

source: Invalid value: {message}
ti: ዘይቅቡል ዋጋ: {message}

source: Invalid value for {param_hint}: {message}
ti: ዘይቅቡል ዋጋ ን {param_hint}: {message}

source: Missing argument
ti: ዝጎደለ መረዳእታ (Argument)

source: Missing option
ti: ዝጎደለ ምርጫ

source: Missing parameter
ti: ዝጎደለ ፓራሜተር

source: Missing {param_type}
ti: ዝጎደለ {param_type}

source: Missing parameter: {param_name}
ti: ዝጎደለ ፓራሜተር: {param_name}

source: No such option: {name}
ti: ከምዚ ዓይነት ምርጫ የለን: {name}

source: Did you mean {possibility}?
ti: ማለትካ ድዩ {possibility}?

source: unknown error
ti: ዘይተፈልጠ ጌጋ

source: Could not open file {filename!r}: {message}
ti: ፋይል ክኽፈት ኣይተኻእለን {filename!r}: {message}

source: Usage:
ti: አጠቓቕማ:

source: Argument {name!r} takes {nargs} values.
ti: Argument {name!r} {nargs} ዋጋታት ይወስድ።

source: Option {name!r} does not take a value.
ti: ምርጫ {name!r} ዋጋ ኣይወስድን እዩ።

source: Option {name!r} requires an argument.
ti: ምርጫ {name!r} መረዳእታ (argument) የድልዮ።

source: Shell completion is not supported for Bash versions older than 4.4.
ti: Shell completion ን Bash versions ካብ 4.4 ንታሕቲ ኣይሰርሕን እዩ።

source: Couldn't detect Bash version, shell completion is not supported.
ti: ናይ Bash version ክልለ ኣይተኻእለን፣ shell completion ኣይሰርሕን እዩ።

source: Repeat for confirmation
ti: ንምርግጋጽ ደጊምካ ጸሓፍ

source: Error: The value you entered was invalid.
ti: ጌጋ: ዘእተኻዮ ዋጋ ዘይቅቡል እዩ።

source: Error: {e.message}
ti: ጌጋ: {e.message}

source: Error: The two entered values do not match.
ti: ጌጋ: እቶም ዘእተኻዮም ክልተ ዋጋታት ኣይሰማምዑን።

source: Error: invalid input
ti: ጌጋ: ዘይቅቡል እታወ

source: Press any key to continue...
ti: ንምቕጻል ዝኾነ ቁልፊ ጠውቕ...

source: Choose from: {choices}
ti: ካብዚኦም ምረጽ: {choices}

source: {value!r} is not {choice}.
ti: {value!r} {choice} ኣይኮነን።

source: {value!r} does not match the format {format}.
ti: {value!r} ምስ {format} ኣይሰማማዕን።

source: {value!r} is not a valid {number_type}.
ti: {value!r} ቅቡል {number_type} ኣይኮነን።

source: {value} is not in the range {range}.
ti: {value} ኣብ ክልል {range} ውሽጢ የለን።

source: {value!r} is not a valid boolean. Recognized values: {states}
ti: {value!r} ቅቡል boolean ኣይኮነን። ዝፍለጡ ዋጋታት: {states}

source: {value!r} is not a valid UUID.
ti: {value!r} ቅቡል UUID ኣይኮነን።

source: file
ti: ፋይል

source: directory
ti: ማህደር

source: path
ti: መገዲ (path)

source: {name} {filename!r} does not exist.
ti: {name} {filename!r} የለን።

source: {name} {filename!r} is a file.
ti: {name} {filename!r} ፋይል እዩ።

source: {name} {filename!r} is a directory.
ti: {name} {filename!r} ማህደር እዩ።

source: {name} {filename!r} is not readable.
ti: {name} {filename!r} ክንበብ ኣይከኣልን።

source: {name} {filename!r} is not writable.
ti: {name} {filename!r} ክጽሓፎ ኣይከኣልን።

source: {name} {filename!r} is not executable.
ti: {name} {filename!r} executable ኣይኮነን።

source: {len_type} values are required, but {len_value} was given.
ti: {len_type} ዋጋታት የድልዩ፣ ግን {len_value} ተዋሂቡ።

source: Messages
ti: መልእኽትታት

source: Site Maps
ti: ካርታ መርበብ

source: Static Files
ti: Static ፋይላት

source: That page number is not an integer
ti: እቲ ቁጽሪ ገጽ ኢንቲጀር (integer) ኣይኮነን

source: That page number is less than 1
ti: እቲ ቁጽሪ ገጽ ካብ 1 ይንእስ

source: That page contains no results
ti: እቲ ገጽ ዋላ ሓደ ውጽኢት የብሉን

source: Enter a valid value.
ti: ቅቡል ዋጋ የእትው።

source: Enter a valid domain name.
ti: ቅቡል ናይ ዶሜይን ሽም የእትው።

source: Enter a valid URL.
ti: ቅቡል URL የእትው።

source: Enter a valid integer.
ti: ቅቡል ኢንቲጀር የእትው።

source: Enter a valid email address.
ti: ቅቡል ኢሜይል ኣድራሻ የእትው።

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
ti: ፊደላት፣ ቁጽርታት፣ underscores ወይ hyphens ዝሓዘ ቅቡል “slug” የእትው።

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
ti: ናይ ዩኒኮድ ፊደላት፣ ቁጽርታት፣ underscores ወይ hyphens ዝሓዘ ቅቡል “slug” የእትው።

source: Enter a valid %(protocol)s address.
ti: ቅቡል %(protocol)s ኣድራሻ የእትው።

source: IPv4 or IPv6
ti: IPv4 ወይ IPv6

source: Enter only digits separated by commas.
ti: ብ ኮማ ዝተፈልዩ ቁጽርታት ጥራይ የእትው።

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
ti: እዚ ዋጋ %(limit_value)s ምዃኑ ኣረጋግጽ (ሕጂ ዘሎ %(show_value)s እዩ)።

source: Ensure this value is less than or equal to %(limit_value)s.
ti: እዚ ዋጋ ካብ %(limit_value)s ዝንእስ ወይ ማዕረ ምዃኑ ኣረጋግጽ።

source: Ensure this value is greater than or equal to %(limit_value)s.
ti: እዚ ዋጋ ካብ %(limit_value)s ዝዓቢ ወይ ማዕረ ምዃኑ ኣረጋግጽ።

source: Ensure this value is a multiple of step size %(limit_value)s.
ti: እዚ ዋጋ ናይ %(limit_value)s ርባሕ ምዃኑ ኣረጋግጽ።

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
ti: እዚ ዋጋ ናይ %(limit_value)s ርባሕ ምዃኑን፣ ካብ %(offset)s ዝጅምር ምዃኑን ኣረጋግጽ።

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
ti: እዚ ዋጋ እንተወሓደ %(limit_value)d ፊደል ክህልዎ ኣለዎ (ዘለዎ %(show_value)d)።

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
ti: እዚ ዋጋ ካብ %(limit_value)d ዘይበዝሕ ፊደል ክህልዎ ኣለዎ (ዘለዎ %(show_value)d)።

source: Enter a number.
ti: ቁጽሪ የእትው።

source: Ensure that there are no more than %(max)s digit in total.
ti: ብድምር ካብ %(max)s ዘይበዝሕ ኣሃዝ ክህሉ ኣረጋግጽ።

source: Ensure that there are no more than %(max)s decimal place.
ti: ካብ %(max)s ዘይበዝሕ ድሕሪ ነጥቢ ዘሎ ኣሃዝ ክህሉ ኣረጋግጽ።

source: Ensure that there are no more than %(max)s digit before the decimal point.
ti: ቅድሚ ነጥቢ ካብ %(max)s ዘይበዝሕ ኣሃዝ ክህሉ ኣረጋግጽ።

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
ti: ዓይነት ፋይል “%(extension)s” ኣይፍቀድን እዩ። ዝፍቀዱ ዓይነታት: %(allowed_extensions)s.

source: Null characters are not allowed.
ti: Null characters ኣይፍቀዱን እዮም።

source: and
ti: ከምኡውን

source: %(model_name)s with this %(field_labels)s already exists.
ti: %(model_name)s በዚ %(field_labels)s ድሮ ኣሎ።

source: Constraint “%(name)s” is violated.
ti: Constraint “%(name)s” ተጣሒሱ።

source: Value %(value)r is not a valid choice.
ti: ዋጋ %(value)r ቅቡል ምርጫ ኣይኮነን።

source: This field cannot be null.
ti: እዚ ቦታ ባዶ (null) ክኸውን ኣይክእልን።

source: This field cannot be blank.
ti: እዚ ቦታ ባዶ ክኸውን ኣይክእልን።

source: %(model_name)s with this %(field_label)s already exists.
ti: %(model_name)s በዚ %(field_label)s ድሮ ኣሎ።

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
ti: %(field_label)s ን %(date_field_label)s %(lookup_type)s ፍሉይ ክኸውን ኣለዎ።

source: Field of type: %(field_type)s
ti: ዓይነት ፊልድ: %(field_type)s

source: “%(value)s” value must be either True or False.
ti: “%(value)s” ዋጋ True ወይ False ክኸውን ኣለዎ።

source: “%(value)s” value must be either True, False, or None.
ti: “%(value)s” ዋጋ True፣ False፣ ወይ None ክኸውን ኣለዎ።

source: Boolean (Either True or False)
ti: Boolean (True ወይ False)

source: String (up to %(max_length)s)
ti: ጽሑፍ (ክሳብ %(max_length)s)

source: String (unlimited)
ti: ጽሑፍ (ዘይተወሰነ)

source: Comma-separated integers
ti: ብ ኮማ ዝተፈልዩ ኢንቲጀራት

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
ti: “%(value)s” ዘይቅቡል ናይ ዕለት ኣጸሓሕፋ ኣለዎ። ብ YYYY-MM-DD ክኸውን ኣለዎ።

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
ti: “%(value)s” ቅቡል ኣጸሓሕፋ (YYYY-MM-DD) ኣለዎ ግን ዘይቅቡል ዕለት እዩ።

source: Date (without time)
ti: ዕለት (ሰዓት ዘይብሉ)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
ti: “%(value)s” ዘይቅቡል ኣጸሓሕፋ ኣለዎ። ብ YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] ክኸውን ኣለዎ።

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
ti: “%(value)s” ቅቡል ኣጸሓሕፋ ኣለዎ ግን ዘይቅቡል ዕለት/ሰዓት እዩ።

source: Date (with time)
ti: ዕለት (ምስ ሰዓት)

source: “%(value)s” value must be a decimal number.
ti: “%(value)s” ዋጋ ዴሲማል ክኸውን ኣለዎ።

source: Decimal number
ti: ዴሲማል ቁጽሪ

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
ti: “%(value)s” ዋጋ ዘይቅቡል ኣጸሓሕፋ ኣለዎ።

source: Email address
ti: ኢሜይል ኣድራሻ

source: File path
ti: መገዲ ፋይል

source: “%(value)s” value must be a float.
ti: “%(value)s” ዋጋ float ክኸውን ኣለዎ።

source: Floating point number
ti: Floating point ቁጽሪ

source: “%(value)s” value must be an integer.
ti: “%(value)s” ዋጋ ኢንቲጀር ክኸውን ኣለዎ።

source: Integer
ti: ኢንቲጀር (Integer)

source: Big (8 byte) integer
ti: ዓቢ ኢንቲጀር

source: Small integer
ti: ንኣሽቱ ኢንቲጀር

source: IPv4 address
ti: IPv4 ኣድራሻ

source: IP address
ti: IP ኣድራሻ

source: “%(value)s” value must be either None, True or False.
ti: “%(value)s” ዋጋ None, True ወይ False ክኸውን ኣለዎ።

source: Boolean (Either True, False or None)
ti: Boolean (True, False ወይ None)

source: Positive big integer
ti: ፖዚቲቭ ዓቢ ኢንቲጀር

source: Positive integer
ti: ፖዚቲቭ ኢንቲጀር

source: Positive small integer
ti: ፖዚቲቭ ንኡስ ኢንቲጀር

source: Slug (up to %(max_length)s)
ti: Slug (ክሳብ %(max_length)s)

source: Text
ti: ጽሑፍ

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
ti: “%(value)s” ዘይቅቡል ኣጸሓሕፋ ኣለዎ። ብ HH:MM[:ss[.uuuuuu]] ክኸውን ኣለዎ።

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
ti: “%(value)s” ቅቡል ኣጸሓሕፋ (HH:MM[:ss[.uuuuuu]]) ኣለዎ ግን ዘይቅቡል ሰዓት እዩ።

source: Time
ti: ሰዓት

source: “%(value)s” is not a valid UUID.
ti: “%(value)s” ቅቡል UUID ኣይኮነን።

source: Universally unique identifier
ti: UUID

source: File
ti: ፋይል

source: Image
ti: ስእሊ

source: A JSON object
ti: JSON object

source: Value must be valid JSON.
ti: ዋጋ ቅቡል JSON ክኸውን ኣለዎ።

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
ti: %(model)s ብ %(field)s %(value)r ቅቡል ምርጫ ኣይኮነን።

source: Foreign Key (type determined by related field)
ti: Foreign Key

source: One-to-one relationship
ti: One-to-one ዝምድና

source: %(from)s-%(to)s relationship
ti: %(from)s-%(to)s ዝምድና

source: %(from)s-%(to)s relationships
ti: %(from)s-%(to)s ዝምድናታት

source: Many-to-many relationship
ti: Many-to-many ዝምድና

source: This field is required.
ti: እዚ ቦታ የድሊ እዩ።

source: Enter a whole number.
ti: ምሉእ ቁጽሪ የእትው።

source: Enter a valid date.
ti: ቅቡል ዕለት የእትው።

source: Enter a valid time.
ti: ቅቡል ሰዓት የእትው።

source: Enter a valid date/time.
ti: ቅቡል ዕለት/ሰዓት የእትው።

source: Enter a valid duration.
ti: ቅቡል ቆይታ (duration) የእትው።

source: The number of days must be between {min_days} and {max_days}.
ti: ብዝሒ መዓልታት ኣብ መንጎ {min_days} ን {max_days} ክኸውን ኣለዎ።

source: No file was submitted. Check the encoding type on the form.
ti: ዝኾነ ፋይል ኣይተላእከን። ናይቲ ፎርም encoding type ኣረጋግጽ።

source: No file was submitted.
ti: ዝኾነ ፋይል ኣይተላእከን።

source: The submitted file is empty.
ti: እቲ ዝተላእከ ፋይል ባዶ እዩ።

source: Ensure this filename has at most %(max)d character (it has %(length)d).
ti: ሽም ፋይል ካብ %(max)d ዘይበዝሕ ፊደል ክህልዎ ኣረጋግጽ (ዘለዎ %(length)d)።

source: Please either submit a file or check the clear checkbox, not both.
ti: በጃኻ ሓደ ፋይል ልኣኽ ወይ clear ሳጹን ምረጽ፣ ክልቲኡ ኣይከኣልን።

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
ti: ቅቡል ስእሊ ጽዓን። እቲ ዝጸዓንካዮ ፋይል ስእሊ ኣይኮነን ወይ ዝተበላሸወ እዩ።

source: Select a valid choice. %(value)s is not one of the available choices.
ti: ቅቡል ምርጫ ምረጽ። %(value)s ካብቶም ዘለዉ ምርጫታት ኣይኮነን።

source: Enter a list of values.
ti: ዝርዝር ዋጋታት የእትው።

source: Enter a complete value.
ti: ምሉእ ዋጋ የእትው።

source: Enter a valid UUID.
ti: ቅቡል UUID የእትው።

source: Enter a valid JSON.
ti: ቅቡል JSON የእትው።

source: (Hidden field %(name)s) %(error)s
ti: (ሕቡእ ቦታ %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
ti: ManagementForm ዳታ ጎዲሉ ወይ ተበላሽዩ። ዝጎደሉ ቦታታት: %(field_names)s።

source: Please submit at most %(num)d form.
ti: በጃኻ ካብ %(num)d ዘይበዝሕ ፎርም ልኣኽ።

source: Please submit at least %(num)d form.
ti: በጃኻ እንተወሓደ %(num)d ፎርም ልኣኽ።

source: Order
ti: ትእዛዝ

source: Delete
ti: ሰርዝ

source: Please correct the duplicate data for %(field)s.
ti: በጃኻ ነዚ %(field)s ዝተደገመ ዳታ ኣዐርዮ።

source: Please correct the duplicate data for %(field)s, which must be unique.
ti: በጃኻ ነዚ %(field)s ዝተደገመ ዳታ ኣዐርዮ (ፍሉይ ክኸውን ኣለዎ)።

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
ti: በጃኻ ነዚ %(field_name)s ዝተደገመ ዳታ ኣዐርዮ።

source: Please correct the duplicate values below.
ti: በጃኻ ነዞም ዝተደገሙ ዋጋታት ኣዐርዮም።

source: Select a valid choice. That choice is not one of the available choices.
ti: ቅቡል ምርጫ ምረጽ። እቲ ዝመረጽካዮ ካብቶም ዘለዉ ምርጫታት ኣይኮነን።

source: “%(pk)s” is not a valid value.
ti: “%(pk)s” ቅቡል ዋጋ ኣይኮነን።

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
ti: %(datetime)s ኣብ ታይም ዞን %(current_timezone)s ክትርጎም ኣይተኻእለን።

source: Clear
ti: ኣጽሪ

source: Currently
ti: ኣብዚ ሕጂ እዋን

source: Change
ti: ቀይር

source: Unknown
ti: ዘይተፈልጠ

source: Yes
ti: እወ

source: No
ti: ኣይኮነን

source: yes,no,maybe
ti: እወ,ኣይኮነን,ምናልባት

source: %(size)d byte
ti: %(size)d ባይት

source: p.m.
ti: ድ.ቀ.

source: a.m.
ti: ቅ.ቀ.

source: midnight
ti: ፋርቀ ለይቲ

source: noon
ti: ፋርቀ መዓልቲ

source: Monday
ti: ሰኑይ

source: Tuesday
ti: ሰሉስ

source: Wednesday
ti: ረቡዕ

source: Thursday
ti: ሓሙስ

source: Friday
ti: ዓርቢ

source: Saturday
ti: ቀዳም

source: Sunday
ti: ሰንበት

source: Mon
ti: ሰኑ

source: Tue
ti: ሰሉ

source: Wed
ti: ረቡ

source: Thu
ti: ሓሙ

source: Fri
ti: ዓር

source: Sat
ti: ቀዳ

source: Sun
ti: ሰን

source: January
ti: ጃንዋሪ

source: February
ti: ፌብሩዋሪ

source: March
ti: ማርች

source: April
ti: ኤፕሪል

source: May
ti: ሜይ

source: June
ti: ጁን

source: July
ti: ጁላይ

source: August
ti: ኦገስት

source: September
ti: ሴፕቴምበር

source: October
ti: ኦክቶበር

source: November
ti: ኖቬምበር

source: December
ti: ዲሴምበር

source: jan
ti: ጃን

source: feb
ti: ፌብ

source: mar
ti: ማር

source: apr
ti: ኤፕ

source: may
ti: ሜይ

source: jun
ti: ጁን

source: jul
ti: ጁላ

source: aug
ti: ኦገ

source: sep
ti: ሴፕ

source: oct
ti: ኦክ

source: nov
ti: ኖቬ

source: dec
ti: ዲሴ

# abbrev. month
source: Jan.
ti: ጃን.

# abbrev. month
source: Feb.
ti: ፌብ.

# abbrev. month
source: March
ti: ማርች

# abbrev. month
source: April
ti: ኤፕሪል

# abbrev. month
source: May
ti: ሜይ

# abbrev. month
source: June
ti: ጁን

# abbrev. month
source: July
ti: ጁላይ

# abbrev. month
source: Aug.
ti: ኦገ.

# abbrev. month
source: Sept.
ti: ሴፕ.

# abbrev. month
source: Oct.
ti: ኦክ.

# abbrev. month
source: Nov.
ti: ኖቬ.

# abbrev. month
source: Dec.
ti: ዲሴ.

# alt. month
source: January
ti: ጃንዋሪ

# alt. month
source: February
ti: ፌብሩዋሪ

# alt. month
source: March
ti: ማርች

# alt. month
source: April
ti: ኤፕሪል

# alt. month
source: May
ti: ሜይ

# alt. month
source: June
ti: ጁን

# alt. month
source: July
ti: ጁላይ

# alt. month
source: August
ti: ኦገስት

# alt. month
source: September
ti: ሴፕቴምበር

# alt. month
source: October
ti: ኦክቶበር

# alt. month
source: November
ti: ኖቬምበር

# alt. month
source: December
ti: ዲሴምበር

source: This is not a valid IPv6 address.
ti: እዚ ቅቡል ናይ IPv6 ኣድራሻ ኣይኮነን።

source: or
ti: ወይ

source: %(num)d year
ti: %(num)d ዓመት

source: %(num)d month
ti: %(num)d ወርሒ

source: %(num)d week
ti: %(num)d ሰሙን

source: %(num)d day
ti: %(num)d መዓልቲ

source: %(num)d hour
ti: %(num)d ሰዓት

source: %(num)d minute
ti: %(num)d ደቒቕ

source: Forbidden
ti: ዝተኸልከለ

source: CSRF verification failed. Request aborted.
ti: CSRF verification ፈሺሉ። ጠለብ ተቋሪጹ።

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ti: እዚ መልእኽቲ ትርእዩ ዘለኹም ምኽንያት እዚ HTTPS ሳይት “Referer header” ስለዘድልዮ እዩ።

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
ti: ብራውዘርኩም “Referer” headers ከይሰድድ ተዓጽዩ እንተሎ፣ በጃኹም ክፈትዎ (እንተወሓደ ንዚ ሳይት)።

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
ti: እቲ <meta name="referrer" content="no-referrer"> ዝብል tag ትጥቀሙ እንተለኹም፣ በጃኹም ኣውጽእዎ።

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ti: እዚ ሳይት CSRF cookie ስለዘድልዮ እዩ እዚ መልእኽቲ ዝመጽእ ዘሎ።

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
ti: ኩኪስ (Cookies) ተዓጽዩ እንተሎ፣ በጃኹም መሊስኩም ክፈትዎ (እንተወሓደ ንዚ ሳይት)።

source: More information is available with DEBUG=True.
ti: ተወሳኺ ሓበሬታ ብ DEBUG=True ይርከብ።

source: No year specified
ti: ዓመተ ምህረት ኣይተገልጸን

source: Date out of range
ti: ዕለት ካብ ክልል ወጻኢ እዩ

source: No month specified
ti: ወርሒ ኣይተገልጸን

source: No day specified
ti: መዓልቲ ኣይተገልጸን

source: No week specified
ti: ሰሙን ኣይተገልጸን

source: No %(verbose_name_plural)s available
ti: ዝኾነ %(verbose_name_plural)s የለን

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
ti: ናይ መጻኢ %(verbose_name_plural)s ኣይርከብን።

source: Invalid date string “%(datestr)s” given format “%(format)s”
ti: ዘይቅቡል ዕለት “%(datestr)s” (ፎርማት: “%(format)s”)

source: No %(verbose_name)s found matching the query
ti: ምስቲ ጠለብ ዝሰማማዕ %(verbose_name)s ኣይተረኽበን

source: Invalid page (%(page_number)s): %(message)s
ti: ዘይቅቡል ገጽ (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
ti: ዝርዝር ባዶ እዩ (“%(class_name)s.allow_empty” False እዩ)።

source: Directory indexes are not allowed here.
ti: Directory indexes ኣብዚ ኣይፍቀዱን እዮም።

source: “%(path)s” does not exist
ti: “%(path)s” የለን

source: The install worked successfully! Congratulations!
ti: ምጽዓን (Install) ብዓወት ተፈጺሙ! እንቋዕ ሓጎሰኩም!

source: title
ti: ኣርእስቲ

source: password
ti: ፓስወርድ

source: visits
ti: ዑደታት

source: Sorry, translation is not available.
ti: ይቅርታ፣ ትርጉም የለን።

source: None
ti: ዋላ ሓደ

source: Product Name
ti: ናይ ፍርያት ሽም

source: Upload Harvest | Arbor
ti: ፍርያት ጽዓን | Arbor

source: Upload Harvest
ti: ፍርያት ጽዓን

source: Take a Photo
ti: ስእሊ ኣልዕል

source: Tap to select image
ti: ስእሊ ንምምራጽ ጠውቕ

source: Optional
ti: ኣማራጺ

source: If you don't know the English name, leave it blank. Admin will fix it.
ti: እንግሊዝኛ ሽሙ እንተዘይፈልጥካዮ፣ ባዶ ግደፎ። ኣድሚን ከዐርዮ እዩ።

source: Price (ETB)
ti: ዋጋ (ETB)

source: /kg
ti: /ኪሎ

source: Quantity
ti: ብዝሒ

source: kg
ti: ኪሎ

source: Farm Location
ti: ቦታ ሕርሻ

source: List on Market
ti: ኣብ ዕዳጋ ምዝግብ

source: Add Inventory - Arbor
ti: ንብረት ወስኽ - Arbor

source: Add Inventory
ti: ንብረት ወስኽ

source: Cancel
ti: ሰርዝ

source: Stock Qty
ti: ብዝሒ ክምችት

source: Photo (Optional)
ti: ስእሊ (ኣማራጺ)

source: Add to Store
ti: ናብ መኽዘን ወስኽ

source: Complete Payment
ti: ክፍሊት ፈጽም

source: Complete Transfer
ti: ትራንስፈር ፈጽም

source: Please send
ti: በጃኻ ስደድ

source: ETB
ti: ብር

source: Transfer to Seller:
ti: ናብ ሸጣይ ኣመሓላልፍ:

source: Bank:
ti: ባንኪ:

source: CBE (Commercial Bank)
ti: CBE (ንግዲ ባንኪ)

source: Account Name:
ti: ሽም ሕሳብ:

source: Copy
ti: ቅዳሕ

source: Upload Screenshot / Receipt
ti: ስክሪን ሾት / ቅብሊት ጽዓን

source: I have sent the money
ti: ገንዘብ ሰዲደ ኣለኹ

source: Fresh Market - Arbor
ti: ፍርሽ ዕዳጋ - Arbor

source: Arbor Market
ti: Arbor ዕዳጋ

source: Welcome,
ti: እንቋዕ ብደሓን መጻእኩም፣

source: Logout
ti: ውጻእ

source: Fresh Organic Food
ti: ፍርሽ ኦርጋኒክ መግቢ

source: Direct from Ethiopia's Best Farmers
ti: ቀጥታ ካብ ምርጥ ሓረስታይ ኢትዮጵያ

source: Now
ti: ሕጂ

source: Available Harvests
ti: ዘለዉ ፍርያታት

source: kg Stock
ti: ኪሎ ክምችት

source: Buy Now
ti: ሕጂ ግዛእ

source: No crops listed yet. Farmers are planting! 🌱
ti: ክሳብ ሕጂ ዝተዘርዘረ ፍርያት የለን። ሓረስታይ ይዘርኡ ኣለዉ! 🌱

source: Arbor
ti: ኣርቦር

source: Checkout
ti: ክፈሊ

source: Review Order
ti: ትእዛዝ ዳግም ረኣይ

source: Sold by
ti: ዝሸጠ

source: Unit Price
ti: ናይ ሓደ ዋጋ

source: Order Details
ti: ዝርዝር ትእዛዝ

source: MAX
ti: ዝለዓለ

source: Select Payment Method
ti: አገባብ ክፍሊት ምረጽ

source: Cash on Delivery
ti: ምስ ተረከብካ ዝኽፈል

source: Telebirr / M-Pesa
ti: ቴሌብር / M-Pesa

source: Mobile Banking
ti: ሞባይል ባንኪንግ

source: Total to Pay
ti: ዝኽፈል ድምር

source: Confirm Order
ti: ትእዛዝ ኣረጋግጽ

source: Confirm Purchase
ti: ምግዛእ ኣረጋግጽ

source: Review details before payment
ti: ቅድሚ ምኽፋል ዝርዝር ረኣይ

source: Product
ti: ፍርያት

source: Quantity Needed
ti: ዘድሊ ብዝሒ

source: Choose Payment Method
ti: አገባብ ክፍሊት ምረጽ

source: Mobile Money
ti: ሞባይል ገንዘብ

source: Pay Cash on Delivery
ti: ርክብ ምስ ፈጸምካ ብጥረ ገንዘብ ክፈሊ

source: Start Group Buy - Arbor
ti: ናይ ሓባር ሸመታ ጀምር - Arbor

source: Launch Group
ti: ጉጅለ ጀምር

source: Start New Group
ti: ሓዲሽ ጉጅለ ጀምር

source: Urban Group:
ti: ናይ ከተማ ጉጅለ:

source: Fresh Food
ti: ፍርሽ መግቢ

source: Farmer Co-op:
ti: ማሕበር ሓረስታይ:

source: Farm Inputs
ti: ናይ ሕርሻ እታወታት

source: Group Name
ti: ሽም ጉጅለ

source: Drop-off Location (For Buyers)
ti: መራገፊ ቦታ (ንዓደግቲ)

source: Collection Warehouse (For Farmers)
ti: መአከቢ መኽዘን (ንሓረስታይ)

source: Where will the truck unload the food?
ti: እቲ መኪና መግቢ ኣበይ ከራግፍ እዩ?

source: Where will the truck drop the fertilizer?
ti: እቲ መኪና መዳበሪያ ኣበይ ከራግፍ እዩ?

source: Target Goal
ti: ሸቶ

source: Units
ti: አሃዱታት

source: Target Price
ti: ተደላይ ዋጋ

source: Deadline Date
ti: ዝውድኣሉ ዕለት

source: Cancel & Return Home
ti: ሰርዝ እሞ ናብ ዋና ገጽ ተመለስ

source: Arbor Marketplace. Connecting communities.
ti: Arbor ዕዳጋ። ማሕበረሰብ የተኣሳስር።

source: Farmer Dashboard - Arbor
ti: ናይ ሓረስታይ ዳሽቦርድ - Arbor

source: Market
ti: ዕዳጋ

source: My Farm Command
ti: ናይ ሕርሻይ ዳሽቦርድ

source: Payment Verification Needed
ti: ክፍሊት ምርግጋጽ የድሊ

source: Buyers have sent money via Mobile Banking. Please check receipts.
ti: ዓደግቲ ብሞባይል ባንኪንግ ገንዘብ ሰዲዶም ኣለዉ። በጃኹም ቅብሊት ኣረጋግጹ።

source: View Receipt
ti: ቅብሊት ረኣይ

source: Confirm Receipt
ti: ቅብሊት ኣረጋግጽ

source: Report Issue
ti: ጸገም ኣፍልጥ

source: Your Harvest
ti: ፍርያትካ

source: Manage your active listings and stock.
ti: ንጡፋት ምዝገባታትን ስቶክን ኣመሓድር።

source: List New Crop
ti: ሓዲሽ ፍርያት ምዝግብ

source: Active Inventory
ti: ዘሎ ንብረት

source: ETB/kg
ti: ብር/ኪሎ

source: Stock:
ti: ክምችት:

source: Sold Out
ti: ተወዲኡ

source: Active
ti: ንጡፍ

source: Edit
ti: ኣርትዕ (Edit)

source: Are you sure you want to delete this crop? This cannot be undone.
ti: ነዚ ፍርያት ክትስርዞ ርግጸኛ ዲኻ? እዚ ምምላስ ኣይከኣልን።

source: Your fields are empty.
ti: ቦታታትካ ባዶ እዮም።

source: List a crop to start selling!
ti: ንምሻጥ ምጅማር ፍርያት ምዝግብ!

source: Start Listing
ti: ምዝገባ ጀምር

source: Need Supplies?
ti: ኣቕርቦት የድልየካ?

source: Buy Fertilizers, Seeds, and Tools from verified suppliers.
ti: መዳበሪያ፣ ዘርኢ፣ ከምኡውን መሳርሒታት ካብ ዝተረጋገጹ ኣቕረብቲ ግዛእ።

source: Open Material Store
ti: ናይ ኣቕርቦት መኽዘን ክፈት
