Repository: firaolterefe447-cyber/-arbor-market
Catalog: locale/om/LC_MESSAGES/django.po
Languages: om

source: Connect, get help, or contribute
om: Wal-qunnami, gargaarsa argadhu, yookiin gumaachi

source: title
om: mata-duree

source: password
om: jecha darbii

source: title a
om: mata-duree a

source: title b
om: mata-duree b

source: title c
om: mata-duree c

source: title d
om: mata-duree d

source: visits
om: dawwannaawwan

source: Sorry, translation is not available.
om: Dhiifama, hiikkaan hin jiru.

source: None
om: Duwwaa

source: Product Name
om: Maqaa Oomishaa

source: Upload Harvest | Arbor
om: Oomisha Olchanuu | Arbor

source: Upload Harvest
om: Oomisha Olchanuu

source: Take a Photo
om: Suuraa Kaasi

source: Tap to select image
om: Suuraa filachuuf tuqi

source: Optional
om: Filannoo

source: If you don't know the English name, leave it blank. Admin will fix it.
om: Maqaa Ingiliffaa hin beektu yoo ta'e, duwwaa dhiisi. Bulchaan ni sirreessa.

source: Price (ETB)
om: Gatii (ETB)

source: Quantity
om: Baay'ina

source: Farm Location
om: Iddoo Qonnaa

source: List on Market
om: Gabaarratti Galmeessi

source: Add Inventory - Arbor
om: Inveentarii Dabaluu - Arbor

source: Add Inventory
om: Inveentarii Dabaluu

source: Cancel
om: Haqi

source: Stock Qty
om: Baay'ina Isitoo

source: Photo (Optional)
om: Suuraa (Filannoo)

source: Add to Store
om: Suuqeetti Dabali

source: Complete Payment
om: Kaffaltii Xumuri

source: Complete Transfer
om: Dabarsa Xumuri

source: Please send
om: Maaloo ergi

source: ETB
om: Birr

source: Transfer to Seller:
om: Gurguraaf Dabarsi:

source: Bank:
om: Baankii:

source: CBE (Commercial Bank)
om: CBE (Baankii Daldalaa)

source: Account Name:
om: Maqaa Akkaawuntii:

source: Copy
om: Koppii

source: Upload Screenshot / Receipt
om: Nagahee / Screenshot Ol fe'i

source: I have sent the money
om: Maallaqa ergeera

source: Fresh Market - Arbor
om: Gabaa Kuduraa - Arbor

source: Arbor Market
om: Gabaa Arbor

source: Welcome,
om: Baga nagaan dhufte,

source: Logout
om: Ba'i

source: Fresh Organic Food
om: Nyaata Uumamaa Firesh Ta'e

source: Direct from Ethiopia's Best Farmers
om: Qotee Bultoota Itoophiyaa irraa kallattiin

source: Now
om: Amma

source: Available Harvests
om: Oomishoota Jiran

source: kg Stock
om: kg Isitoo

source: Buy Now
om: Amma Biti

source: No crops listed yet. Farmers are planting! 🌱
om: Oomishni hin galmoofne. Qotee bultoonni dhaabaa jiru! 🌱

source: Review Order
om: Ajaja Irra Deebi'ii Ilaali

source: Sold by
om: Kan gurgure

source: Unit Price
om: Gatii Tokkoo

source: Order Details
om: Bal'ina Ajajaa

source: MAX
om: OL'AANAA

source: Select Payment Method
om: Mala Kaffaltii Filadhu

source: Cash on Delivery
om: Yeroo Fudhatan Kaffaluu

source: Mobile Banking
om: Baankii Mobaayilaa

source: Total to Pay
om: Waliigala Kaffalamu

source: Confirm Order
om: Ajaja Mirkaneessi

source: Confirm Purchase
om: Bittuu Mirkaneessi

source: Review details before payment
om: Osoon hin kaffalin bal'ina isaa ilaali

source: Product
om: Oomisha

source: Quantity Needed
om: Baay'ina Barbaadamu

source: Choose Payment Method
om: Mala Kaffaltii Filadhu

source: Mobile Money
om: Maallaqa Mobaayilaa

source: Pay Cash on Delivery
om: Yeroo Fudhattu Kaffali

source: Start Group Buy - Arbor
om: Gareen Bituu Eegali - Arbor

source: Launch Group
om: Garee Eegali

source: Start New Group
om: Garee Haaraa Eegali

source: Urban Group:
om: Garee Magaalaa:

source: Fresh Food
om: Nyaata Firesh

source: Farmer Co-op:
om: Waldaa Qotee Bulaa:

source: Farm Inputs
om: Galtee Qonnaa

source: Group Name
om: Maqaa Garee

source: Drop-off Location (For Buyers)
om: Iddoo Itti Buusu (Bittaadhaa)

source: Collection Warehouse (For Farmers)
om: Galma Walitti Qabaa (Qotee Bulaaf)

source: Where will the truck unload the food?
om: Konkolaataan eessatti buusa?

source: Where will the truck drop the fertilizer?
om: Konkolaataan Xao'o eessatti buusa?

source: Target Goal
om: Kaayyoo

source: Units
om: Yuniitii

source: Target Price
om: Gatii Kaayyoo

source: Deadline Date
om: Guyyaa Dhumaa

source: Cancel & Return Home
om: Haqiitii Gara Manaa Deebi'i

source: Arbor Marketplace. Connecting communities.
om: Gabaa Arbor. Hawaasa walitti fiduuf.

source: Farmer Dashboard - Arbor
om: Daashboordii Qotee Bulaa - Arbor

source: Market
om: Gabaa

source: My Farm Command
om: Ajaja Qonnaa Koo

source: Payment Verification Needed
om: Kaffaltii Mirkaneessuun Barbaachisaadha

source: Buyers have sent money via Mobile Banking. Please check receipts.
om: Bittaazonni Baankii Mobaayilaan maallaqa erganiiru. Maaloo nagahee ilaali.

source: View Receipt
om: Nagahee Ilaali

source: Confirm Receipt
om: Nagahee Mirkaneessi

source: Report Issue
om: Rakkoo Gabaasi

source: Your Harvest
om: Oomisha Kee

source: Manage your active listings and stock.
om: Oomishoota kee fi isitoo bulchi.

source: List New Crop
om: Oomisha Haaraa Galmeessi

source: Active Inventory
om: Inveentarii Hojii Irra Jiru

source: ETB/kg
om: Birr/kg

source: Stock:
om: Isitoo:

source: Sold Out
om: Dhumera

source: Active
om: Hojii Irra

source: Edit
om: Gulaali

source: Are you sure you want to delete this crop? This cannot be undone.
om: Oomisha kana haquu barbaaddaa? Kun deebi'uu hin danda'u.

source: Your fields are empty.
om: Maasiin kee duwwaadha.

source: List a crop to start selling!
om: Gurguruu eegaluuf oomisha galmeessi!

source: Start Listing
om: Galmeessuu Eegali

source: Need Supplies?
om: Galtee Barbaadduu?

source: Buy Fertilizers, Seeds, and Tools from verified suppliers.
om: Xao'o, sanyii fi meeshaalee qonnaa dhiyeessitoota beekamoo irraa bitaa.

source: Open Material Store
om: Suuqii Meeshaalee Bani

source: Market Trends
om: Haala Gabaa

source: No market data available.
om: Daataan gabaa hin jiru.

source: Fleet Manifest - Arbor
om: Maniifestii Konkolaataa - Arbor

source: Arbor Fleet
om: Konkolaataa Arbor

source: Official Logistics
om: Geejjiba Seera Qabeessa

source: Driver ID:
om: ID Konkolaachisaa:

source: Daily Route
om: Karaa Guyyaa

source: Assignments
om: Ramaddiiwwan

source: Order #
om: Ajaja #

source: Pickup From
om: Eessaa Fudhatama

source: Deliver To
om: Eessatti Geessama

source: Confirm Pickup
om: Fudhachuu Mirkaneessi

source: Enter Buyer Code
om: Koodii Bitaa Galchi

source: Verify
om: Mirkaneessi

source: Completed
om: Xumurameera

source: All Clear
om: Hundi Qulqulluudha

source: Your manifest is empty.
om: Maniifestiin kee duwwaadha.

source: Logistics Dashboard - Arbor
om: Daashboordii Geejjibaa - Arbor

source: Dispatch
om: Ergi

source: SCORE
om: QABXII

source: Your Manifest
om: Maniifestii Kee

source: View Details
om: Bal'ina Ilaali

source: No active manifest.
om: Maniifestiin hojii irra jiru hin jiru.

source: Total
om: Waliigala

source: My Jobs
om: Hojiiwwan Koo

source: Post Trip
om: Imala Galmeessi

source: Order Feed
om: Dhiyeessii Ajajaa

source: Assigned to you
om: Siif ramadame

source: Open
om: Banaa

source: Done
om: Xumurame

source: Taken
om: Fudhatame

source: From
om: Eessaa

source: To
om: Eessatti

source: No orders found.
om: Ajajni hin argamne.

source: Wait for new requests.
om: Gaaffiiwwan haaraa eegi.

source: Application Received - Arbor
om: Iyyanni Fudhatameera - Arbor

source: Application Pending
om: Iyyanni Eegaa Jira

source: We have received your application.
om: Iyyata kee arganneerra.

source: Please wait for Admin approval.
om: Maaloo hanga Bulchaan mirkaneessutti eegi.

source: Status:
om: Haala:

source: In Review...
om: Ilaalamaa jira...

source: An admin must verify your account before you can access the Delivery Dashboard.
om: Osoo Daashboordii Geejjibaa hin seenin dura Bulchaan akkaawuntii kee mirkaneessuu qaba.

source: Check Status (Login)
om: Haala Ilaali (Seeni)

source: Back to Home Page
om: Gara Fuula Duraatti Deebi'i

source: Edit Product
om: Oomisha Gulaali

source: Crop Name
om: Maqaa Oomishaa

source: Stock (kg)
om: Isitoo (kg)

source: Update Photo
om: Suuraa Haaromsi

source: Save Changes
om: Jijjiirama Galchi

source: Edit Order #
om: Ajaja # Gulaali

source: Edit Order
om: Ajaja Gulaali

source: Current Total:
om: Waliigala Ammaa:

source: New Quantity
om: Baay'ina Haaraa

source: Update Order
om: Ajaja Haaromsi

source: 's Farm - Arbor
om: Qonnaa - Arbor

source: Back to Market
om: Gara Gabaatti Deebi'i

source: Farm Profile
om: Piroofayilii Qonnaa

source: Active Listings
om: Galmeewwan Hojii Irra Jiran

source: Full Harvest List
om: Tarree Oomishaa Guutuu

source: kg left
om: kg hafe

source: In Stock
om: Isitoo Keessa

source: This farmer has no other active listings.
om: Qotee bulaan kun galmee biraa hojii irra jiru hin qabu.

source: Community Hub - Arbor
om: Wiirtuu Hawaasaa - Arbor

source: My Farm
om: Qonnaa Koo

source: Command Center
om: Wiirtuu Ajajaa

source: Community Hub
om: Wiirtuu Hawaasaa

source: Sell
om: Gurguri

source: Dashboard
om: Daashboordii

source: Groups
om: Gareewwan

source: Orders
om: Ajajoota

source: Profile
om: Piroofayilii

source: Sign Out
om: Ba'i

source: Group Buying Center
om: Wiirtuu Gareen Bituu

source: Join forces with neighbors. Buy together. Save together.
om: Ollaawwan wajjin ta'aa. Waliin bitaa. Waliin qusadaa.

source: Groups You Manage
om: Gareewwan Ati Bulchitu

source: Delivery:
om: Geejjiba:

source: Member List
om: Tarree Miseensotaa

source: Name
om: Maqaa

source: Phone
om: Bilbila

source: Action
om: Tarkaanfii

source: Kick this member?
om: Miseensa kana ari'uu?

source: Kick
om: Ari'i

source: Locked
om: Cufameera

source: No members yet.
om: Ammatti miseensi hin jiru.

source: Total Order:
om: Waliigala Ajajaa:

source: Goal
om: Kaayyoo

source: Finalize order?
om: Ajaja xumuruu?

source: Place Final Order
om: Ajaja Dhumaa Dabarsi

source: Waiting for members...
om: Miseensota eegaa jira...

source: Order Placed
om: Ajajni Darbeera

source: Available Groups to Join
om: Gareewwan Makaamuuf Jiran

source: Input Co-op
om: Gamtaa Galtee

source: Urban Group
om: Garee Magaalaa

source: Leader:
om: Hogganaa:

source: Pickup Location
om: Iddoo Fudhatamaa

source: committed
om: waadaa galame

source: Target:
om: Kaayyoo:

source: Group Price
om: Gatii Garee

source: Join
om: Makaami

source: No active groups found.
om: Gareen hojii irra jiru hin argamne.

source: Be the first to start a community group!
om: Garee hawaasaa eegaluuf jalqaba ta'i!

source: Official Payment Partners
om: Michoota Kaffaltii Seera Qabeessa

source: Secure transactions via Ethiopia's trusted financial institutions.
om: Dhaabbilee faayinaansii Itoophiyaa amanamoo ta'an karaa nagaa kaffalaa.

source: Arbor Marketplace. All Rights Reserved.
om: Gabaa Arbor. Mirgi Qabameera.

source: Arbor - The Grand Market | Farm Direct
om: Arbor - Gabaa Guddaa | Kallattiin Qonnaarraa

source: Ethiopia's premier farm-to-table marketplace. Buy fresh, sell direct, and grow together.
om: Gabaa jalqabaa Itoophiyaa qonnaa-gara-maaddii. Firesh bitaa, kallattiin gurguraa, waliin guddadhaa.

source: Cultivating...
om: Misoomsaa jira...

source: Type to pop up products...
om: Oomishoota argachuuf barreessi...

source: Supplier Dashboard
om: Daashboordii Dhiyeessaa

source: Delivery Dashboard
om: Daashboordii Geejjibaa

source: Cart
om: Kaartii

source: Login
om: Seeni

source: Join Now
om: Amma Makaami

source: Search...
om: Barbaadi...

source: Live Market • Addis Ababa
om: Gabaa Kellii • Finfinnee

source: The Heart of
om: Onnee

source: Ethiopia's Harvest
om: Oomisha Itoophiyaa

source: Direct from the soil to your table. We connect you with local farmers for the freshest produce at fair, transparent prices.
om: Biyyoo irraa kallattiin gara maaddii keessanii. Nuti qotee bultoota naannoo wajjin wal isin qunnamsiifna, oomisha firesh gatii madaalawaadhaan.

source: List Harvest
om: Oomisha Galmeessi

source: Buy Inputs
om: Galtee Bitaa

source: List Material
om: Meeshaa Galmeessi

source: View Input Market
om: Gabaa Galtee Ilaali

source: View Routes
om: Karaa Ilaali

source: Active Orders
om: Ajajoota Hojii Irra Jiran

source: Start Shopping
om: Gabaa Eegali

source: Join Group Buy
om: Gareen Bituutti Makaami

source: Select Your Language / ቋንቋ ይምረጡ
om: Afaan Filadhu / ቋንቋ ይምረጡ

source: Filtering by:
om: Kanaan calaluun:

source: Browse by Category
om: Gosaan Barbaadi

source: All
om: Hunda

source: Fresh Harvest
om: Oomisha Firesh

source: Buy
om: Biti

source: Group
om: Garee

source: Marketplace Empty
om: Gabaan Duwwaadha

source: Check back soon!
om: Yeroo dhiyootti deebi'ii ilaali!

source: Load More Harvests
om: Oomisha Dabalataa Ilaali

source: Farm to Table in 3 Steps
om: Qonnaa irraa gara Maaddiitti Tarkaanfii 3n

source: Simple, Transparent, and Fast.
om: Salphaa, Ifaa, fi Saffisaa.

source: Choose Fresh
om: Firesh Filadhu

source: Browse hundreds of daily listings directly from verified Ethiopian farmers.
om: Galmeewwan dhibbaan lakkaa'aman kallattiin qotee bultoota Itoophiyaa mirkanaa'an irraa ilaali.

source: Group & Save
om: Gareen Biti & Qusadhu

source: Buy individually or join a Group Buy to unlock wholesale prices with neighbors.
om: Kophaa bitaa yookiin Gareen Bituutti makaamaa gatii jumlaa ollaawwan wajjin argachuuf.

source: Fast Delivery
om: Geejjiba Saffisaa

source: We collect from the farm and deliver to your doorstep within 24 hours.
om: Qonnaarraa fuunee sa'aatii 24 keessatti balbala keessanitti geessina.

source: Join the Harvest
om: Oomishatti Makaami

source: Get weekly market price updates, seasonal alerts, and exclusive group-buying deals delivered to your inbox.
om: Odeeffannoo gatii gabaa torbanii, akeekkachiisa waqtii, fi dhiyeessii gareen bituu addaa email keessanirratti argadhaa.

source: your@email.com
om: email@keessan.com

source: Subscribe
om: Galmaa'i

source: Grand Market
om: Gabaa Guddaa

source: Empowering Ethiopia's farmers through digital sovereignty.
om: Qotee bultoota Itoophiyaa birmadummaa dijitaalaan cimsuu.

source: Marketplace
om: Iddoo Gabaa

source: All Products
om: Oomishoota Hunda

source: Fresh Vegetables
om: Kuduraa Firesh

source: Support
om: Deeggarsa

source: Help Center
om: Wiirtuu Gargaarsaa

source: Track Order
om: Ajaja Hordofi

source: Legal
om: Seera

source: Privacy Policy
om: Imaammata Dhuunfaa

source: Terms of Service
om: Waliigaltee Tajaajilaa

source: All rights reserved.
om: Mirgi hundi qabameera.

source: Arbor - Input Supplies | Farm Materials
om: Arbor - Dhiyeessii Galtee | Meeshaalee Qonnaa

source: Loading Supplies...
om: Dhiyeessii Fe'aa Jira...

source: Search fertilizers, seeds, tools...
om: Xao'o, sanyii, meeshaalee barbaadi...

source: Search inputs...
om: Galtee barbaadi...

source: Certified Inputs
om: Galtee Mirkanaa'e

source: Fuel Your
om: Humneessi

source: Farm's Growth
om: Guddina Qonnaa

source: Premium seeds, fertilizers, and machinery from verified suppliers. Delivered directly to your cooperative.
om: Sanyii, xao'o, fi maashinoota qulqulluu dhiyeessitoota mirkanaa'an irraa. Kallattiin gara gamtaa keessaniitti dhihaata.

source: List New Material
om: Meeshaa Haaraa Galmeessi

source: Available Supplies
om: Dhiyeessiiwwan Jiran

source: Supplier
om: Dhiyeessaa

source: General
om: Waliigala

source: /unit
om: /yuniitii

source: left
om: hafe

source: Restocking
om: Deebisanii Guutuu

source: No Supplies Found
om: Dhiyeessiin hin argamne

source: Try searching for a different item.
om: Meeshaa biraa barbaaduu yaali.

source: Empowering Ethiopia's farmers through digital sovereignty. Direct farm-to-table connections, fair prices, and community-driven commerce.
om: Qotee bultoota Itoophiyaa birmadummaa dijitaalaan cimsuu. Qunnampii kallatti qonnaa-gara-maaddii, gatii madaalawaa, fi daldala hawaasaan hogganamu.

source: Fruits & Berries
om: Fuduraalee & Berries

source: Bulk Grains
om: Midhaan Jumlaa

source: Become a Farmer
om: Qotee Bulaa Ta'i

source: Made with 💚 for Ethiopia.
om: Itoophiyaaf 💚 dhaan hojjetame.

source: Join Group - Arbor
om: Gareetti Makaami - Arbor

source: ETB / unit
om: Birr / yuniitii

source: units
om: yuniitii

source: collected so far
om: hanga ammaatti walitti qabame

source: How much do you want?
om: Hagam barbaadda?

source: Commit to Buy
om: Bituuf Waadaa Gali

source: My Favorite Farmers - Arbor
om: Qotee Bultoota Jaalladhu - Arbor

source: Trusted Growers
om: Qotee Bultoota Amanamoo

source: Likes
om: Jaallatama

source: Your Trusted Growers
om: Qotee Bultoota Ati Amantu

source: Support the hands that feed you.
om: Harka si nyaachisu deeggari.

source: Currently Growing
om: Oomishaa Jira

source: No crops listed currently.
om: Ammatti oomishni galmaa'e hin jiru.

source: Unfollow
om: Hordofuu Dhiisi

source: View Shop
om: Suuqii Ilaali

source: Empty Shop
om: Suuqii Duwwaa

source: No favorites yet
om: Ammatti jaallatamaan hin jiru

source: Follow farmers to see their latest harvest here.
om: Oomisha isaanii haaraa asitti arguuf qotee bultoota hordofi.

source: Browse the Market
om: Gabaa Ilaali

source: Login | Arbor
om: Seeni | Arbor

source: Welcome Back
om: Baga Deebite

source: Enter your credentials to access your account.
om: Akkaawuntii kee seenuuf odeeffannoo kee galchi.

source: Phone Number
om: Lakkoofsa Bilbilaa

source: 4-Digit PIN
om: PIN Dijiitii-4

source: Sign In
om: Seeni

source: Don't have an account?
om: Akkaawuntii hin qabduu?

source: Create New Account
om: Akkaawuntii Haaraa Uumi

source: Arbor Marketplace
om: Gabaa Arbor

source: Manage My Groups
om: Gareewwan Koo Bulchuu

source: Home
om: Mana

source: My Managed Groups
om: Gareewwan Ani Bulchu

source: Deliver to:
om: Eessatti Geessama:

source: Current Status
om: Haala Ammaa

source: Member Name
om: Maqaa Miseensaa

source: Committed Qty
om: Baay'ina Waadaa Galame

source: Kick this member out?
om: Miseensa kana ari'uu?

source: Remove
om: Kaasi

source: No members have joined yet.
om: Miseensi tokkoyyuu hin makamne.

source: Total Quantity:
om: Baay'ina Waliigalaa:

source: This will finalize the group and send the order to delivery. Proceed?
om: Kun garee xumuree ajaja gara geejjibaatti erga. Itti fufuu?

source: Sent to Delivery
om: Gara Geejjibaatti Ergame

source: You haven't created any groups yet.
om: Garee tokkoyyuu hin uumne.

source: My Orders | Arbor Market
om: Ajajoota Koo | Gabaa Arbor

source: My Orders
om: Ajajoota Koo

source: Group Buy
om: Gareen Bituu

source: Order History
om: Seenaa Ajajaa

source: Track your farm-fresh deliveries in real-time.
om: Geejjiba oomisha firesh yeroo sirrii (real-time) hordofi.

source: %(count)s Active Order
om: Ajaja Hojii Irra Jiru %(count)s

source: Pending
om: Eegaa Jira

source: Assigned
om: Ramadame

source: On Way
om: Karaa Irra

source: Delivered
om: Gahera

source: Total Cost
om: Waliigala Gatii

source: Placed On
om: Ajajame

source: Delivery To
om: Geessamu

source: Driver
om: Konkolaachisaa

source: Secure Delivery PIN
om: PIN Geejjiba Nageenyaa

source: Give this code to %(name)s
om: Koodii kana %(name)s tiif kenni

source: Cancel this order?
om: Ajaja kana haquu?

source: No active orders
om: Ajajni hojii irra jiru hin jiru

source: Fresh produce is waiting. Start exploring the market to fill your basket.
om: Oomishni firesh eegaa jira. Gabaa ilaaluu eegaliitii guuboo kee guuti.

source: Trusted Payments
om: Kaffaltii Amanamaa

source: Secured by Ethiopia's financial network.
om: Networkii faayinaansii Itoophiyaatiin eegamaa.

source: Manifest #%(id)s - Arbor
om: Maniifestii #%(id)s - Arbor

source: Manifest #%(id)s
om: Maniifestii #%(id)s

source: Ordered On
om: Ajajame

source: Status
om: Haala

source: CASH HANDLING INSTRUCTIONS
om: QAJEELFAMA MAALLAQA QABUU

source: Step 1: Collect from Buyer
om: Tarkaanfii 1: Bitaa irraa fuudhi

source: Total Order Value
om: Gatii Waliigala Ajajaa

source: Step 2: Pay to Seller
om: Tarkaanfii 2: Gurguraaf kaffali

source: Hand this cash to Farmer
om: Maallaqa kana Qotee Bulaaf kenni

source: Step 3: Platform Fee
om: Tarkaanfii 3: Kaffaltii Pilaatfoormii

source: Keep for Arbor Office
om: Waajjira Arbor tiif qabi

source: ⚠️ IMPORTANT: Do not give the full amount to the seller. Only give the 'Pay to Seller' amount.
om: ⚠️ BARBAACHISAA: Maallaqa guutuu gurguraaf hin kennin. Hammi 'Gurguraaf kaffali' jedhu qofa kenni.

source: Cargo Details
om: Bal'ina Fe'umsaa

source: Item:
om: Meeshaa:

source: Quantity:
om: Baay'ina:

source: unit(s)
om: yuniitii

source: Value:
om: Gatii:

source: Payout Details
om: Bal'ina Kaffaltii

source: Total Paid:
om: Waliigala Kaffalame:

source: Platform Fee (5%%):
om: Kaffaltii Pilaatfoormii (5%%):

source: Your Earnings:
om: Galii Kee:

source: Payment & Notes
om: Kaffaltii & Yaadannoo

source: Method:
om: Mala:

source: Note:
om: Hubachiisa:

source: Handle with care.
om: Of eeggannoon qabi.

source: Origin (Seller)
om: Ka'umsa (Gurguraa)

source: Transport
om: Geejjiba

source: Enter Buyer PIN
om: PIN Bitaa Galchi

source: Verify & Complete
om: Mirkaneessi & Xumuri

source: Ask Buyer for 4-digit code
om: Koodii dijiitii-4 Bitaa gaafadhu

source: Job Complete
om: Hojiin Xumurameera

source: No Driver
om: Konkolaachisaan Hin Jiru

source: Waiting for assignment...
om: Ramaddii eegaa jira...

source: Assign to Me
om: Anaaf Ramadi

source: Auto-fill my details
om: Bal'ina koo ofiin guuti

source: Destination (Buyer)
om: Bakka Gahumsaa (Bitaa)

source: Post a Trip - Arbor CDN
om: Imala Galmeessi - Arbor CDN

source: Post a Trip
om: Imala Galmeessi

source: Tell us where you are going to get matched.
om: Eessa akka deemtu nutti himi akka wal si qunnamsiifnu.

source: Origin
om: Ka'umsa

source: Destination
om: Bakka Gahumsaa

source: Available Capacity (KG)
om: Dandeettii Jiru (KG)

source: Departure Date/Time
om: Guyyaa/Yeroo Ka'umsaa

source: Publish Trip
om: Imala Maxxansi

source: Unit
om: Yuniitii

source: Grown by
om: Kan oomishe

source: Visit Farm
om: Qonnaa Dawwadhu

source: You might also like
om: Kanaas jaallachuu dandeessa

source: My Profile - Arbor
om: Piroofayilii Koo - Arbor

source: My Profile Settings
om: Qindoomina Piroofayilii Koo

source: Profile Picture
om: Suuraa Piroofayilii

source: No Location Set
om: Iddoon Hin Guutamne

source: Banking Info:
om: Odeeffannoo Baankii:

source: ⚠️ No bank details added.
om: ⚠️ Bal'inni baankii hin dabalamne.

source: Edit Details
om: Bal'ina Gulaali

source: Personal Information
om: Odeeffannoo Dhuunfaa

source: First Name
om: Maqaa

source: Last Name
om: Maqaa Abbaa

source: Location / Address
om: Iddoo / Teessoo

source: Change Photo
om: Suuraa Jijjiiri

source: Banking Details
om: Bal'ina Baankii

source: Buyers will see this to transfer money to you via Mobile Banking.
om: Bittaazonni Baankii Mobaayilaan maallaqa siif erguuf kana ni argu.

source: Bank Name
om: Maqaa Baankii

source: Account Number
om: Lakkoofsa Akkaawuntii

source: Save Changes 💾
om: Jijjiirama Galchi 💾

source: Join as Farmer | Arbor
om: Akka Qotee Bulaatti Makaami | Arbor

source: Back to
om: Gara Deebi'i

source: Roles
om: Gahee

source: Farmer Registration
om: Galmee Qotee Bulaa

source: Join the network. Sell your harvest.
om: Networkiitti makaami. Oomisha kee gurguri.

source: e.g. Bishoftu
om: Fkn. Bishooftuu

source: Confirm
om: Mirkaneessi

source: Register Farm
om: Qonnaa Galmeessi

source: Already have an account?
om: Akkaawuntii qabdaa?

source: Login Here
om: Asitti Seeni

source: Secure & Verified
om: Eegamaa & Mirkanaa'aa

source: Join as Buyer | Arbor
om: Akka Bitaatti Makaami | Arbor

source: Buyer Registration
om: Galmee Bitaa

source: Access farm-fresh prices directly.
om: Gatii qonnaa firesh kallattiin argadhu.

source: PIN (4 Digits)
om: PIN (Dijiitii 4)

source: Confirm PIN
om: PIN Mirkaneessi

source: Fair Prices • Farm Direct
om: Gatii Madaalawaa • Kallattiin Qonnaarraa

source: Join Logistics | Arbor
om: Geejjibatti Makaami | Arbor

source: Language
om: Afaan

source: Delivery Partner
om: Michuu Geejjibaa

source: Join the Crowd-Delivery Network.
om: Networkii Geejjiba Hawaasaatti Makaami.

source: Personal Details
om: Bal'ina Dhuunfaa

source: Surname
om: Maqaa Akaakayyuu
