Repository: firaolterefe447-cyber/-arbor-market
Catalog: locale/om/LC_MESSAGES/django.po
Languages: om

source: English
om: Ingiliffa

source: Amharic
om: Amaariffa

source: Somali
om: Afaan Somaalee

source: Tigrinya
om: Tigriffa

source: {editor}: Editing failed
om: {editor}: Gulaaluun hin milkoofne

source: {editor}: Editing failed: {e}
om: {editor}: Gulaaluun hin milkoofne: {e}

source: Options
om: Filannoowwan

source: Got unexpected extra argument ({args})
om: Falmii dabalataa hin eegamne argame ({args})

source: DeprecationWarning: The command {name!r} is deprecated.{extra_message}
om: DeprecationWarning: Ajajni {name!r} hafeera.{extra_message}

source: Aborted!
om: Kutuudhaan dhaabbate!

source: Commands
om: Ajajoota

source: Missing command.
om: Ajajni hin jiru.

source: No such command {name!r}.
om: Ajajni {name!r} jedhu hin jiru.

source: Value must be an iterable.
om: Gatiin irra deddeebi'amuu danda'u ta'uu qaba.

source: Takes {nargs} values but 1 was given.
om: Gatii {nargs} fudhata, garuu 1 qofatu kenname.

source: DeprecationWarning: The {param_type} {name!r} is deprecated.{extra_message}
om: DeprecationWarning: {param_type} {name!r} hafeera.{extra_message}

source: default: {default}
om: durtii: {default}

source: (dynamic)
om: (jijjiiramaa)

source: %(prog)s, version %(version)s
om: %(prog)s, varshinii %(version)s

source: Show the version and exit.
om: Varshinii agarsiisiitii bahi.

source: Show this message and exit.
om: Ergaa kana agarsiisiitii bahi.

source: Error: {message}
om: Dogoggora: {message}

source: Try '{command} {option}' for help.
om: Gargaarsaaf '{command} {option}' yaali.

source: Invalid value: {message}
om: Gatii dogoggoraa: {message}

source: Invalid value for {param_hint}: {message}
om: Gatii dogoggoraa {param_hint} tiif: {message}

source: Missing argument
om: Falmiin hin jiru

source: Missing option
om: Filannoon hin jiru

source: Missing parameter
om: Paaraamiitaariin hin jiru

source: Missing {param_type}
om: {param_type} dhabameera

source: Missing parameter: {param_name}
om: Paaraamiitaariin dhabameera: {param_name}

source: No such option: {name}
om: Filannoon akkasii hin jiru: {name}

source: Did you mean {possibility}?
om: {possibility} jechuu keetii?

source: unknown error
om: dogoggora hin beekamne

source: Could not open file {filename!r}: {message}
om: Faayila {filename!r} banuu hin dandeenye: {message}

source: Usage:
om: Haala Itti Fayyadamaa:

source: Argument {name!r} takes {nargs} values.
om: Falmiin {name!r} gatiiwwan {nargs} fudhata.

source: Option {name!r} does not take a value.
om: Filannoon {name!r} gatii hin fudhatu.

source: Option {name!r} requires an argument.
om: Filannoon {name!r} falmii tokko barbaada.

source: Shell completion is not supported for Bash versions older than 4.4.
om: Guutiinsi Shell (Shell completion) Bash varshinii 4.4 gadiitiif hin deeggaru.

source: Couldn't detect Bash version, shell completion is not supported.
om: Varshinii Bash adda baasuun hin danda'amne, guutiinsi shell hin deeggaru.

source: Repeat for confirmation
om: Mirkaneessuuf irra deebi'i

source: Error: The value you entered was invalid.
om: Dogoggora: Gatiin ati galchite sirrii miti.

source: Error: {e.message}
om: Dogoggora: {e.message}

source: Error: The two entered values do not match.
om: Dogoggora: Gatiiwwan lameen galchite wal hin siman.

source: Error: invalid input
om: Dogoggora: galtee sirrii hin taane

source: Press any key to continue...
om: Ittifufuuf furtuu kamiyyuu tuqi...

source: Choose from: {choices}
om: Kanarraa filadhu: {choices}

source: {value!r} is not {choice}.
om: {value!r} filannoo {choice} miti.

source: {value!r} does not match the format {format}.
om: {value!r} foormaat {format} wajjin wal hin simu.

source: {value!r} is not a valid {number_type}.
om: {value!r} akaakuu lakkoofsaa {number_type} sirrii miti.

source: {value} is not in the range {range}.
om: {value} daangaa {range} keessa hin jiru.

source: {value!r} is not a valid boolean. Recognized values: {states}
om: {value!r} buuliyaanii sirrii miti. Gatiiwwan beekaman: {states}

source: {value!r} is not a valid UUID.
om: {value!r} UUID sirrii miti.

source: file
om: faayila

source: directory
om: daayireektarii

source: path
om: paasii

source: {name} {filename!r} does not exist.
om: {name} {filename!r} hin jiru.

source: {name} {filename!r} is a file.
om: {name} {filename!r} faayila.

source: {name} {filename!r} is a directory.
om: {name} {filename!r} daayireektariidha.

source: {name} {filename!r} is not readable.
om: {name} {filename!r} dubbisuun hin danda'amu.

source: {name} {filename!r} is not writable.
om: {name} {filename!r} irratti barreessuun hin danda'amu.

source: {name} {filename!r} is not executable.
om: {name} {filename!r} raawwachuun hin danda'amu.

source: {len_type} values are required, but {len_value} was given.
om: Gatiin {len_type} ni barbaadama, garuu {len_value} kenname.

source: Messages
om: Ergaawwan

source: Site Maps
om: Kaartaa Marsariitii

source: Static Files
om: Faayiloota Staatikii

source: Syndication
om: Sindiikeeshinii

source: That page number is not an integer
om: Lakkoofsi fuula sanaa intiijarii miti

source: That page number is less than 1
om: Lakkoofsi fuula sanaa 1 gadi

source: That page contains no results
om: Fuulli sun bu'aa hin qabu

source: Enter a valid value.
om: Gatii sirrii galchi.

source: Enter a valid domain name.
om: Maqaa domeenii sirrii galchi.

source: Enter a valid URL.
om: URL sirrii galchi.

source: Enter a valid integer.
om: Intiijarii sirrii galchi.

source: Enter a valid email address.
om: Teessoo imeelii sirrii galchi.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
om: “Slug” sirrii kan qubeewwan, lakkoofsota, underscore yookiin sarara qabu galchi.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
om: “Slug” sirrii kan qubeewwan Yuunikoodii, lakkoofsota, underscore yookiin sarara qabu galchi.

source: Enter a valid %(protocol)s address.
om: Teessoo %(protocol)s sirrii galchi.

source: IPv4 or IPv6
om: IPv4 yookiin IPv6

source: Enter only digits separated by commas.
om: Lakkoofsota komaadhaan gargar bahan qofa galchi.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
om: Gatiin kun %(limit_value)s ta'uu mirkaneeffadhu (kun %(show_value)s dha).

source: Ensure this value is less than or equal to %(limit_value)s.
om: Gatiin kun %(limit_value)s gadi yookiin wal-qixa ta'uu mirkaneeffadhu.

source: Ensure this value is greater than or equal to %(limit_value)s.
om: Gatiin kun %(limit_value)s ol yookiin wal-qixa ta'uu mirkaneeffadhu.

source: Ensure this value is a multiple of step size %(limit_value)s.
om: Gatiin kun baay'ataa %(limit_value)s ta'uu mirkaneeffadhu.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
om: Gatiin kun baay'ataa %(limit_value)s ta'uu, fi %(offset)s irraa kan eegalu ta'uu mirkaneeffadhu. Fkn: %(offset)s, %(valid_value1)s, %(valid_value2)s, fi kkf.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
om: Gatiin kun yoo xiqqaate qubee %(limit_value)d qabaachuu mirkaneeffadhu (amma %(show_value)d qaba).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
om: Gatiin kun qubee %(limit_value)d hin caalle qabaachuu mirkaneeffadhu (amma %(show_value)d qaba).

source: Enter a number.
om: Lakkoofsa galchi.

source: Ensure that there are no more than %(max)s digit in total.
om: Lakkoofsi waliigalaa %(max)s hin caalle ta'uu mirkaneeffadhu.

source: Ensure that there are no more than %(max)s decimal place.
om: Iddoon desimaalii %(max)s hin caalle ta'uu mirkaneeffadhu.

source: Ensure that there are no more than %(max)s digit before the decimal point.
om: Qabxii desimaalii dura dijiitii %(max)s hin caalle jiraachuu mirkaneeffadhu.

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
om: Gosa faayilaa “%(extension)s” hin eeyyamamu. Gosoonni eeyyamaman: %(allowed_extensions)s.

source: Null characters are not allowed.
om: Qubeewwan duwwaa hin eeyyamaman.

source: and
om: fi

source: %(model_name)s with this %(field_labels)s already exists.
om: %(model_name)s kan %(field_labels)s kana qabu kanaan dura jira.

source: Constraint “%(name)s” is violated.
om: Danqaan “%(name)s” cabera.

source: Value %(value)r is not a valid choice.
om: Gatiin %(value)r filannoo sirrii miti.

source: This field cannot be null.
om: Dirreen kun duwwaa ta'uu hin danda'u.

source: This field cannot be blank.
om: Dirreen kun banaa ta'uu hin danda'u.

source: %(model_name)s with this %(field_label)s already exists.
om: %(model_name)s kan %(field_label)s kana qabu kanaan dura jira.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
om: %(field_label)s %(date_field_label)s %(lookup_type)s tiif adda ta'uu qaba.

source: Field of type: %(field_type)s
om: Gosa dirree: %(field_type)s

source: “%(value)s” value must be either True or False.
om: Gatiin “%(value)s” Dhugaa (True) yookiin Soba (False) ta'uu qaba.

source: “%(value)s” value must be either True, False, or None.
om: Gatiin “%(value)s” Dhugaa, Soba, yookiin Duwwaa (None) ta'uu qaba.

source: Boolean (Either True or False)
om: Buuliyaanii (Dhugaa yookiin Soba)

source: String (up to %(max_length)s)
om: Jechoota (hanga %(max_length)s)

source: String (unlimited)
om: Jechoota (daangaa hin qabne)

source: Comma-separated integers
om: Intiijaroota komaan gargar bahan

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
om: Gatiin “%(value)s” foormaatii guyyaa sirrii hin qabu. Foormaatii YYYY-MM-DD ta'uu qaba.

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
om: Gatiin “%(value)s” foormaatii sirrii (YYYY-MM-DD) qaba, garuu guyyaan sirrii miti.

source: Date (without time)
om: Guyyaa (yeroo malee)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
om: Gatiin “%(value)s” foormaatii sirrii hin qabu. YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] ta'uu qaba.

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
om: Gatiin “%(value)s” foormaatii sirrii qaba garuu guyyaa/yeroo sirrii miti.

source: Date (with time)
om: Guyyaa (yeroo wajjin)

source: “%(value)s” value must be a decimal number.
om: Gatiin “%(value)s” lakkoofsa desimaalii ta'uu qaba.

source: Decimal number
om: Lakkoofsa desimaalii

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
om: Gatiin “%(value)s” foormaatii sirrii hin qabu. [DD] [[HH:]MM:]ss[.uuuuuu] ta'uu qaba.

source: Duration
om: Turtii

source: Email address
om: Teessoo Imeelii

source: File path
om: Teessoo Faayilaa

source: “%(value)s” value must be a float.
om: Gatiin “%(value)s” lakkoofsa 'float' ta'uu qaba.

source: Floating point number
om: Lakkoofsa 'Floating point'

source: “%(value)s” value must be an integer.
om: Gatiin “%(value)s” intiijarii ta'uu qaba.

source: Integer
om: Intiijarii

source: Big (8 byte) integer
om: Intiijarii Guddaa (8 byte)

source: Small integer
om: Intiijarii Xiqqaa

source: IPv4 address
om: Teessoo IPv4

source: IP address
om: Teessoo IP

source: “%(value)s” value must be either None, True or False.
om: Gatiin “%(value)s” Duwwaa, Dhugaa yookiin Soba ta'uu qaba.

source: Boolean (Either True, False or None)
om: Buuliyaanii (Dhugaa, Soba yookiin Duwwaa)

source: Positive big integer
om: Intiijarii guddaa pozitiivii

source: Positive integer
om: Intiijarii pozitiivii

source: Positive small integer
om: Intiijarii xiqqaa pozitiivii

source: Slug (up to %(max_length)s)
om: Slug (hanga %(max_length)s)

source: Text
om: Barreeffama

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
om: Gatiin “%(value)s” foormaatii sirrii hin qabu. HH:MM[:ss[.uuuuuu]] ta'uu qaba.

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
om: Gatiin “%(value)s” foormaatii sirrii qaba garuu yeroo sirrii miti.

source: Time
om: Yeroo

source: Raw binary data
om: Daataa baayinarii

source: “%(value)s” is not a valid UUID.
om: “%(value)s” UUID sirrii miti.

source: Universally unique identifier
om: Adda baasaa addunyaa (UUID)

source: File
om: Faayila

source: Image
om: Fakkii

source: A JSON object
om: Objeektii JSON

source: Value must be valid JSON.
om: Gatiin JSON sirrii ta'uu qaba.

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
om: %(model)s kan %(field)s %(value)r qabu filannoo sirrii miti.

source: Foreign Key (type determined by related field)
om: Foreign Key (kan dirree wal-qabatuun murtaa'u)

source: One-to-one relationship
om: Walitti dhufeenya Tokkoo-Tokko

source: %(from)s-%(to)s relationship
om: Walitti dhufeenya %(from)s-%(to)s

source: %(from)s-%(to)s relationships
om: Walitti dhufeenyota %(from)s-%(to)s

source: Many-to-many relationship
om: Walitti dhufeenya Baay'ee-Baay'ee

source: This field is required.
om: Dirree haguuguun dirqama.

source: Enter a whole number.
om: Lakkoofsa guutuu galchi.

source: Enter a valid date.
om: Guyyaa sirrii galchi.

source: Enter a valid time.
om: Yeroo sirrii galchi.

source: Enter a valid date/time.
om: Guyyaa/Yeroo sirrii galchi.

source: Enter a valid duration.
om: Turtii sirrii galchi.

source: The number of days must be between {min_days} and {max_days}.
om: Lakkoofsi guyyootaa {min_days} fi {max_days} gidduu ta'uu qaba.

source: No file was submitted. Check the encoding type on the form.
om: Faayilli hin galfamne. Gosa 'encoding' foormii sanaa ilaali.

source: No file was submitted.
om: Faayilli hin galfamne.

source: The submitted file is empty.
om: Faayilli galfame duwwaadha.

source: Ensure this filename has at most %(max)d character (it has %(length)d).
om: Maqaan faayilaa kun qubee %(max)d hin caalle qabaachuu mirkaneeffadhu (amma %(length)d qaba).

source: Please either submit a file or check the clear checkbox, not both.
om: Maaloo faayila galchi yookiin saanduqa 'clear' filadhu, lamaanuu miti.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
om: Fakkii sirrii ol fe'i. Faayilli ati feete fakkii miti yookiin fakkii badeedha.

source: Select a valid choice. %(value)s is not one of the available choices.
om: Filannoo sirrii filadhu. %(value)s filannoowwan jiran keessaa miti.

source: Enter a list of values.
om: Tarree gatiiwwanii galchi.

source: Enter a complete value.
om: Gatii guutuu galchi.

source: Enter a valid UUID.
om: UUID sirrii galchi.

source: Enter a valid JSON.
om: JSON sirrii galchi.

source: (Hidden field %(name)s) %(error)s
om: (Dirree dhokataa %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
om: Daataan ManagementForm dhabameera yookiin jijjiirameera. Dirreewwan dhabaman: %(field_names)s. Rakkoon kun yoo itti fufe gabaasa rakkoo (bug report) gochuu qabda.

source: Please submit at most %(num)d form.
om: Maaloo foormii %(num)d hin caalle galchi.

source: Please submit at least %(num)d form.
om: Maaloo foormii yoo xiqqaate %(num)d galchi.

source: Order
om: Ajaja

source: Delete
om: Haqi

source: Please correct the duplicate data for %(field)s.
om: Maaloo daataa irra deebi'ame %(field)s tiif sirreessi.

source: Please correct the duplicate data for %(field)s, which must be unique.
om: Maaloo daataa irra deebi'ame %(field)s tiif sirreessi, adda ta'uu qaba.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
om: Maaloo daataa irra deebi'ame %(field_name)s tiif sirreessi, kan %(lookup)s %(date_field)s keessatti adda ta'uu qabu.

source: Please correct the duplicate values below.
om: Maaloo gatiiwwan irra deebi'aman armaan gadii sirreessi.

source: The inline value did not match the parent instance.
om: Gatiin 'inline' warra isaa wajjin wal hin simu.

source: Select a valid choice. That choice is not one of the available choices.
om: Filannoo sirrii filadhu. Filannoon sun kanneen jiran keessaa miti.

source: “%(pk)s” is not a valid value.
om: “%(pk)s” gatii sirrii miti.

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
om: %(datetime)s zoonii yeroo %(current_timezone)s keessatti hiikamuu hin dandeenye; ifa miti yookiin hin jiru ta'a.

source: Clear
om: Qulqulleessi

source: Currently
om: Amma

source: Change
om: Jijjiiri

source: Unknown
om: Hin beekamu

source: Yes
om: Eeyyee

source: No
om: Lakki

source: yes,no,maybe
om: eeyyee,lakki,tarii

source: %(size)d byte
om: %(size)d baayitii

source: p.m.
om: wb

source: a.m.
om: wd

source: PM
om: WB

source: AM
om: WD

source: midnight
om: halkan walakkaa

source: noon
om: guyyaa walakkaa

source: Monday
om: Wiixata

source: Tuesday
om: Kibxata

source: Wednesday
om: Roobii

source: Thursday
om: Kamisa

source: Friday
om: Jimaata

source: Saturday
om: Sanbata

source: Sunday
om: Dilbata

source: Mon
om: Wix

source: Tue
om: Kib

source: Wed
om: Rob

source: Thu
om: Kam

source: Fri
om: Jim

source: Sat
om: San

source: Sun
om: Dil

source: January
om: Amajjii

source: February
om: Guraandhala

source: March
om: Bitootessa

source: April
om: Ebla

source: May
om: Caamsaa

source: June
om: Waxabajjii

source: July
om: Adooleessa

source: August
om: Hagayya

source: September
om: Fulbaana

source: October
om: Onkololeessa

source: November
om: Sadaasa

source: December
om: Muddee

source: jan
om: amaj

source: feb
om: gur

source: mar
om: bit

source: apr
om: ebl

source: may
om: caam

source: jun
om: wax

source: jul
om: adol

source: aug
om: hag

source: sep
om: ful

source: oct
om: onk

source: nov
om: sad

source: dec
om: mud

# abbrev. month
source: Jan.
om: Amaj.

# abbrev. month
source: Feb.
om: Gur.

# abbrev. month
source: March
om: Bit.

# abbrev. month
source: April
om: Ebl.

# abbrev. month
source: May
om: Caam.

# abbrev. month
source: June
om: Wax.

# abbrev. month
source: July
om: Adol.

# abbrev. month
source: Aug.
om: Hag.

# abbrev. month
source: Sept.
om: Ful.

# abbrev. month
source: Oct.
om: Onk.

# abbrev. month
source: Nov.
om: Sad.

# abbrev. month
source: Dec.
om: Mud.

# alt. month
source: January
om: Amajjii

# alt. month
source: February
om: Guraandhala

# alt. month
source: March
om: Bitootessa

# alt. month
source: April
om: Ebla

# alt. month
source: May
om: Caamsaa

# alt. month
source: June
om: Waxabajjii

# alt. month
source: July
om: Adooleessa

# alt. month
source: August
om: Hagayya

# alt. month
source: September
om: Fulbaana

# alt. month
source: October
om: Onkololeessa

# alt. month
source: November
om: Sadaasa

# alt. month
source: December
om: Muddee

source: This is not a valid IPv6 address.
om: Kun teessoo IPv6 sirrii miti.

source: or
om: yookiin

source: %(num)d year
om: waggaa %(num)d

source: %(num)d month
om: ji'a %(num)d

source: %(num)d week
om: torban %(num)d

source: %(num)d day
om: guyyaa %(num)d

source: %(num)d hour
om: sa'aatii %(num)d

source: %(num)d minute
om: daqiiqaa %(num)d

source: Forbidden
om: Dhoorkamaa

source: CSRF verification failed. Request aborted.
om: Mirkaneessi CSRF hin milkoofne. Gaaffiin kuteera.

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
om: Ergaa kana kan argituuf marsariitiin HTTPS kun 'Referer header' akka biraawzarii keetiin ergamu waan gaafatuuf, garuu homaa hin ergamne. Headeriin kun nageenyaaf barbaachisaadha.

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
om: Biraawzarii kee 'Referer' headers akka hin ergine yoo goote, maaloo deebisiitii eeyyami.

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
om: Tag <meta name="referrer" content="no-referrer"> fayyadamaa jirta yoo ta'e, maaloo irraa kaasi.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
om: Ergaa kana kan argituuf marsariitiin kun yeroo foormii galchitu CSRF cookie waan barbaaduufi.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
om: Biraawzarii kee cookies akka hin fudhanne yoo goote, maaloo deebisiitii eeyyami.

source: More information is available with DEBUG=True.
om: Odeeffannoon dabalataa yeroo DEBUG=True ta'u ni jiraata.

source: No year specified
om: Waggaan hin ibsamne

source: Date out of range
om: Guyyaan daangaa ala

source: No month specified
om: Ji'i hin ibsamne

source: No day specified
om: Guyyaan hin ibsamne

source: No week specified
om: Torban hin ibsamne

source: No %(verbose_name_plural)s available
om: %(verbose_name_plural)s hin jiru

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
om: %(verbose_name_plural)s gara fuulduraa hin jiru sababiinsaa %(class_name)s.allow_future Soba waan ta'eef.

source: Invalid date string “%(datestr)s” given format “%(format)s”
om: Guyyaan “%(datestr)s” foormaatii “%(format)s” wajjin hin deemu.

source: No %(verbose_name)s found matching the query
om: %(verbose_name)s barbaacha wajjin wal simu hin argamne

source: Page is not “last”, nor can it be converted to an int.
om: Fuulli “last” miti, yookiin gara intiijariitti jijjiiramuu hin danda'u.

source: Invalid page (%(page_number)s): %(message)s
om: Fuula dogoggoraa (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
om: Tarree duwwaa fi “%(class_name)s.allow_empty” Soba dha.

source: Directory indexes are not allowed here.
om: Indeeksii daayireektarii asitti hin eeyyamamu.

source: “%(path)s” does not exist
om: “%(path)s” hin jiru

source: Index of %(directory)s
om: Indeeksii %(directory)s

source: The install worked successfully! Congratulations!
om: Fe'iinsi milkaa'inaan hojjeteera! Baga Gammaddan!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
om: <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">Ibsa gadi-lakkisaa (release notes)</a> Django %(version)s ilaali

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
om: Fuula kana kan argituuf faayila settings kee keessatti <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> waan jiruufi, fi URL tokkoyyuu waan hin qopheessiniif.

source: Django Documentation
om: Dokumenteeshinii Django

source: Topics, references, &amp; how-to’s
om: Mata-dureewwan, wabiiwwan, &amp; akkamitti akka hojjetamu

source: Tutorial: A Polling App
om: Leenjii: Appii Filannoo

source: Get started with Django
om: Django eegali

source: Django Community
om: Hawaasa Django
