Repository: firaolterefe447-cyber/-arbor-market
Catalog: locale/om/LC_MESSAGES/django.po
Languages: om

source: Create PIN
om: PIN Uumi

source: Vehicle Information
om: Odeeffannoo Konkolaataa

source: Vehicle Model
om: Moodela Konkolaataa

source: Type your vehicle (e.g. Isuzu FSR)
om: Gosa konkolaataa kee barreessi (Fkn Isuzu FSR)

source: Please type the specific name of your vehicle.
om: Maaloo maqaa konkolaataa kee adda ta'e barreessi.

source: Capacity (KG)
om: Dandeettii (KG)

source: Legal Verification
om: Mirkaneessa Seeraa

source: Driving License Number
om: Lakkoofsa Hayyama Konkolaachisummaa

source: License #
om: Hayyama #

source: National ID
om: Waraqaa Eenyummaa

source: Clear photo of ID Front
om: Suuraa ID Fuulduraa Qulqulluu

source: Driving License
om: Hayyama Konkolaachisummaa

source: Clear photo of License
om: Suuraa Hayyamaa Qulqulluu

source: Submit Application
om: Iyyata Galchi

source: Join as Supplier | Arbor
om: Akka Dhiyeessaatti Makaami | Arbor

source: Supplier Partner
om: Michuu Dhiyeessaa

source: Connect with thousands of farmers.
om: Qotee bultoota kumootaan lakkaa'aman wajjin wal qunnami.

source: Business / Shop Name
om: Maqaa Daldalaa / Suuqii

source: Business Phone
om: Bilbila Daldalaa

source: Join Network
om: Networkiitti Makaami

source: Verified Business Network
om: Networkii Daldalaa Mirkanaa'e

source: Select Your Role | Arbor
om: Gahee Kee Filadhu | Arbor

source: Have an account?
om: Akkaawuntii qabdaa?

source: Join the
om: Kanatti Makaami

source: Digital Harvest
om: Oomisha Dijitaalaa

source: Connect directly with Ethiopia's agricultural ecosystem. Choose your path to start growing.
om: Sirna qonnaa Itoophiyaa wajjin kallattiin wal qunnami. Guddachuuf karaa kee filadhu.

source: Farmer
om: Qotee Bulaa

source: List your crops, manage your harvest, and sell directly to buyers with zero middlemen.
om: Oomisha kee galmeessi, oomisha kee bulchi, fi kallattiin bittaadhaaf gurguri daldalaa gidduu malee.

source: Join as Farmer
om: Akka Qotee Bulaatti Makaami

source: Buyer
om: Bitaa

source: Access fresh produce at fair prices. Buy individually or start a Group Buy with neighbors.
om: Oomisha firesh gatii madaalawaan argadhu. Kophaa biti yookiin ollaawwan wajjin Gareen Bituu eegali.

source: Join as Buyer
om: Akka Bitaatti Makaami

source: Sell fertilizers, seeds, and equipment directly to thousands of Ethiopian farmers.
om: Xao'o, sanyii, fi meeshaalee qotee bultoota Itoophiyaa kumootaan lakkaa'amaniif kallattiin gurguri.

source: Join as Supplier
om: Akka Dhiyeessaatti Makaami

source: Logistics
om: Geejjiba

source: Manage fleets, accept delivery jobs, and bridge the gap between farm and table.
om: Konkolaattota bulchi, hojii geejjibaa fudhadhu, fi qonnaa fi maaddii walitti fiigi.

source: Join Logistics
om: Geejjibatti Makaami

source: Terms
om: Haalota

source: Privacy
om: Dhuunfaa

source: Help
om: Gargaarsa

source: Supplier Command - Arbor
om: Ajaja Dhiyeessaa - Arbor

source: Main Market
om: Gabaa Guddaa

source: My Warehouse
om: Galma Koo

source: Manage your stock and prices.
om: Isitoo fi gatii kee bulchi.

source: Add Product
om: Oomisha Dabali

source: Price / Unit
om: Gatii / Yuniitii

source: Current Stock
om: Isitoo Ammaa

source: Out of Stock
om: Dhumera

source: Your warehouse is empty
om: Galmi kee duwwaadha

source: Start adding fertilizers or seeds to sell.
om: Xao'o yookiin sanyii gurguramu dabaluu eegali.

source: Add First Item
om: Meeshaa Jalqabaa Dabali

source: Market Intelligence
om: Odeeffannoo Gabaa

source: Live Farmer Prices
om: Gatii Qotee Bulaa Yeroo Ammaa

source: No market data available yet.
om: Ammatti daataan gabaa hin jiru.

source: Telebirr Payment
om: Kaffaltii Telebirr

source: Telebirr Logo
om: Asxaa Telebirr

source: Confirm Telebirr Payment
om: Kaffaltii Telebirr Mirkaneessi

source: Amount Due for Order #%(id)s:
om: Maallaqa Ajaja #%(id)s tiif Kaffalamu:

source: Enter Telebirr PIN
om: PIN Telebirr Galchi

source: Pay Now & Verify
om: Amma Kaffali & Mirkaneessi

source: Cancel Transaction
om: Dabarsa Haqi
