Repository: firaolterefe447-cyber/-arbor-market
Catalog: locale/so/LC_MESSAGES/django.po
Languages: so

source: Access farm-fresh prices directly.
so: Hel qiimaha beerta-cusub si toos ah.

source: PIN (4 Digits)
so: PIN (4 God)

source: Confirm PIN
so: Xaqiiji PIN-ka

source: Fair Prices • Farm Direct
so: Qiimo Macquul ah • Si Toos ah Beerta

source: Join Logistics | Arbor
so: Ku biir Saadka | Arbor

source: Language
so: Luuqadda

source: Delivery Partner
so: Wada-hawlgalayaasha Gaarsiinta

source: Join the Crowd-Delivery Network.
so: Ku biir Shabakadda Gaarsiinta Bulshada.

source: Personal Details
so: Faahfaahinta Shakhsiga

source: Surname
so: Magaca Aabaha

source: Create PIN
so: Samee PIN

source: Vehicle Information
so: Macluumaadka Gaadiidka

source: Vehicle Model
so: Nooca Gaadiidka

source: Type your vehicle (e.g. Isuzu FSR)
so: Qor nooca gaarigaaga (tusaale. Isuzu FSR)

source: Please type the specific name of your vehicle.
so: Fadlan qor magaca gaarka ah ee gaarigaaga.

source: Capacity (KG)
so: Awoodda (KG)

source: Legal Verification
so: Xaqiijinta Sharciga

source: Driving License Number
so: Lambarka Liisanka Wadista

source: License #
so: Liisanka #

source: National ID
so: Aqoonsiga Qaranka

source: Clear photo of ID Front
so: Sawir cad oo Aqoonsiga Hore ah

source: Driving License
so: Liisanka Wadista

source: Clear photo of License
so: Sawir cad oo Liisanka ah

source: Submit Application
so: Gudbi Codsiga

source: Join as Supplier | Arbor
so: Ku biir sidii Alaab-qeybiye | Arbor

source: Supplier Partner
so: Wada-hawlgalayaasha Alaab-qeybiyaha

source: Connect with thousands of farmers.
so: La xiriir kumanaan beeraley ah.

source: Business / Shop Name
so: Magaca Ganacsiga / Dukaanka

source: Business Phone
so: Telefoonka Ganacsiga

source: Join Network
so: Ku biir Shabakadda

source: Verified Business Network
so: Shabakadda Ganacsiga ee La Hubiyay

source: Select Your Role | Arbor
so: Dooro Doorkaaga | Arbor

source: Have an account?
so: Ma leedahay koonto?

source: Join the
so: Ku biir

source: Digital Harvest
so: Goynta Dijitaalka ah

source: Connect directly with Ethiopia's agricultural ecosystem. Choose your path to start growing.
so: Si toos ah ula xiriir nidaamka beeraha ee Itoobiya. Dooro waddadaada si aad u bilowdo koritaanka.

source: Farmer
so: Beeraley

source: List your crops, manage your harvest, and sell directly to buyers with zero middlemen.
so: Diiwaangeli dalagyadaada, maaree goyntaada, oo si toos ah uga iibi iibsadayaasha adigoo aan lahayn dillaaliin.

source: Join as Farmer
so: Ku biir sidii Beeraley

source: Buyer
so: Iibsade

source: Access fresh produce at fair prices. Buy individually or start a Group Buy with neighbors.
so: Hel badeecado cusub qiimo macquul ah. Si gaar ah u iibso ama bilow Iibsiga Wadareed adiga iyo deriska.

source: Join as Buyer
so: Ku biir sidii Iibsade

source: Sell fertilizers, seeds, and equipment directly to thousands of Ethiopian farmers.
so: Ka iibi bacrimiyeyaasha, abuurka, iyo qalabka si toos ah kumanaan beeraley Itoobiyaan ah.

source: Join as Supplier
so: Ku biir sidii Alaab-qeybiye

source: Logistics
so: Saadka (Logistics)

source: Manage fleets, accept delivery jobs, and bridge the gap between farm and table.
so: Maaree gaadiidka, aqbal shaqooyinka gaarsiinta, oo isku xir beerta iyo miiska.

source: Join Logistics
so: Ku biir Saadka

source: Terms
so: Shuruudaha

source: Privacy
so: Asturnaanta

source: Help
so: Caawimaad

source: Supplier Command - Arbor
so: Xarunta Alaab-qeybiyaha - Arbor

source: Main Market
so: Suuqa Weyn

source: My Warehouse
so: Bakhaarkayga

source: Manage your stock and prices.
so: Maaree keydkaaga iyo qiimayaasha.

source: Add Product
so: Ku dar Badeecad

source: Price / Unit
so: Qiimaha / Xabbo

source: Current Stock
so: Keydka Hadda

source: Out of Stock
so: Waa dhamaaday

source: Your warehouse is empty
so: Bakhaarkaagu waa madhan yahay

source: Start adding fertilizers or seeds to sell.
so: Bilow ku darista bacrimiyeyaasha ama abuurka si aad u iibiso.

source: Add First Item
so: Ku dar Shayga Ugu Horreeya

source: Market Intelligence
so: Xogta Suuqa

source: Live Farmer Prices
so: Qiimaha Beeraleyda ee Tooska ah

source: No market data available yet.
so: Weli xog suuq oo la heli karo ma jirto.

source: Telebirr Payment
so: Bixinta Telebirr

source: Telebirr Logo
so: Astaanta Telebirr

source: Confirm Telebirr Payment
so: Xaqiiji Bixinta Telebirr

source: Amount Due for Order #%(id)s:
so: Qadarka Laga Rabo Dalabka #%(id)s:

source: Enter Telebirr PIN
so: Geli PIN-ka Telebirr

source: Pay Now & Verify
so: Bixi Hadda & Xaqiiji

source: Cancel Transaction
so: Jooji Xawilaadda
