Repository: firaolterefe447-cyber/-arbor-market
Catalog: locale/so/LC_MESSAGES/django.po
Languages: so

source: Connect, get help, or contribute
so: Ku xidhnow, hel caawimo, ama wax ku biiri

source: title
so: cinwaan

source: password
so: erayga sirta

source: title a
so: cinwaan a

source: title b
so: cinwaan b

source: title c
so: cinwaan c

source: title d
so: cinwaan d

source: visits
so: booqashooyinka

source: Sorry, translation is not available.
so: Waan ka xunnahay, tarjumaad lama heli karo.

source: None
so: Eber

source: Product Name
so: Magaca Badeecada

source: Upload Harvest | Arbor
so: Geli Dalagga | Arbor

source: Upload Harvest
so: Geli Dalagga

source: Take a Photo
so: Sawir Qaad

source: Tap to select image
so: Guji si aad u doorato sawir

source: Optional
so: Ikhtiyaari

source: If you don't know the English name, leave it blank. Admin will fix it.
so: Haddii aadan aqoon magaca Ingiriisiga, bannaan uga tag. Maamulka ayaa hagaajin doona.

source: Price (ETB)
so: Qiimaha (Birr)

source: Quantity
so: Tirada

source: Farm Location
so: Goobta Beerta

source: List on Market
so: Ku dar Suuqa

source: Add Inventory - Arbor
so: Ku dar Keydka - Arbor

source: Add Inventory
so: Ku dar Keydka

source: Cancel
so: Jooji

source: Stock Qty
so: Tirada Keydka

source: Photo (Optional)
so: Sawir (Ikhtiyaari)

source: Add to Store
so: Ku dar Bakhaarka

source: Complete Payment
so: Dhamaystir Bixinta Lacagta

source: Complete Transfer
so: Dhamaystir Xawilaadda

source: Please send
so: Fadlan dir

source: ETB
so: Birr

source: Transfer to Seller:
so: Ku wareeji Iibiyaha:

source: Bank:
so: Bangiga:

source: CBE (Commercial Bank)
so: CBE (Bangiga Ganacsiga)

source: Account Name:
so: Magaca Koontada:

source: Copy
so: Nuqul

source: Upload Screenshot / Receipt
so: Soo geli Sawirka / Rasiidka

source: I have sent the money
so: Waan diray lacagta

source: Fresh Market - Arbor
so: Suuqa Cusub - Arbor

source: Arbor Market
so: Suuqa Arbor

source: Welcome,
so: Soo dhowow,

source: Logout
so: Ka bax

source: Fresh Organic Food
so: Cunto Cusub oo Dabiici ah

source: Direct from Ethiopia's Best Farmers
so: Si toos ah uga timid Beeraleyda ugu fiican Itoobiya

source: Now
so: Hadda

source: Available Harvests
so: Dalagga la heli karo

source: kg Stock
so: kg Keyd

source: Buy Now
so: Iibso Hadda

source: No crops listed yet. Farmers are planting! 🌱
so: Weli ma jiro dalag la diiwaangeliyay. Beeraleydu way beerayaan! 🌱

source: Checkout - Arbor
so: Bixinta Lacagta - Arbor

source: Checkout
so: Bixinta Lacagta

source: Review Order
so: Dib u eeg Dalabka

source: Sold by
so: Waxaa iibiyay

source: Unit Price
so: Qiimaha Halkii Xabbo

source: Order Details
so: Faahfaahinta Dalabka

source: MAX
so: Ugu Badnaan

source: Select Payment Method
so: Dooro Habka Lacag Bixinta

source: Cash on Delivery
so: Lacag bixinta marka la keeno

source: Mobile Banking
so: Bangiga Mobaylka

source: Total to Pay
so: Wadarta la bixinayo

source: Confirm Order
so: Xaqiiji Dalabka

source: Confirm Purchase
so: Xaqiiji Iibsiga

source: Review details before payment
so: Dib u eeg faahfaahinta ka hor bixinta

source: Product
so: Badeecada

source: Quantity Needed
so: Tirada Loo Baahan Yahay

source: Choose Payment Method
so: Dooro Habka Lacag Bixinta

source: Mobile Money
so: Lacagta Mobaylka

source: Pay Cash on Delivery
so: Ku bixi Lacag Caddaana markaad hesho

source: Start Group Buy - Arbor
so: Bilow Iibsi Wadareed - Arbor

source: Launch Group
so: Bilow Kooxda

source: Start New Group
so: Bilow Koox Cusub

source: Urban Group:
so: Kooxda Magaalada:

source: Fresh Food
so: Cunto Cusub

source: Farmer Co-op:
so: Iskaashatada Beeraleyda:

source: Farm Inputs
so: Agabka Beeraha

source: Group Name
so: Magaca Kooxda

source: Drop-off Location (For Buyers)
so: Goobta Dejinta (Ee Iibsadayaasha)

source: Collection Warehouse (For Farmers)
so: Bakhaarka Ururinta (Ee Beeraleyda)

source: Where will the truck unload the food?
so: Xagee gaarigu ku dejinayaa cuntada?

source: Where will the truck drop the fertilizer?
so: Xagee gaarigu ku dejinayaa bacrimiyaha?

source: Target Goal
so: Yoolka La Higsanayo

source: Units
so: Unugyo

source: Target Price
so: Qiimaha La Higsanayo

source: Deadline Date
so: Taariikhda Ugu Dambaysa

source: Cancel & Return Home
so: Jooji & Ku noqo Hoyga

source: Arbor Marketplace. Connecting communities.
so: Suuqa Arbor. Isku xidhka bulshooyinka.

source: Farmer Dashboard - Arbor
so: Guddiga Beeraleyda - Arbor

source: Market
so: Suuqa

source: My Farm Command
so: Xarunta Maamulka Beerta

source: Payment Verification Needed
so: Xaqiijinta Lacag Bixinta Ayaa Loo Baahan Yahay

source: Buyers have sent money via Mobile Banking. Please check receipts.
so: Iibsadayaashu waxay lacag ku soo direen Bangiga Mobaylka. Fadlan hubi rasiidhada.

source: View Receipt
so: Eeg Rasiidka

source: Confirm Receipt
so: Xaqiiji Rasiidka

source: Report Issue
so: Ka Warbixi Arrin

source: Your Harvest
so: Dalaggaaga

source: Manage your active listings and stock.
so: Maaree liisaskaaga firfircoon iyo keydka.

source: List New Crop
so: Diiwaangeli Dalag Cusub

source: Active Inventory
so: Keydka Firfircoon

source: ETB/kg
so: Birr/kg

source: Stock:
so: Keyd:

source: Sold Out
so: Waa la iibsaday dhamaan

source: Active
so: Firfircoon

source: Edit
so: Wax ka beddel

source: Are you sure you want to delete this crop? This cannot be undone.
so: Ma hubtaa inaad rabto inaad tirtirto dalaggan? Tan lagama noqon karo.

source: Your fields are empty.
so: Beerahaagu waa madhan yihiin.

source: List a crop to start selling!
so: Diiwaangeli dalag si aad u bilowdo iibinta!

source: Start Listing
so: Bilow Diiwaangelinta

source: Need Supplies?
so: Ma u baahan tahay Agab?

source: Buy Fertilizers, Seeds, and Tools from verified suppliers.
so: Ka iibso Bacrimiyeyaasha, Abuurka, iyo Qalabka alaab-qeybiyeyaal la hubiyay.

source: Open Material Store
so: Fur Dukaanka Agabka

source: Market Trends
so: Isbeddellada Suuqa

source: No market data available.
so: Xog suuq oo la heli karo ma jirto.

source: Fleet Manifest - Arbor
so: Liiska Shixnadda Gaadiidka - Arbor

source: Arbor Fleet
so: Gaadiidka Arbor

source: Official Logistics
so: Saadka Rasmiga ah

source: Driver ID:
so: Aqoonsiga Darawalka:

source: Daily Route
so: Jidka Maalinlaha ah

source: Assignments
so: Shaqooyinka

source: Order #
so: Dalabka #

source: Pickup From
so: Ka soo qaad

source: Deliver To
so: Gaarsii

source: Confirm Pickup
so: Xaqiiji Qaadista

source: Enter Buyer Code
so: Geli Koodhka Iibsadaha

source: Verify
so: Xaqiiji

source: Completed
so: La Dhammaystiray

source: All Clear
so: Dhamaan Waa Nadiif

source: Your manifest is empty.
so: Liiskaaga shixnaddu waa madhan yahay.

source: Logistics Dashboard - Arbor
so: Guddiga Saadka (Logistics) - Arbor

source: Dispatch
so: Dirid

source: SCORE
so: DHIBAALAHA

source: Your Manifest
so: Liiskaaga Shixnadda

source: View Details
so: Eeg Faahfaahinta

source: No active manifest.
so: Ma jiro liis shixnad oo firfircoon.

source: Total
so: Wadarta

source: My Jobs
so: Shaqooyinkayga

source: Post Trip
so: Diiwaangeli Safar

source: Order Feed
so: Liiska Dalabyada

source: Assigned to you
so: Lagugu qoray

source: Open
so: Furan

source: Done
so: La qabtay

source: Taken
so: La qaatay

source: From
so: Ka timid

source: To
so: Ku socota

source: No orders found.
so: Lama helin wax dalab ah.

source: Wait for new requests.
so: Sug codsiyo cusub.

source: Application Received - Arbor
so: Codsiga Waa La Helay - Arbor

source: Application Pending
so: Codsiga Waa La Sugayaa

source: We have received your application.
so: Waxaan helnay codsigaaga.

source: Please wait for Admin approval.
so: Fadlan sug oggolaanshaha Maamulka.

source: Status:
so: Xaaladda:

source: In Review...
so: Dib u eegis ku socota...

source: An admin must verify your account before you can access the Delivery Dashboard.
so: Maamule waa inuu xaqiijiyaa koontadaada ka hor inta aadan geli karin Guddiga Gaarsiinta.

source: Check Status (Login)
so: Hubi Xaaladda (Soo gal)

source: Back to Home Page
so: Ku noqo Bogga Hore

source: Edit Product
so: Wax ka beddel Badeecada

source: Crop Name
so: Magaca Dalagga

source: Stock (kg)
so: Keyd (kg)

source: Update Photo
so: Cusbooneysii Sawirka

source: Save Changes
so: Keydi Isbeddelada

source: Edit Order #
so: Wax ka beddel Dalabka #

source: Edit Order
so: Wax ka beddel Dalabka

source: Current Total:
so: Wadarta Hadda:

source: New Quantity
so: Tirada Cusub

source: Update Order
so: Cusbooneysii Dalabka

source: 's Farm - Arbor
so: 's Beerta - Arbor

source: Back to Market
so: Ku noqo Suuqa

source: Farm Profile
so: Profile-ka Beerta

source: Active Listings
so: Liiska Firfircoon

source: Full Harvest List
so: Liiska Dalagga oo Dhan

source: kg left
so: kg haray

source: In Stock
so: La Hayo

source: This farmer has no other active listings.
so: Beeraleygan ma laha liis kale oo firfircoon.

source: Community Hub - Arbor
so: Xarunta Bulshada - Arbor

source: My Farm
so: Beertayda

source: Command Center
so: Xarunta Amarka

source: Community Hub
so: Xarunta Bulshada

source: Sell
so: Iibi

source: Dashboard
so: Guddiga

source: Groups
so: Kooxaha

source: Orders
so: Dalabyada

source: Sign Out
so: Ka bax

source: Group Buying Center
so: Xarunta Iibsiga Wadareed

source: Join forces with neighbors. Buy together. Save together.
so: Midooba deriska. Wada iibsada. Wada kaydsada.

source: Groups You Manage
so: Kooxaha Aad Maamusho

source: Delivery:
so: Gaarsiinta:

source: Member List
so: Liiska Xubnaha

source: Name
so: Magaca

source: Phone
so: Telefoon

source: Action
so: Ficil

source: Kick this member?
so: Ma saartaa xubinkan?

source: Kick
so: Saar

source: Locked
so: Xiran

source: No members yet.
so: Weli xubno ma jiraan.

source: Total Order:
so: Wadarta Dalabka:

source: Goal
so: Yoolka

source: Finalize order?
so: Ma dhamaystirtaa dalabka?

source: Place Final Order
so: Gudbi Dalabka Kama Dambaysta ah

source: Waiting for members...
so: Sugaya xubnaha...

source: Order Placed
so: Dalabka waa la gudbiyay

source: Available Groups to Join
so: Kooxaha la heli karo in lagu biiro

source: Input Co-op
so: Iskaashatada Agabka

source: Urban Group
so: Kooxda Magaalada

source: Leader:
so: Hogaamiyaha:

source: Pickup Location
so: Goobta Laga Qaadayo

source: committed
so: loo ballan qaaday

source: Target:
so: Yoolka:

source: Group Price
so: Qiimaha Kooxda

source: Join
so: Ku biir

source: No active groups found.
so: Lama helin kooxo firfircoon.

source: Be the first to start a community group!
so: Noqo qofka ugu horreeya ee bilaaba koox bulsho!

source: Official Payment Partners
so: Wada-hawlgalayaasha Lacag Bixinta ee Rasmiga ah

source: Secure transactions via Ethiopia's trusted financial institutions.
so: Xawilaado ammaan ah iyadoo loo marayo hay'adaha maaliyadeed ee lagu kalsoon yahay ee Itoobiya.

source: Arbor Marketplace. All Rights Reserved.
so: Suuqa Arbor. Xuquuqda oo dhan way dhowran tahay.

source: Arbor - The Grand Market | Farm Direct
so: Arbor - Suuqa Weyn | Si Toos ah Beerta

source: Ethiopia's premier farm-to-table marketplace. Buy fresh, sell direct, and grow together.
so: Suuqa ugu horreeya ee Itoobiya ee beerta-ilaa-miiska. Iibso wax cusub, si toos ah u iibi, oo wada kora.

source: Cultivating...
so: Beerashada...

source: Type to pop up products...
so: Qor si aad u soo saarto badeecadaha...

source: Supplier Dashboard
so: Guddiga Alaab-qeybiyaha

source: Delivery Dashboard
so: Guddiga Gaarsiinta

source: Cart
so: Gaariga Iibsiga

source: Login
so: Soo gal

source: Join Now
so: Ku biir Hadda

source: Search...
so: Raadi...

source: Live Market • Addis Ababa
so: Suuqa Tooska ah • Addis Ababa

source: The Heart of
so: Wadnaha

source: Ethiopia's Harvest
so: Goynta Itoobiya

source: Direct from the soil to your table. We connect you with local farmers for the freshest produce at fair, transparent prices.
so: Si toos ah uga timid ciidda ilaa miiskaaga. Waxaan kugu xidhnaynaa beeraleyda maxalliga ah si aad u hesho dalagga ugu cusub qiimo macquul ah oo daah-furan.

source: List Harvest
so: Diiwaangeli Dalagga

source: Buy Inputs
so: Iibso Agabka Beeraha

source: List Material
so: Diiwaangeli Agab

source: View Input Market
so: Eeg Suuqa Agabka

source: View Routes
so: Eeg Jidadka

source: Active Orders
so: Dalabyada Firfircoon

source: Start Shopping
so: Bilow Iibsiga

source: Join Group Buy
so: Ku biir Iibsiga Wadareed

source: Select Your Language / ቋንቋ ይምረጡ
so: Dooro Luuqaddaada / ቋንቋ ይምረጡ

source: Filtering by:
so: Shaandheynta:

source: Browse by Category
so: Ka raadi Qeybta

source: All
so: Dhamaan

source: Fresh Harvest
so: Goyn Cusub

source: Buy
so: Iibso

source: Group
so: Koox

source: Marketplace Empty
so: Suuqa Waa Madhan Yahay

source: Check back soon!
so: Dib u soo eeg dhawaan!

source: Load More Harvests
so: Soo rar Dalagyo Dheeraad ah

source: Farm to Table in 3 Steps
so: Beerta ilaa Miiska 3 Tallaabo

source: Simple, Transparent, and Fast.
so: Fudud, Daah-furan, oo Degdeg ah.

source: Choose Fresh
so: Dooro Wax Cusub

source: Browse hundreds of daily listings directly from verified Ethiopian farmers.
so: Ka eeg boqolaal liis maalinle ah oo toos uga yimid beeraleyda Itoobiya ee la hubiyay.

source: Group & Save
so: Koox & Kaydso

source: Buy individually or join a Group Buy to unlock wholesale prices with neighbors.
so: Si gaar ah u iibso ama ku biir Iibsiga Wadareed si aad u hesho qiimaha jumlo adiga iyo deriska.

source: Fast Delivery
so: Gaarsiin Degdeg ah

source: We collect from the farm and deliver to your doorstep within 24 hours.
so: Waxaan ka soo ururinaa beerta oo aan kuu keennaa albaabkaaga 24 saacadood gudahood.

source: Join the Harvest
so: Ku biir Goynta

source: Get weekly market price updates, seasonal alerts, and exclusive group-buying deals delivered to your inbox.
so: Hel wararka cusub ee qiimaha suuqa toddobaadlaha ah, digniinaha xilliyeed, iyo heshiisyada gaarka ah ee iibsiga kooxeed ee laguugu soo diro sanduuqaaga.

source: your@email.com
so: emailkaaga@email.com

source: Subscribe
so: Is-diiwaangeli

source: Grand Market
so: Suuqa Weyn

source: Empowering Ethiopia's farmers through digital sovereignty.
so: Awood siinta beeraleyda Itoobiya iyada oo loo marayo madax-bannaanida dhijitaalka ah.

source: Marketplace
so: Suuqa

source: All Products
so: Dhamaan Badeecadaha

source: Fresh Vegetables
so: Khudaar Cusub

source: Support
so: Caawimaad

source: Help Center
so: Xarunta Caawinta

source: Track Order
so: Raadraac Dalabka

source: Legal
so: Sharci

source: Privacy Policy
so: Siyaasadda Asturnaanta

source: Terms of Service
so: Shuruudaha Adeegga

source: All rights reserved.
so: Xuquuqda oo dhan way dhowran tahay.

source: Arbor - Input Supplies | Farm Materials
so: Arbor - Agabka Beeraha | Qalabka Beeraha

source: Loading Supplies...
so: Soo raraya Agabka...

source: Search fertilizers, seeds, tools...
so: Raadi bacrimiyeyaasha, abuurka, qalabka...

source: Search inputs...
so: Raadi agabka...

source: Certified Inputs
so: Agab la Hubiyay

source: Fuel Your
so: Kobci

source: Farm's Growth
so: Koritaanka Beertaada

source: Premium seeds, fertilizers, and machinery from verified suppliers. Delivered directly to your cooperative.
so: Abuur tayo sare leh, bacrimiyeyaal, iyo mashiinno ka yimid alaab-qeybiyeyaal la hubiyay. Si toos ah loogu keenay iskaashatadaada.

source: List New Material
so: Diiwaangeli Agab Cusub

source: Available Supplies
so: Agabka La Heli Karo

source: Supplier
so: Alaab-qeybiye

source: General
so: Guud

source: /unit
so: /xabbo

source: left
so: haray

source: Restocking
so: Dib u buuxinta keydka

source: No Supplies Found
so: Lama Helin Wax Agab Ah

source: Try searching for a different item.
so: Isku day inaad raadiso shay kale.

source: Empowering Ethiopia's farmers through digital sovereignty. Direct farm-to-table connections, fair prices, and community-driven commerce.
so: Awood siinta beeraleyda Itoobiya iyada oo loo marayo madax-bannaanida dhijitaalka ah. Xidhiidh toos ah oo beerta-ilaa-miiska, qiimo macquul ah, iyo ganacsi bulshadu waddo.

source: Fruits & Berries
so: Miraha & Berry-ga

source: Bulk Grains
so: Badarka Jumlo

source: Become a Farmer
so: Noqo Beeraley

source: Made with 💚 for Ethiopia.
so: Waxaa lagu sameeyay 💚 Itoobiya.

source: Join Group - Arbor
so: Ku biir Kooxda - Arbor

source: ETB / unit
so: Birr / xabbo

source: units
so: xabbo

source: collected so far
so: la ururiyay ilaa hadda

source: How much do you want?
so: Imisa ayaad rabtaa?

source: Commit to Buy
so: Ballan qaad Iibsiga

source: My Favorite Farmers - Arbor
so: Beeraleyda aan Jeclahay - Arbor

source: Trusted Growers
so: Beeraleyda La Aaminsan Yahay

source: Likes
so: Jeceyl

source: Your Trusted Growers
so: Beeraleydaada La Aaminsan Yahay

source: Support the hands that feed you.
so: Taageer gacmaha ku quudiya.

source: Currently Growing
so: Hadda Beeraya

source: No crops listed currently.
so: Ma jiro dalag hadda la diiwaangeliyay.

source: Unfollow
so: Ha raacin

source: View Shop
so: Eeg Dukaanka

source: Empty Shop
so: Dukaan Madhan

source: No favorites yet
so: Weli ma jiraan kuwa la jecel yahay

source: Follow farmers to see their latest harvest here.
so: Raac beeraleyda si aad u aragto dalaggoodii ugu dambeeyay halkan.

source: Browse the Market
so: Ka dhex raadi Suuqa

source: Login | Arbor
so: Soo gal | Arbor

source: Welcome Back
so: Soo Dhowow Mar Kale

source: Enter your credentials to access your account.
so: Geli aqoonsigaaga si aad u gasho koontadaada.

source: Phone Number
so: Lambarka Telefoonka

source: 4-Digit PIN
so: PIN 4-God ah

source: Sign In
so: Soo Gal

source: Don't have an account?
so: Miyaadan lahayn koonto?

source: Create New Account
so: Sameyso Koonto Cusub

source: Arbor Marketplace
so: Suuqa Arbor

source: Manage My Groups
so: Maaree Kooxahayga

source: Home
so: Hoyga

source: My Managed Groups
so: Kooxaha aan Maamulo

source: Deliver to:
so: Gaarsii:

source: Current Status
so: Xaaladda Hadda

source: Member Name
so: Magaca Xubinka

source: Committed Qty
so: Tirada La Ballanqaaday

source: Kick this member out?
so: Ma saartaa xubinkan?

source: Remove
so: Ka saar

source: No members have joined yet.
so: Weli xubno ma ku soo biirin.

source: Total Quantity:
so: Wadarta Tirada:

source: This will finalize the group and send the order to delivery. Proceed?
so: Tani waxay dhamaystiri doontaa kooxda waxayna u diri doontaa dalabka gaarsiinta. Ma sii wadaa?

source: Sent to Delivery
so: Loo diray Gaarsiinta

source: You haven't created any groups yet.
so: Weli ma aadan samaynin wax kooxo ah.

source: My Orders | Arbor Market
so: Dalabyadayda | Suuqa Arbor

source: My Orders
so: Dalabyadayda

source: Group Buy
so: Iibsiga Wadareed

source: Order History
so: Taariikhda Dalabka

source: Track your farm-fresh deliveries in real-time.
so: Raadraac gaarsiintaada cusub ee beerta waqtiga dhabta ah.

source: %(count)s Active Order
so: %(count)s Dalab Firfircoon

source: Pending
so: La sugayo

source: Assigned
so: La qoray

source: On Way
so: Jidka ku soo jira

source: Delivered
so: La gaarsiiyay

source: Total Cost
so: Wadarta Kharashka

source: Placed On
so: La sameeyay

source: Delivery To
so: Gaarsiinta Ku socota

source: Driver
so: Darawal

source: Secure Delivery PIN
so: PIN-ka Gaarsiinta Ammaan

source: Give this code to %(name)s
so: Sii koodhkan %(name)s

source: Cancel this order?
so: Jooji dalabkan?

source: No active orders
so: Ma jiraan dalabyo firfircoon

source: Fresh produce is waiting. Start exploring the market to fill your basket.
so: Badeecado cusub ayaa ku sugaya. Bilow sahaminta suuqa si aad u buuxiso dambiishaada.

source: Trusted Payments
so: Lacag Bixin La Aaminsan Yahay

source: Secured by Ethiopia's financial network.
so: Waxaa ilaaliya shabakadda maaliyadeed ee Itoobiya.

source: Manifest #%(id)s - Arbor
so: Liiska Shixnadda #%(id)s - Arbor

source: Manifest #%(id)s
so: Liiska Shixnadda #%(id)s

source: Ordered On
so: La dalbaday

source: Status
so: Xaaladda

source: CASH HANDLING INSTRUCTIONS
so: TILMAAMAHA QABASHADA LACAGTA CAD

source: Step 1: Collect from Buyer
so: Tallaabada 1: Ka qaad Iibsadaha

source: Total Order Value
so: Wadarta Qiimaha Dalabka

source: Step 2: Pay to Seller
so: Tallaabada 2: Sii Iibiyaha

source: Hand this cash to Farmer
so: Gacanta u geli lacagtan Beeraleyda

source: Step 3: Platform Fee
so: Tallaabada 3: Kharashka Madal

source: Keep for Arbor Office
so: U hay Xafiiska Arbor

source: ⚠️ IMPORTANT: Do not give the full amount to the seller. Only give the 'Pay to Seller' amount.
so: ⚠️ MUHIIM: Ha siin iibiyaha wadarta buuxda. Kaliya sii lacagta 'Sii Iibiyaha'.

source: Cargo Details
so: Faahfaahinta Shixnadda

source: Item:
so: Shayga:

source: Quantity:
so: Tirada:

source: unit(s)
so: xabbo

source: Value:
so: Qiimaha:

source: Payout Details
so: Faahfaahinta Bixinta

source: Total Paid:
so: Wadarta La Bixiyay:

source: Platform Fee (5%%):
so: Kharashka Madal (5%%):

source: Your Earnings:
so: Dakhligaaga:

source: Payment & Notes
so: Lacag Bixinta & Xusuus-qor

source: Method:
so: Habka:

source: Note:
so: Xusuus:

source: Handle with care.
so: Si taxaddar leh u qabo.

source: Origin (Seller)
so: Asalka (Iibiye)

source: Transport
so: Gaadiidka

source: Enter Buyer PIN
so: Geli PIN-ka Iibsadaha

source: Verify & Complete
so: Xaqiiji & Dhamaystir

source: Ask Buyer for 4-digit code
so: Weydiiso Iibsadaha koodh 4-god ah

source: Job Complete
so: Shaqada Waa La Dhammeeyay

source: No Driver
so: Darawal Ma Jiro

source: Waiting for assignment...
so: Sugaya qorista...

source: Assign to Me
so: Ii qor

source: Auto-fill my details
so: Si otomaatig ah u buuxi faahfaahintayda

source: Destination (Buyer)
so: Goobta loo socdo (Iibsade)

source: Post a Trip - Arbor CDN
so: Diiwaangeli Safar - Arbor CDN

source: Post a Trip
so: Diiwaangeli Safar

source: Tell us where you are going to get matched.
so: Noo sheeg halka aad u socoto si laguu waafajiyo.

source: Origin
so: Asalka

source: Destination
so: Goobta loo socdo

source: Available Capacity (KG)
so: Awoodda La Heli Karo (KG)

source: Departure Date/Time
so: Taariikhda/Waqtiga Baxitaanka

source: Publish Trip
so: Daabac Safarka

source: Unit
so: Xabbo

source: Grown by
so: Waxaa beeray

source: Visit Farm
so: Booqasho Beerta

source: You might also like
so: Waxa laga yaabaa inaad sidoo kale jeclaato

source: My Profile - Arbor
so: Profile-kayga - Arbor

source: My Profile Settings
so: Habaynta Profile-kayga

source: Profile Picture
so: Sawirka Profile-ka

source: No Location Set
so: Goob Lama Dejin

source: Banking Info:
so: Macluumaadka Bangiga:

source: ⚠️ No bank details added.
so: ⚠️ Wax faahfaahin bangi ah laguma darin.

source: Edit Details
so: Wax ka beddel Faahfaahinta

source: Personal Information
so: Macluumaadka Shakhsiga

source: First Name
so: Magaca Koowaad

source: Last Name
so: Magaca Dambe

source: Location / Address
so: Goobta / Cinwaanka

source: Change Photo
so: Beddel Sawirka

source: Banking Details
so: Faahfaahinta Bangiga

source: Buyers will see this to transfer money to you via Mobile Banking.
so: Iibsadayaashu waxay arki doonaan tan si ay lacag kuugu soo diraan Bangiga Mobaylka.

source: Bank Name
so: Magaca Bangiga

source: Account Number
so: Lambarka Koontada

source: Save Changes 💾
so: Keydi Isbeddelada 💾

source: Join as Farmer | Arbor
so: Ku biir sidii Beeraley | Arbor

source: Back to
so: Ku noqo

source: Roles
so: Doorka

source: Farmer Registration
so: Diiwaangelinta Beeraleyda

source: Join the network. Sell your harvest.
so: Ku biir shabakadda. Iibi dalaggaaga.

source: e.g. Bishoftu
so: tusaale. Bishoftu

source: Confirm
so: Xaqiiji

source: Register Farm
so: Diiwaangeli Beerta

source: Already have an account?
so: Hore ma u lahayd koonto?

source: Login Here
so: Soo gal Halkan

source: Secure & Verified
so: Ammaan & La Hubiyay

source: Join as Buyer | Arbor
so: Ku biir sidii Iibsade | Arbor

source: Buyer Registration
so: Diiwaangelinta Iibsadaha
