Repository: firaolterefe447-cyber/-arbor-market
Catalog: locale/so/LC_MESSAGES/django.po
Languages: so

source: English
so: Ingiriisi

source: Amharic
so: Amxaari

source: Afaan Oromoo
so: Afaan Oromo

source: Somali
so: Soomaali

source: {editor}: Editing failed
so: {editor}: Tafatirku waa fashilmay

source: {editor}: Editing failed: {e}
so: {editor}: Tafatirku waa fashilmay: {e}

source: Options
so: Xulashooyinka

source: Got unexpected extra argument ({args})
so: Waxaa la helay dood dheeri ah oo aan la fileyn ({args})

source: DeprecationWarning: The command {name!r} is deprecated.{extra_message}
so: Digniin Gabow: Amarka {name!r} waa mid duugoobay.{extra_message}

source: Aborted!
so: Waa la joojiyay!

source: Commands
so: Amarada

source: Missing command.
so: Amarka waa maqan yahay.

source: No such command {name!r}.
so: Ma jiro amar noocaan ah {name!r}.

source: Value must be an iterable.
so: Qiimuhu waa inuu ahaadaa mid la celcelin karo.

source: Takes {nargs} values but 1 was given.
so: Wuxuu qaataa {nargs} qiimo laakiin 1 ayaa la bixiyay.

source: DeprecationWarning: The {param_type} {name!r} is deprecated.{extra_message}
so: Digniin Gabow: {param_type} {name!r} waa mid duugoobay.{extra_message}

source: default: {default}
so: asalka: {default}

source: (dynamic)
so: (firfircoon)

source: %(prog)s, version %(version)s
so: %(prog)s, nooca %(version)s

source: Show the version and exit.
so: Muuji nooca oo ka bax.

source: Show this message and exit.
so: Muuji farriintan oo ka bax.

source: Error: {message}
so: Khalad: {message}

source: Try '{command} {option}' for help.
so: Isku day '{command} {option}' wixii caawimaad ah.

source: Invalid value: {message}
so: Qiimo khaldan: {message}

source: Invalid value for {param_hint}: {message}
so: Qiimo khaldan ee {param_hint}: {message}

source: Missing argument
so: Dood maqan

source: Missing option
so: Xulasho maqan

source: Missing parameter
so: Halbeeg maqan

source: Missing {param_type}
so: {param_type} maqan

source: Missing parameter: {param_name}
so: Halbeeg maqan: {param_name}

source: No such option: {name}
so: Ma jirto xulasho noocaas ah: {name}

source: Did you mean {possibility}?
so: Ma waxaad ula jeedday {possibility}?

source: unknown error
so: khalad aan la garanayn

source: Could not open file {filename!r}: {message}
so: Lama furi karin faylka {filename!r}: {message}

source: Usage:
so: Isticmaalka:

source: Argument {name!r} takes {nargs} values.
so: Doodda {name!r} waxay qaadataa {nargs} qiimo.

source: Option {name!r} does not take a value.
so: Xulashada {name!r} ma qaadato qiimo.

source: Option {name!r} requires an argument.
so: Xulashada {name!r} waxay u baahan tahay dood.

source: Shell completion is not supported for Bash versions older than 4.4.
so: Dhameystirka Shell lama taageero noocyada Bash ka weyn 4.4.

source: Couldn't detect Bash version, shell completion is not supported.
so: Lama ogaan karin nooca Bash, dhameystirka shell lama taageero.

source: Repeat for confirmation
so: Ku celi xaqiijin

source: Error: The value you entered was invalid.
so: Khalad: Qiimaha aad gelisay waa mid aan sax ahayn.

source: Error: {e.message}
so: Khalad: {e.message}

source: Error: The two entered values do not match.
so: Khalad: Labada qiimo ee la geliyay isma waafaqsana.

source: Error: invalid input
so: Khalad: gelinta aan sax ahayn

source: Press any key to continue...
so: Riix fure kasta si aad u sii wadato...

source: Choose from: {choices}
so: Ka dooro: {choices}

source: {value!r} is not {choice}.
so: {value!r} maahan {choice}.

source: {value!r} does not match the format {format}.
so: {value!r} lama mid aha qaabka {format}.

source: {value!r} is not a valid {number_type}.
so: {value!r} maahan {number_type} sax ah.

source: {value} is not in the range {range}.
so: {value} kuma jiro inta u dhaxaysa {range}.

source: {value!r} is not a valid boolean. Recognized values: {states}
so: {value!r} maahan boolean sax ah. Qiimayaasha la aqoonsan yahay: {states}

source: {value!r} is not a valid UUID.
so: {value!r} maahan UUID sax ah.

source: file
so: fayl

source: directory
so: hagaha

source: path
so: waddo

source: {name} {filename!r} does not exist.
so: {name} {filename!r} ma jiro.

source: {name} {filename!r} is a file.
so: {name} {filename!r} waa fayl.

source: {name} {filename!r} is a directory.
so: {name} {filename!r} waa hagaha (directory).

source: {name} {filename!r} is not readable.
so: {name} {filename!r} lama akhrin karo.

source: {name} {filename!r} is not writable.
so: {name} {filename!r} lama qori karo.

source: {name} {filename!r} is not executable.
so: {name} {filename!r} lama fulin karo.

source: {len_type} values are required, but {len_value} was given.
so: {len_type} qiimo ayaa loo baahan yahay, laakiin {len_value} ayaa la bixiyay.

source: Messages
so: Farriimaha

source: Site Maps
so: Khariidadaha Goobta

source: Static Files
so: Faylasha aan isbeddelin

source: Syndication
so: Isku xidhka wararka

source: That page number is not an integer
so: Lambarka boggaas maahan tiro idil

source: That page number is less than 1
so: Lambarka boggaas wuxuu ka yar yahay 1

source: That page contains no results
so: Boggaas kuma jiraan wax natiijo ah

source: Enter a valid value.
so: Geli qiimo sax ah.

source: Enter a valid domain name.
so: Geli magac domain sax ah.

source: Enter a valid URL.
so: Geli URL sax ah.

source: Enter a valid integer.
so: Geli tiro idil oo sax ah.

source: Enter a valid email address.
so: Geli cinwaan email sax ah.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
so: Geli “slug” sax ah oo ka kooban xarfo, lambaro, xariiq hoosaad ama xariiq dhexe.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
so: Geli “slug” sax ah oo ka kooban xarfo Unicode, lambaro, xariiq hoosaad, ama xariiq dhexe.

source: Enter a valid %(protocol)s address.
so: Geli cinwaan %(protocol)s sax ah.

source: IPv4 or IPv6
so: IPv4 ama IPv6

source: Enter only digits separated by commas.
so: Geli kaliya lambaro ay u dhexeyso hakad.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
so: Hubi in qiimahan yahay %(limit_value)s (waa %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
so: Hubi in qiimahan ka yar yahay ama la mid yahay %(limit_value)s.

source: Ensure this value is greater than or equal to %(limit_value)s.
so: Hubi in qiimahan ka weyn yahay ama la mid yahay %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s.
so: Hubi in qiimahan yahay dhufan tallaabo %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
so: Hubi in qiimahan yahay dhufan tallaabo %(limit_value)s, laga bilaabo %(offset)s, tusaale. %(offset)s, %(valid_value1)s, %(valid_value2)s, iwm.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
so: Hubi in qiimahan leeyahay ugu yaraan %(limit_value)d xaraf (wuxuu leeyahay %(show_value)d).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
so: Hubi in qiimahan leeyahay ugu badnaan %(limit_value)d xaraf (wuxuu leeyahay %(show_value)d).

source: Enter a number.
so: Geli lambar.

source: Ensure that there are no more than %(max)s digit in total.
so: Hubi inaanay jirin wax ka badan %(max)s lambar guud ahaan.

source: Ensure that there are no more than %(max)s decimal place.
so: Hubi inaanay jirin wax ka badan %(max)s meel tobanle.

source: Ensure that there are no more than %(max)s digit before the decimal point.
so: Hubi inaanay jirin wax ka badan %(max)s lambar ka hor barta tobanlaha.

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
so: Nooca faylka “%(extension)s” lama oggola. Noocyada la oggol yahay waa: %(allowed_extensions)s.

source: Null characters are not allowed.
so: Xarfaha madhan lama oggola.

source: and
so: iyo

source: %(model_name)s with this %(field_labels)s already exists.
so: %(model_name)s leh %(field_labels)s kan mar hore ayuu jiraa.

source: Constraint “%(name)s” is violated.
so: Xannibaadda “%(name)s” waa lagu xadgudbay.

source: Value %(value)r is not a valid choice.
so: Qiimaha %(value)r maahan xulasho sax ah.

source: This field cannot be null.
so: Goobtani ma noqon karto eber.

source: This field cannot be blank.
so: Goobtani ma noqon karto bannaan.

source: %(model_name)s with this %(field_label)s already exists.
so: %(model_name)s leh %(field_label)s kan mar hore ayuu jiraa.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
so: %(field_label)s waa inay noqotaa mid gaar u ah %(date_field_label)s %(lookup_type)s.

source: Field of type: %(field_type)s
so: Nooca goobta: %(field_type)s

source: “%(value)s” value must be either True or False.
so: “%(value)s” qiimuhu waa inuu ahaadaa Run ama Been.

source: “%(value)s” value must be either True, False, or None.
so: “%(value)s” qiimuhu waa inuu ahaadaa Run, Been, ama Eber.

source: Boolean (Either True or False)
so: Boolean (Ama Run ama Been)

source: String (up to %(max_length)s)
so: Qoraal (ilaa %(max_length)s)

source: String (unlimited)
so: Qoraal (aan xadidnayn)

source: Comma-separated integers
so: Tirooyin idil oo hakad u dhexeeyo

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
so: “%(value)s” qiimuhu wuxuu leeyahay qaab taariikh khaldan. Waa inuu ahaadaa qaabka YYYY-MM-DD.

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
so: “%(value)s” qiimuhu wuxuu leeyahay qaab sax ah (YYYY-MM-DD) laakiin waa taariikh khaldan.

source: Date (without time)
so: Taariikh (wakhti la'aan)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
so: “%(value)s” qiimuhu wuxuu leeyahay qaab khaldan. Waa inuu ahaadaa qaabka YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ].

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
so: “%(value)s” qiimuhu wuxuu leeyahay qaab sax ah (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) laakiin waa taariikh/wakhti khaldan.

source: Date (with time)
so: Taariikh (leh wakhti)

source: “%(value)s” value must be a decimal number.
so: “%(value)s” qiimuhu waa inuu ahaadaa lambar tobanle.

source: Decimal number
so: Lambar tobanle

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
so: “%(value)s” qiimuhu wuxuu leeyahay qaab khaldan. Waa inuu ahaadaa qaabka [DD] [[HH:]MM:]ss[.uuuuuu].

source: Duration
so: Muddada

source: Email address
so: Cinwaanka emailka

source: File path
so: Waddada faylka

source: “%(value)s” value must be a float.
so: “%(value)s” qiimuhu waa inuu ahaadaa float.

source: Floating point number
so: Lambar dhibic sabaynaysa

source: “%(value)s” value must be an integer.
so: “%(value)s” qiimuhu waa inuu ahaadaa tiro idil.

source: Integer
so: Tiro idil

source: Big (8 byte) integer
so: Tiro idil weyn (8 byte)

source: Small integer
so: Tiro idil yar

source: IPv4 address
so: Cinwaanka IPv4

source: IP address
so: Cinwaanka IP

source: “%(value)s” value must be either None, True or False.
so: “%(value)s” qiimuhu waa inuu ahaadaa Eber, Run ama Been.

source: Boolean (Either True, False or None)
so: Boolean (Ama Run, Been ama Eber)

source: Positive big integer
so: Tiro idil togan oo weyn

source: Positive integer
so: Tiro idil togan

source: Positive small integer
so: Tiro idil togan oo yar

source: Slug (up to %(max_length)s)
so: Slug (ilaa %(max_length)s)

source: Text
so: Qoraal

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
so: “%(value)s” qiimuhu wuxuu leeyahay qaab khaldan. Waa inuu ahaadaa qaabka HH:MM[:ss[.uuuuuu]].

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
so: “%(value)s” qiimuhu wuxuu leeyahay qaab sax ah (HH:MM[:ss[.uuuuuu]]) laakiin waa wakhti khaldan.

source: Time
so: Wakhti

source: Raw binary data
so: Xogta binary cayriin

source: “%(value)s” is not a valid UUID.
so: “%(value)s” maahan UUID sax ah.

source: Universally unique identifier
so: Aqoonsi gaar ah oo caalami ah

source: File
so: Fayl

source: Image
so: Sawir

source: A JSON object
so: Shay JSON ah

source: Value must be valid JSON.
so: Qiimuhu waa inuu ahaadaa JSON sax ah.

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
so: %(model)s tusaale leh %(field)s %(value)r maahan xulasho sax ah.

source: Foreign Key (type determined by related field)
so: Furaha Shisheeye (nooca waxaa go'aamiya goobta la xidhiidha)

source: One-to-one relationship
so: Xidhiidh hal-ilaa-hal ah

source: %(from)s-%(to)s relationship
so: %(from)s-%(to)s xidhiidh

source: %(from)s-%(to)s relationships
so: %(from)s-%(to)s xidhiidho

source: Many-to-many relationship
so: Xidhiidh badan-ilaa-badan ah

source: This field is required.
so: Goobtani waa loo baahan yahay.

source: Enter a whole number.
so: Geli tiro buuxda.

source: Enter a valid date.
so: Geli taariikh sax ah.

source: Enter a valid time.
so: Geli wakhti sax ah.

source: Enter a valid date/time.
so: Geli taariikh/wakhti sax ah.

source: Enter a valid duration.
so: Geli muddo sax ah.

source: The number of days must be between {min_days} and {max_days}.
so: Tirada maalmaha waa inay u dhexeyso {min_days} iyo {max_days}.

source: No file was submitted. Check the encoding type on the form.
so: Wax fayl ah lama soo gudbin. Hubi nooca encoding ee foomka.

source: No file was submitted.
so: Wax fayl ah lama soo gudbin.

source: The submitted file is empty.
so: Faylka la soo gudbiyay waa madhan yahay.

source: Ensure this filename has at most %(max)d character (it has %(length)d).
so: Hubi in magaca faylkan leeyahay ugu badnaan %(max)d xaraf (wuxuu leeyahay %(length)d).

source: Please either submit a file or check the clear checkbox, not both.
so: Fadlan soo gudbi fayl ama sax sanduuqa nadiifinta, labadaba maya.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
so: Soo geli sawir sax ah. Faylka aad soo gelisay ma ahayn sawir ama wuxuu ahaa sawir ciladaysan.

source: Select a valid choice. %(value)s is not one of the available choices.
so: Dooro xulasho sax ah. %(value)s maahan mid ka mid ah xulashooyinka la heli karo.

source: Enter a list of values.
so: Geli liis qiimayaal ah.

source: Enter a complete value.
so: Geli qiimo dhamaystiran.

source: Enter a valid UUID.
so: Geli UUID sax ah.

source: Enter a valid JSON.
so: Geli JSON sax ah.

source: (Hidden field %(name)s) %(error)s
so: (Goob qarsoon %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
so: Xogta ManagementForm waa maqan tahay ama waa la fara-galiyay. Goobaha maqan: %(field_names)s. Waxaa laga yaabaa inaad u baahato inaad gudbiso warbixin khalad haddii arrintu sii socoto.

source: Please submit at most %(num)d form.
so: Fadlan soo gudbi ugu badnaan %(num)d foom.

source: Please submit at least %(num)d form.
so: Fadlan soo gudbi ugu yaraan %(num)d foom.

source: Order
so: Dalab

source: Delete
so: Tirtir

source: Please correct the duplicate data for %(field)s.
so: Fadlan sax xogta nuqulaysan ee %(field)s.

source: Please correct the duplicate data for %(field)s, which must be unique.
so: Fadlan sax xogta nuqulaysan ee %(field)s, taas oo ah inay noqoto mid gaar ah.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
so: Fadlan sax xogta nuqulaysan ee %(field_name)s taas oo ah inay noqoto mid gaar ah ee %(lookup)s ee ku jirta %(date_field)s.

source: Please correct the duplicate values below.
so: Fadlan sax qiimayaasha nuqulaysan ee hoose.

source: The inline value did not match the parent instance.
so: Qiimaha gudaha kuma habboona tusaalaha waalidka.

source: Select a valid choice. That choice is not one of the available choices.
so: Dooro xulasho sax ah. Xulashadaas maahan mid ka mid ah kuwa la heli karo.

source: “%(pk)s” is not a valid value.
so: “%(pk)s” maahan qiimo sax ah.

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
so: %(datetime)s laguma macnayn karin aaga wakhtiga %(current_timezone)s; laga yaabee inay mugdi ku jirto ama ayna jirin.

source: Clear
so: Nadiifi

source: Currently
so: Hadda

source: Change
so: Beddel

source: Unknown
so: Aan la aqoon

source: Yes
so: Haa

source: No
so: Maya

source: yes,no,maybe
so: haa,maya,laga yaabaa

source: p.m.
so: g.d.

source: a.m.
so: g.h.

source: PM
so: GD

source: AM
so: GH

source: midnight
so: saq dhexe

source: noon
so: duhur

source: Monday
so: Isniin

source: Tuesday
so: Salaaso

source: Wednesday
so: Arbaco

source: Thursday
so: Khamiis

source: Friday
so: Jimco

source: Saturday
so: Sabti

source: Sunday
so: Axad

source: Mon
so: Isn

source: Tue
so: Sal

source: Wed
so: Arb

source: Thu
so: Kha

source: Fri
so: Jim

source: Sat
so: Sab

source: Sun
so: Axa

source: January
so: Jannaayo

source: February
so: Febraayo

source: March
so: Maarso

source: April
so: Abriil

source: May
so: Maajo

source: June
so: Juun

source: July
so: Luulyo

source: August
so: Ogoosto

source: September
so: Sebtembar

source: October
so: Oktoobar

source: November
so: Nofembar

source: December
so: Desembar

# abbrev. month
source: March
so: Maarso

# abbrev. month
source: April
so: Abriil

# abbrev. month
source: May
so: Maajo

# abbrev. month
source: June
so: Juun

# abbrev. month
source: July
so: Luulyo

# abbrev. month
source: Aug.
so: Ogo.

# abbrev. month
source: Sept.
so: Seb.

# abbrev. month
source: Oct.
so: Okt.

# abbrev. month
source: Nov.
so: Nof.

# abbrev. month
source: Dec.
so: Des.

# alt. month
source: January
so: Jannaayo

# alt. month
source: February
so: Febraayo

# alt. month
source: March
so: Maarso

# alt. month
source: April
so: Abriil

# alt. month
source: May
so: Maajo

# alt. month
source: June
so: Juun

# alt. month
source: July
so: Luulyo

# alt. month
source: August
so: Ogoosto

# alt. month
source: September
so: Sebtembar

# alt. month
source: October
so: Oktoobar

# alt. month
source: November
so: Nofembar

# alt. month
source: December
so: Desembar

source: This is not a valid IPv6 address.
so: Kani maahan cinwaan IPv6 sax ah.

source: or
so: ama

source: %(num)d year
so: %(num)d sano

source: %(num)d month
so: %(num)d bil

source: %(num)d week
so: %(num)d toddobaad

source: %(num)d day
so: %(num)d maalin

source: %(num)d hour
so: %(num)d saacad

source: %(num)d minute
so: %(num)d daqiiqad

source: Forbidden
so: Waa mamnuuc

source: CSRF verification failed. Request aborted.
so: Xaqiijinta CSRF waa fashilantay. Codsigii waa la joojiyay.

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
so: Waxaad arkaysaa farriintan sababtoo ah boggan HTTPS wuxuu u baahan yahay “Referer header” inuu soo diro biraawsarkaaga, laakiin midna lama soo dirin. Tani waxaa loo baahan yahay sababo ammaan, si loo hubiyo in biraawsarkaaga aanay afduuban dhinacyo saddexaad.

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
so: Haddii aad u habaysay biraawsarkaaga inuu damiyo “Referer” headers, fadlan dib u shid, ugu yaraan boggan, ama xidhiidhada HTTPS, ama codsiyada “same-origin”.

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
so: Haddii aad isticmaalayso <meta name="referrer" content="no-referrer"> tag ama kuma jirto “Referrer-Policy: no-referrer” header, fadlan ka saar. Ilaalinta CSRF waxay u baahan tahay “Referer” header si loo sameeyo hubin adag. Haddii aad ka welwelsan tahay sirta, isticmaal beddelaadyo sida <a rel="noreferrer" …> xidhiidhada bogagga dhinac saddexaad.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
so: Waxaad arkaysaa farriintan sababtoo ah boggan wuxuu u baahan yahay CSRF cookie markaad gudbinayso foomamka. Cookie-gan waxaa loo baahan yahay sababo ammaan, si loo hubiyo in biraawsarkaaga aanay afduuban dhinacyo saddexaad.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
so: Haddii aad u habaysay biraawsarkaaga inuu damiyo cookies, fadlan dib u shid, ugu yaraan boggan, ama codsiyada “same-origin”.

source: More information is available with DEBUG=True.
so: Macluumaad dheeraad ah ayaa la heli karaa marka DEBUG=True.

source: No year specified
so: Sanad lama cayimin

source: Date out of range
so: Taariikhdu way ka baxsan tahay xadka

source: No month specified
so: Bil lama cayimin

source: No day specified
so: Maalin lama cayimin

source: No week specified
so: Toddobaad lama cayimin

source: No %(verbose_name_plural)s available
so: Ma jiro %(verbose_name_plural)s la heli karo

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
so: %(verbose_name_plural)s mustaqbalka lama heli karo sababtoo ah %(class_name)s.allow_future waa False.

source: Invalid date string “%(datestr)s” given format “%(format)s”
so: Taariikh qoraal khaldan “%(datestr)s” oo leh qaabka “%(format)s”

source: No %(verbose_name)s found matching the query
so: Lama helin %(verbose_name)s u dhigma weydiinta

source: Page is not “last”, nor can it be converted to an int.
so: Boggu maahan “last”, lamana beddeli karo int.

source: Invalid page (%(page_number)s): %(message)s
so: Bog khaldan (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
so: Liis madhan iyo “%(class_name)s.allow_empty” waa False.

source: Directory indexes are not allowed here.
so: Tusmooyinka Hagaha lama oggola halkan.

source: “%(path)s” does not exist
so: “%(path)s” ma jiro

source: Index of %(directory)s
so: Tusmada %(directory)s

source: The install worked successfully! Congratulations!
so: Rakibaadda way shaqaysay si guul leh! Hambalyo!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
so: Eeg <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">qoraalada sii deynta</a> ee Django %(version)s

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
so: Waxaad arkaysaa boggan sababtoo ah <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> ayaa ku jirta faylkaaga settings-ka mana aadan habaynin wax URLs ah.

source: Django Documentation
so: Dukumentiyada Django

source: Topics, references, &amp; how-to’s
so: Mawduucyada, tixraacyada, &amp; sida loo sameeyo

source: Tutorial: A Polling App
so: Tababarka: App-ka Codbixinta

source: Get started with Django
so: Ku bilow Django

source: Django Community
so: Bulshada Django
